{"full_context": ["Miss America gives honors and education scholarships.", "Miss America is good for women"], "id": 1}
{"full_context": ["I found online courses to not be well designed, flexible, or conducive to discussion.", "Online classes are not the best way to teach"], "id": 2}
{"full_context": ["Interns are replacing employees.", "Unpaid internship exploit college students"], "id": 3}
{"full_context": ["If home schooled children get to pick a high school sports team high school kids will want to be able to play for other schools.", "Home-schoolers should not play for high school teams"], "id": 4}
{"full_context": ["Labeling a product with \"natural\" is an attempt to portray the food as \"healthy\", but is often not the case.", "Restrict use of the word \"natural\" on food labels"], "id": 5}
{"full_context": ["The parking problems caused by the bike lanes are ruining attractions.", "New York's bike lanes are not working"], "id": 6}
{"full_context": ["If they play for high school team maybe they can overcome the prejudice of being home schooled.", "Home-schoolers should play for high school teams"], "id": 7}
{"full_context": ["Humans are naturally omnivorous, as dictated by our physiological needs, and veganism is a health risk.", "Veganism is not good for everyone"], "id": 8}
{"full_context": ["It can provide more vocational training which will better prepare students to handle their future jobs better.", "High school should last six years"], "id": 9}
{"full_context": ["Israel doesn't appreciate what we give them.", "Supporting Israel hurts"], "id": 10}
{"full_context": ["A regulated market has replaced an unregulated and dangerous black market.", "Colorado didn't go too far with pot"], "id": 11}
{"full_context": ["Salt shakers permit diners to control the amount of salt in their food.", "Salt should have a place at the table"], "id": 12}
{"full_context": ["Reality shows cause me to die a little whenever I see them advertised even though I have watched them at times.", "Reality shows are worse than other TV"], "id": 13}
{"full_context": ["Intramural and interscholastic have a place but not college sports which just train athletes for professional teams.", "Drop sports program in undergraduate schools"], "id": 14}
{"full_context": ["Cameras should monitor police officers 24/7.", "Police officers should be required to wear cameras"], "id": 15}
{"full_context": ["The only interest of the private sector is the bottom line profits.", "Privatization is a bad deal for cities and states"], "id": 16}
{"full_context": ["Vegan options like juices and replacement items are enriched with vitamins.", "Veganism is good for everyone"], "id": 17}
{"full_context": ["They operate in such a large economy that it makes it almost impossible for smaller banks to succeed.", "Big banks are out of control"], "id": 18}
{"full_context": ["There is no reason we shouldn't sell reasonable defensive arms to Taiwan.", "Keep selling arms to Taiwan"], "id": 19}
{"full_context": ["It undermines public education and emphasizes religious values over facts even though the two can easily co-exist.", "Home schoolers do not deserve a tax break"], "id": 20}
{"full_context": ["Reality shows fake misery, drama, and embarrassment and pretend as though it is real.", "Reality shows are worse than other TV"], "id": 21}
{"full_context": ["Libraries provide a venue for a number of desirable individual and shared life-enhancing activities.", "We need libraries"], "id": 22}
{"full_context": ["Not our fight.", "US should not attack Syria"], "id": 23}
{"full_context": ["A ratings solution, while messy, would be better than nothing.", "Government should grade colleges"], "id": 24}
{"full_context": ["Liberal arts provide knowledge to learn creative thinking, reading, and writing which are important to many career paths.", "Colleges need humanities programs"], "id": 25}
{"full_context": ["Libraries provide internet for those that need it to do homework, find employment, and file taxes.", "We need libraries"], "id": 26}
{"full_context": ["One can avoid and improve heavy traffic by using public transportation or biking.", "New York's bike lanes are working"], "id": 27}
{"full_context": ["This will cause more government interference in peoples lives relegating parents to a secondary role.", "Public preschool is not a smart investment"], "id": 28}
{"full_context": ["The spouse opinion may not be relevant to the campaign of the president.", "We don't need to hear from candidate's spouse"], "id": 29}
{"full_context": ["Having such high interest in a foundling industry with the economy struggling is proof of the electric cars viability.", "Electric cars will succeed"], "id": 30}
{"full_context": ["If race is such a big part of the economic hardships and the reasons people are denied opportunities, then economic based actions would be a better solution.", "Affirmative actions should be based on income"], "id": 31}
{"full_context": ["[They] are short term fix that quickly fades.", "Casinos are too much of a gamble"], "id": 32}
{"full_context": ["Internships are abused by employers and they should be monitored for misuse.", "Unpaid internship exploit college students"], "id": 33}
{"full_context": ["Criticism needs to be strongly raised when a reality show is sexist, racist, or misogynistic.", "Reality shows are worse than other TV"], "id": 34}
{"full_context": ["Working with Assad will help defeat radical islamists", "The U.S. should work with Assad to fight ISIS"], "id": 35}
{"full_context": ["Online courses should only be used as a low quality cost savings measure.", "Online classes are not the best way to teach"], "id": 36}
{"full_context": ["Giving all immigrants ID cards would allow police to get information about people from their home country.", "All immigrants should get ID cards"], "id": 37}
{"full_context": ["Greece cannot support its own economy and is bringing the Euro down.", "Greece will destroy the Euro Zone"], "id": 38}
{"full_context": ["America has more opportunity, but people are still loyal to their homes.", "Dual citizenship should be allowed"], "id": 39}
{"full_context": ["I have poor handwriting and  mainly use technology but cursive writing still feels important to me.", "Students should be taught cursive"], "id": 40}
{"full_context": ["The U.S. should support the Kurds only.", "The U.S. should not work with Assad to fight ISIS"], "id": 41}
{"full_context": ["The library brings community together as a center for development.", "We need libraries"], "id": 42}
{"full_context": ["The government is regulated by banks and corporations instead of governments actually regulating banks.", "Big banks are out of control"], "id": 43}
{"full_context": ["My library has many kinds of learning available and provides a community space for everyone, which I love.", "We need libraries"], "id": 44}
{"full_context": ["Social mobility is stifled by unpaid internships.", "Unpaid internship exploit college students"], "id": 45}
{"full_context": ["Disasters are locally handled by officials and neighbors.", "We don't need FEMA"], "id": 46}
{"full_context": ["Obamacare used low rates as a shell game to hide high deductibles and co-pays.", "Obamacare is not working"], "id": 47}
{"full_context": ["Unpaid interns are not just looking to gain experience.", "Unpaid internship exploit college students"], "id": 48}
{"full_context": ["Diners may not be able to select the server, but they can compensate them according to their service.", "To tip"], "id": 49}
{"full_context": ["People today lack common sense that cannot be taught.", "People are getting dumber"], "id": 50}
{"full_context": ["They have paid for the right through taxes and deserve the chance to further their athletic abilities.", "Home-schoolers should play for high school teams"], "id": 51}
{"full_context": ["Some people like a social place to read.", "We need libraries"], "id": 52}
{"full_context": ["Some kids are not taught by parents how to cook, and many schools have done away with home economics in favor of science and math.", "We need more advice about eating well"], "id": 53}
{"full_context": ["Most Americans live within commuting distance of universities.", "Students should live off campus"], "id": 54}
{"full_context": ["Stenographers' work can be put into an app.", "Court stenographers are not necessary"], "id": 55}
{"full_context": ["Broken windows policing saves money and increases quality of life, a powerful achievement.", "Strictly enforcing minor violations deter more serious crime"], "id": 56}
{"full_context": ["Syria has hurt its own people and it should be addressed.", "US should attack Syria"], "id": 57}
{"full_context": ["NATO is an organization without a purpose.", "We should disband NATO"], "id": 58}
{"full_context": ["College sports make tuition higher.", "Drop sports program in undergraduate schools"], "id": 59}
{"full_context": ["Internships are abused by employers and they should be monitored for misuse.", "Unpaid internship exploit college students"], "id": 60}
{"full_context": ["Police officers are occasionally untruthful or falsify evidence.", "Police officers should be required to wear cameras"], "id": 61}
{"full_context": ["Librarians ensure teachers have the necessary resources.", "School librarians are not expendable"], "id": 62}
{"full_context": ["Hosting the Olympics is a waste of money.", "Olympics are more trouble"], "id": 63}
{"full_context": ["It is unsupportable for companies to suppress employees' future career options.", "Businesses should not be allowed to have new employees sign noncompete deals"], "id": 64}
{"full_context": ["Economic growth needs innovation.", "3-D printing will change the world"], "id": 65}
{"full_context": ["Tipping rewards entrepreneurial spirit and hard work.", "To tip"], "id": 66}
{"full_context": ["Governments grading colleges will force colleges to be concerned with student outcome.", "Government should grade colleges"], "id": 67}
{"full_context": ["Understanding other culture is more important now than ever before.", "Colleges need humanities programs"], "id": 68}
{"full_context": ["Adults should be able to make their own choices.", "Colorado didn't go too far with pot"], "id": 69}
{"full_context": ["In highly respected publications there are numerous errors.", "People are getting dumber"], "id": 70}
{"full_context": ["Librarians have the ability to teach a special skill set to those who come to their buildings and they generally have the love of their job to do just that.", "School librarians are not expendable"], "id": 71}
{"full_context": ["There is a large rise of debt feeding big banks.", "Big banks are out of control"], "id": 72}
{"full_context": ["Casino's take advantage of people and create nothing of substance.", "Casinos are too much of a gamble"], "id": 73}
{"full_context": ["Vaccinations save lives.", "Vaccination should be mandatory for all children"], "id": 74}
{"full_context": ["Obamacare used low rates as a shell game to hide high deductibles and co-pays.", "Obamacare is not working"], "id": 75}
{"full_context": ["Enforcing minor violations sets the level of civility that is to be expected in neighborhoods.", "Strictly enforcing minor violations deter more serious crime"], "id": 76}
{"full_context": ["Deaf students need more specialized education.", "States need special schools for the deaf"], "id": 77}
{"full_context": ["Liberal arts provide knowledge to learn creative thinking, reading, and writing which are important to many career paths.", "Colleges need humanities programs"], "id": 78}
{"full_context": ["The CIA violates American laws for no reason.", "We don't need the C.I.A."], "id": 79}
{"full_context": ["Doping gives an unfair advantage to certain players which bothers me,", "Doping should not be allowed"], "id": 80}
{"full_context": ["Children need an adult to help them learn good working habits and help with their frustration.", "Parents should help their children with homework"], "id": 81}
{"full_context": ["Everyone needs plenty of rest, school should not interfere with that.", "School day should not be longer"], "id": 82}
{"full_context": ["Companies should not be able to patent DNA sequences that already exist.", "Companies shouldn't be allowed to patent genes"], "id": 83}
{"full_context": ["Learning just some French can help with travelling.", "Colleges need humanities programs"], "id": 84}
{"full_context": ["Offering 6 years of high school can aid in a better and more well rounded curriculum that will help lift students into well paying jobs.", "High school should last six years"], "id": 85}
{"full_context": ["Extreme parenting limits a child's ability to be independent.", "Extreme parenting is counterproductive"], "id": 86}
{"full_context": ["There are other ways to get your foot in the door besides unpaid internships.", "Unpaid internship exploit college students"], "id": 87}
{"full_context": ["I found online courses to not be well designed, flexible, or conducive to discussion.", "Online classes are not the best way to teach"], "id": 88}
{"full_context": ["Smaller banks are more likely to be rigorous in compliance with regulations, as they are beholden to their community.", "Big banks are out of control"], "id": 89}
{"full_context": ["Not vaccinating infringes on the rights of others.", "Vaccination should be mandatory for all children"], "id": 90}
{"full_context": ["Understanding other culture is more important now than ever before.", "Colleges need humanities programs"], "id": 91}
{"full_context": ["The CIA creates more enemies for the US through it's actions.", "We don't need the C.I.A."], "id": 92}
{"full_context": ["A computer is able to adapt to individual learning pace and needs.", "Online classes are the best way to teach"], "id": 93}
{"full_context": ["Libraries provide for lifelong learning.", "We need libraries"], "id": 94}
{"full_context": ["Politicians are criticized for pandering to unintelligent voters, so it makes no sense to demand that a larger number of such people be forced to vote.", "Voting should not be mandatory"], "id": 95}
{"full_context": ["Vaccination should remain a personal choice.", "Vaccination should not be mandatory for all children"], "id": 96}
{"full_context": ["We want the US to regulate so people will not be exploited.", "Internet gambling should be legalized"], "id": 97}
{"full_context": ["We should support humanities programs to create a intellectual ecosystem that is complex and evolved.", "Colleges need humanities programs"], "id": 98}
{"full_context": ["Children need down time to have fun and be young.", "School day should not be longer"], "id": 99}
{"full_context": ["Greece cannot support its own economy and is bringing the Euro down.", "Greece will destroy the Euro Zone"], "id": 100}
{"full_context": ["It is likely that Jewish people would be slaughtered, proof of that is what is happening between Egyptians and Muslims.", "Hamas-Fatah unity can't lead to mideast peace"], "id": 101}
{"full_context": ["Libraries are a wise addition.", "We need libraries"], "id": 102}
{"full_context": ["It would give dignity to both immigrants and democracy.", "All immigrants should get ID cards"], "id": 103}
{"full_context": ["Then there would be evidence instead of just opinion.", "Police officers should be required to wear cameras"], "id": 104}
{"full_context": ["My family took a trip around New York State and Connecticut, and it was epic.", "Parents should make vacation with kids"], "id": 105}
{"full_context": ["In recent years, there have been a few outbreaks of viruses that were once all but eradicated and they can be blamed on people who make \"capable\" choices.", "Vaccination should be mandatory for all children"], "id": 106}
{"full_context": ["Allocating resources to education is more useful than funding casinos", "Casinos are too much of a gamble"], "id": 107}
{"full_context": ["Vegans use pseudo-science  to pressure people into an unhealthy lifestyle.", "Veganism is not good for everyone"], "id": 108}
{"full_context": ["Legal identification would help police identify people.", "All immigrants should get ID cards"], "id": 109}
{"full_context": ["Humanities help students to process information and communicate with other people more effectively, sometimes in other languages.", "Colleges need humanities programs"], "id": 110}
{"full_context": ["Librarians have the ability to teach a special skill set to those who come to their buildings and they generally have the love of their job to do just that.", "School librarians are not expendable"], "id": 111}
{"full_context": ["These taxes make things more equal.", "Do not stop taxing capital gains"], "id": 112}
{"full_context": ["Israel is costing the US money and international reputation.", "Supporting Israel hurts"], "id": 113}
{"full_context": ["Educators should be held accountable in exchange for the federal dollars they receive.", "Government should grade colleges"], "id": 114}
{"full_context": ["Libraries provide a meeting places for many positive activities.", "We need libraries"], "id": 115}
{"full_context": ["Veganism is a moral and personal choice and should not be a lifestyle forced on everyone.", "Veganism is not good for everyone"], "id": 116}
{"full_context": ["Insurance companies will increase premiums or stop participating if they don't have enough people who sign up, rather than lose money.", "Obamacare is not working"], "id": 117}
{"full_context": ["The stronger of ISIS and Assad will be on top in the end so why prevent we need to get involved when we don't even know who's side to be on?", "The U.S. should not work with Assad to fight ISIS"], "id": 118}
{"full_context": ["It meant something to her generation to make a vow which she did to serve her people until her death.", "Queen Elizabeth II should not step down"], "id": 119}
{"full_context": ["Tenure allows for teachers who drink on the job or fall asleep at their desks to bargain for bonuses and increased retirement in order to get rid of them.", "Tenure protects bad teachers"], "id": 120}
{"full_context": ["Avoiding intellectual conflict creates stupid people who will not compromise for society.", "Parents should not control what kids learn at school"], "id": 121}
{"full_context": ["Columbia College lets low income students attend for almost no tuition cost.", "Wealthy colleges deserve tax breaks"], "id": 122}
{"full_context": ["Dual citizenship not being allowed is only enforced by the paranoid.", "Dual citizenship should be allowed"], "id": 123}
{"full_context": ["Kids that are homeschooled are still people.", "Home-schoolers should play for high school teams"], "id": 124}
{"full_context": ["Because prostitution has been illegal, it tends to be dominated by often violent pimps.", "Prostitution is safer when it's legal"], "id": 125}
{"full_context": ["The type of information reviewed is not useful enough.", "Government should not grade colleges"], "id": 126}
{"full_context": ["Supporting Israel undermines US national interests and policies in such an absurd way it is not understandable.", "Supporting Israel hurts"], "id": 127}
{"full_context": ["A computer is able to adapt to individual learning pace and needs.", "Online classes are the best way to teach"], "id": 128}
{"full_context": ["By arming Israel with military support, we are supporting their living under occupation as a broken people.", "Supporting Israel hurts"], "id": 129}
{"full_context": ["Large group housing is available elsewhere where students can find a unique experience.", "Students should live off campus"], "id": 130}
{"full_context": ["People who want extra salt should be able to enjoy it.", "Salt should have a place at the table"], "id": 131}
{"full_context": ["The only acceptable exemption should be a legitimate medical reason, such as a vaccine allergy.", "Vaccination should be mandatory for all children"], "id": 132}
{"full_context": ["Only those who are well off can afford to work without pay.", "Unpaid internship exploit college students"], "id": 133}
{"full_context": ["Technology and the economy have caused people to be less able to think for themselves.", "People are getting dumber"], "id": 134}
{"full_context": ["Libraries are elegant and nice buildings in my community.", "We need libraries"], "id": 135}
{"full_context": ["Obamacare was a return of healthcare to the free market.", "Obamacare is working"], "id": 136}
{"full_context": ["Libraries provide much needed activities for caregivers and young children in communities.", "We need libraries"], "id": 137}
{"full_context": ["Interns work as hard as regular employees.", "Unpaid internship exploit college students"], "id": 138}
{"full_context": ["Federal government mandates are less harmful than parent mandates.", "Parents should not control what kids learn at school"], "id": 139}
{"full_context": ["Professional work is important.", "We need professional critics"], "id": 140}
{"full_context": ["The combination of Prozac and talk therapy have been very effective for many depressed people.", "Prozac was a true step forward in medicine"], "id": 141}
{"full_context": ["Queen Elizabeth II lead through difficult time periods and is a continued source of pride for the United Kingdom.", "Queen Elizabeth II should not step down"], "id": 142}
{"full_context": ["Dual citizenship allows one to enjoy the pros and cons of the home country and the country that is welcoming them.", "Dual citizenship should be allowed"], "id": 143}
{"full_context": ["Undocumented people would no longer remain anonymous to the government.", "All immigrants should get ID cards"], "id": 144}
{"full_context": ["The rail is much safer.", "California needs high-speed rail"], "id": 145}
{"full_context": ["If home schooled children get to pick a high school sports team high school kids will want to be able to play for other schools.", "Home-schoolers should not play for high school teams"], "id": 146}
{"full_context": ["Teachers only have the assurance that they can't be fired on a whim.", "Tenure provides stability"], "id": 147}
{"full_context": ["Many in lesser developed areas have no access to computers, so the availability of 3D manufactured devices would depend on the provider. Bureaucracies are unlikely to willingly give up their jobs.", "3-D printing will not change the world"], "id": 148}
{"full_context": ["It should have the same health security as places like Amsterdam and Hamburg.", "Prostitution is safer when it's legal"], "id": 149}
{"full_context": ["Longer wait times increase the probability of needing fertility procedures.", "Women should not delay motherhood"], "id": 150}
{"full_context": ["The only interest of the private sector is the bottom line profits.", "Privatization is a bad deal for cities and states"], "id": 151}
{"full_context": ["Organic food doesn't taste any better, but costs more.", "Organic food is not worth the expense"], "id": 152}
{"full_context": ["A transcript produced by a competent reporter is irreplaceable, and not having one may sacrifice justice.", "Court stenographers are necessary"], "id": 153}
{"full_context": ["It is important seasoning and can be used in moderation.", "Salt should have a place at the table"], "id": 154}
{"full_context": ["Preschool can provide substantial early childhood education.", "Public preschool is a smart investment"], "id": 155}
{"full_context": ["These preschools will benefit the lower middle class too who do not get free childcare programs, so their children won't be left out and fall behind.", "Public preschool is a smart investment"], "id": 156}
{"full_context": ["There will always be a recording if the process is done correctly.", "Police officers should be required to wear cameras"], "id": 157}
{"full_context": ["Research papers uncover superficial uncritical thinking.", "Research papers are a useful exercise for college students"], "id": 158}
{"full_context": ["Realizing that gasoline is not the only way to fuel cars will lead to lots of  innovation.", "Electric cars will succeed"], "id": 159}
{"full_context": ["Starchitects adhere to a more rigorous set of industry standards than do local architects.", "'Starchitects' are not ruining cities"], "id": 160}
{"full_context": ["Tipping rewards entrepreneurial spirit and hard work.", "To tip"], "id": 161}
{"full_context": ["More education leads to more successful people.", "High school should last six years"], "id": 162}
{"full_context": ["Tips are insulting to customers and servers.", "Not to tip"], "id": 163}
{"full_context": ["Reality shows fake misery, drama, and embarrassment and pretend as though it is real.", "Reality shows are worse than other TV"], "id": 164}
{"full_context": ["Anyone refusing to vaccinate children should be liable for any disease or death they cause.", "Vaccination should be mandatory for all children"], "id": 165}
{"full_context": ["Obamacare lowered costs and children were able to utilize it until employment was found.", "Obamacare is working"], "id": 166}
{"full_context": ["Organic food doesn't taste any better, but costs more.", "Organic food is not worth the expense"], "id": 167}
{"full_context": ["Companies did not create the gene.", "Companies shouldn't be allowed to patent genes"], "id": 168}
{"full_context": ["Online classes can require a lot of repetitive exercises and leave the student at the mercy of the computer with regards to grading.", "Online classes are not the best way to teach"], "id": 169}
{"full_context": ["Americans need to learn about other cultures.", "Colleges need humanities programs"], "id": 170}
{"full_context": ["Senoi Indians believe that our dream state is the other side of our wakeful state, and is of equal importance.", "We should not manipulate our dreams"], "id": 171}
{"full_context": ["Drones are a deterrent.", "Drone attacts make more good"], "id": 172}
{"full_context": ["It is unfair for families affected by vaccine injuries to say that their suffering is for the greater good.", "Vaccination should not be mandatory for all children"], "id": 173}
{"full_context": ["Adults tend to begin to wear down around 3 in the afternoon, it is logical to believe that children would do the same.", "School day should not be longer"], "id": 174}
{"full_context": ["Libraries have always been about making information available to all people.", "We need libraries"], "id": 175}
{"full_context": ["Humanities help students to think about human dilemmas in a personal way.", "Colleges need humanities programs"], "id": 176}
{"full_context": ["Big Banks are not held accountable for the problems that they have caused so cannot be controlled.", "Big banks are out of control"], "id": 177}
{"full_context": ["It is unfair that employers must pay a penalty for hiring obese people.", "Legislation should not protect obese"], "id": 178}
{"full_context": ["It meant something to her generation to make a vow which she did to serve her people until her death.", "Queen Elizabeth II should not step down"], "id": 179}
{"full_context": ["Israel is acting inhumane.", "Supporting Israel hurts"], "id": 180}
{"full_context": ["Standards of work should include minimum wages.", "Unpaid internship exploit college students"], "id": 181}
{"full_context": ["Companies should disclose hacking attempts as a matter of national security.", "Disclosure makes consumers safer"], "id": 182}
{"full_context": ["People have the freedom to be left alone.", "Voting should not be mandatory"], "id": 183}
{"full_context": ["American foreign policy needs to serve American interests, not AIPAC or the Jewish state's paranoid pursuit of apartheid empire in the Mideast.", "Supporting Israel hurts"], "id": 184}
{"full_context": ["Banks are making big profits and forgetting to serve the public first.", "Fees should be more regulated"], "id": 185}
{"full_context": ["Humanities programs teach non-essential information.", "Colleges do not need humanities programs"], "id": 186}
{"full_context": ["Extreme parenting doesn't necessarily raise a compassionate child.", "Extreme parenting is counterproductive"], "id": 187}
{"full_context": ["[Not vaccinating] puts others at risk.", "Vaccination should be mandatory for all children"], "id": 188}
{"full_context": ["Punishing a country that violates the US Government's sense of morality without any threat to the US will harm society.", "US should not attack Syria"], "id": 189}
{"full_context": ["Research suggests salt is better for you than once thought.", "Salt should have a place at the table"], "id": 190}
{"full_context": ["Parents should either move to a better district or help improve public schooling instead of asking for a tax credit.", "Home schoolers do not deserve a tax break"], "id": 191}
{"full_context": ["The Rock Hall of Fame is a house of treasures.", "Rock Hall of Fame matters"], "id": 192}
{"full_context": ["School teachers perform the duties that libraries are expected too perform, and thus libraries are redundant.", "School librarians are expendable"], "id": 193}
{"full_context": ["Without Syria providing supplies to Hezbollah Israel would be at peace.", "US should attack Syria"], "id": 194}
{"full_context": ["Restaurants serve people, therefore they should provide things that make the customer happy, not force them into what the chef thinks is best.", "Salt should have a place at the table"], "id": 195}
{"full_context": ["Teachers are safe from review.", "Tenure protects bad teachers"], "id": 196}
{"full_context": ["New York's bike lanes are causing many accidents and injuries, the project was wasteful and not well planned.", "New York's bike lanes are not working"], "id": 197}
{"full_context": ["Banks can get bailed out, but young people with student loans are locked into debt.", "College free for everyone"], "id": 198}
{"full_context": ["Obamacare was a return of healthcare to the free market.", "Obamacare is working"], "id": 199}
{"full_context": ["The CIA missed many key events that occurred in the last 30 years.", "We don't need the C.I.A."], "id": 200}
{"full_context": ["French language study helps with understanding culture.", "Colleges need humanities programs"], "id": 201}
{"full_context": ["Humanities help students to process information and communicate with other people more effectively, sometimes in other languages.", "Colleges need humanities programs"], "id": 202}
{"full_context": ["Libraries level the playing field for people who cannot afford books.", "We need libraries"], "id": 203}
{"full_context": ["After crossing our border unlawfully they do not deserve an ID card as this is approval of being in our country", "All immigrants should not get ID cards"], "id": 204}
{"full_context": ["A parent at home can give more individual attention than can a  teacher of a large class.", "Parents should help their children with homework"], "id": 205}
{"full_context": ["Spanish classes were very useful when travelling.", "Colleges need humanities programs"], "id": 206}
{"full_context": ["Children can't thrive as vegans and require a diet containing animal products.", "Veganism is not good for everyone"], "id": 207}
{"full_context": ["Living off campus will help with off ceding debt.", "Students should live off campus"], "id": 208}
{"full_context": ["The health issues that accompany gambling would necessitate the government to spend money to counteract them.", "Internet gambling should not be legalized"], "id": 209}
{"full_context": ["The body does not function well without protein or carbs.", "Veganism is not good for everyone"], "id": 210}
{"full_context": ["Charter schools getting rid of problem students creates more problems.", "Charter schools are cherry-picking students"], "id": 211}
{"full_context": ["Libraries provide a meeting places for many positive activities.", "We need libraries"], "id": 212}
{"full_context": ["It should have the same health security as places like Amsterdam and Hamburg.", "Prostitution is safer when it's legal"], "id": 213}
{"full_context": ["The high cost of premiums will drive younger healthy people to avoid purchasing the insurance and instead pay the tax penalty.", "Obamacare is not working"], "id": 214}
{"full_context": ["Making it a state would force Israel to negotiate with them as an equal.", "Nations should recognize a Palestinian state"], "id": 215}
{"full_context": ["Internships only last for a short period of time, and those who do well will get a paid position or a recommendation.", "Unpaid internship doesn't exploit college students"], "id": 216}
{"full_context": ["My family took our kids on vacations and had a great time.", "Parents should make vacation with kids"], "id": 217}
{"full_context": ["Sports can help home-schooled children improve their social skills.", "Home-schoolers should play for high school teams"], "id": 218}
{"full_context": ["TFA has a low retention rate so it is not always considered successful.", "TFA has not raised the status of teachers"], "id": 219}
{"full_context": ["My daughter was simply lazy and not doing work, by cracking down I was able to get her to improve her grades.", "Extreme parenting leads to greater success"], "id": 220}
{"full_context": ["TFA has made teaching positions something that the best and brightest are in competition for.", "TFA has raised the status of public teachers"], "id": 221}
{"full_context": ["Obesity is a choice, not something forced on someone.", "Legislation should not protect obese"], "id": 222}
{"full_context": ["Cameras would benefit everyone.", "Police officers should be required to wear cameras"], "id": 223}
{"full_context": ["Language programs assist in communication between international companies.", "Colleges need humanities programs"], "id": 224}
{"full_context": ["Without tenure, there are too many little things that teachers could lose their jobs over.", "Tenure provides stability"], "id": 225}
{"full_context": ["Libraries are elegant and nice buildings in my community.", "We need libraries"], "id": 226}
{"full_context": ["Tax deductible contributions to higher education is likley to be a fixed sum; athletic programs drain money from academic programs.", "Drop sports program in undergraduate schools"], "id": 227}
{"full_context": ["FEMA just hands out money.", "We don't need FEMA"], "id": 228}
{"full_context": ["By legalizing prostitution, it can provide safeguards and protections.", "Prostitution is safer when it's legal"], "id": 229}
{"full_context": ["Preschools teach important skills such a taking turns, movement, and mediatation.", "Public preschool is a smart investment"], "id": 230}
{"full_context": ["Vegan diets are not enjoyable or easy to process.", "Veganism is not good for everyone"], "id": 231}
{"full_context": ["Tipping servers provides an added incentive to create a pleasant environment for the customers.", "To tip"], "id": 232}
{"full_context": ["As a nation, it is well known that Israel has a stockpile of nuclear weapons that they should be forced to give up.", "Supporting Israel hurts"], "id": 233}
{"full_context": ["Humanities programs teach non-essential information.", "Colleges do not need humanities programs"], "id": 234}
{"full_context": ["America has historically misled Muslims while allowing Israel to have weapons of mass destruction.", "Supporting Israel hurts"], "id": 235}
{"full_context": ["Younger moms have much more energy.", "Women should not delay motherhood"], "id": 236}
{"full_context": ["They keep good records.", "Court stenographers are necessary"], "id": 237}
{"full_context": ["There are other ways to get your foot in the door besides unpaid internships.", "Unpaid internship exploit college students"], "id": 238}
{"full_context": ["The embargo hurts our own economy.", "The U.S. should lift sanctions with Cuba"], "id": 239}
{"full_context": ["Teaching students in the use of digital tools would be helpful.", "Research papers are a useful exercise for college students"], "id": 240}
{"full_context": ["Israel is a dishonest broker and has commited crimes against innocent people. They have broken promises and have an atomic bomb.", "Supporting Israel hurts"], "id": 241}
{"full_context": ["Government usage of drone's will inevitably lead to using drone's on citizens.", "Drone attacks make more harm"], "id": 242}
{"full_context": ["Veganism causes people to be very thin and look unhealthy.", "Veganism is not good for everyone"], "id": 243}
{"full_context": ["The government getting rid of usury laws allowed banks to charge high fees.", "Fees should be more regulated"], "id": 244}
{"full_context": ["The uber conservative republicans are the ones pushing privatization the most.", "Privatization is a bad deal for cities and states"], "id": 245}
{"full_context": ["My children's schooldays are too long to keep their attention.", "School day should not be longer"], "id": 246}
{"full_context": ["Humanities courses ensure students are exposed to other cultures.", "Colleges need humanities programs"], "id": 247}
{"full_context": ["Because of tenure, only a very small number of teachers are fired for cause.", "Tenure protects bad teachers"], "id": 248}
{"full_context": ["The cost efficiency of electric cars will make gasoline powered vehicles go away", "Electric cars will succeed"], "id": 249}
{"full_context": ["The US (not alone) with our allies will have to do something IF there's enough solid evidence of Syrian government using chemical weapons against its own people.", "US should attack Syria"], "id": 250}
{"full_context": ["A rail provides connections and efficiency.", "California needs high-speed rail"], "id": 251}
{"full_context": ["Humanities help students to appreciate early teachings of Greeks and Romans.", "Colleges need humanities programs"], "id": 252}
{"full_context": ["TFA does not provide skilled teachers to students.", "TFA has not raised the status of teachers"], "id": 253}
{"full_context": ["Kate and William appear to have a normal, modern relationship that does not seem to be threatened by outsiders.", "Royal Couple could be a modern family"], "id": 254}
{"full_context": ["It is not the job of a public school teacher to raise children - that is the parents' job.", "School day should not be longer"], "id": 255}
{"full_context": ["The Kindle requires you to buy ebooks only from Amazon, instead of other sources.", "Amazon will kill off publishers"], "id": 256}
{"full_context": ["I'm still able to bike to work.", "New York's bike lanes are working"], "id": 257}
{"full_context": ["Farms should use mechanization to reduce costs.", "Farms could survive without illegal labor"], "id": 258}
{"full_context": ["Teachers become better and more consistent with more experience.", "Teachers need to have experience"], "id": 259}
{"full_context": ["I don't think there will be enough passengers to make a high-speed rail economic.", "California doesn't need high-speed rail"], "id": 260}
{"full_context": ["Fertility treatments took a toll on me personally and professionally.", "Women should not delay motherhood"], "id": 261}
{"full_context": ["The CIA is not very secretive which makes them ineffective.", "We don't need the C.I.A."], "id": 262}
{"full_context": ["Accounts should not be listed as free, when they include hidden fees.", "Fees should be more regulated"], "id": 263}
{"full_context": ["It is their own discretion if they want to take drugs that will affect only themselves in the long run.", "Doping should be allowed"], "id": 264}
{"full_context": ["Homeschooling is a choice.", "Home schoolers do not deserve a tax break"], "id": 265}
{"full_context": ["Kids wish to know their grandparents.", "Women should not delay motherhood"], "id": 266}
{"full_context": ["We want the US to regulate so people will not be exploited.", "Internet gambling should be legalized"], "id": 267}
{"full_context": ["High speed rail in California would be a boost to a busy rail corridor and show the rest of the US how to implement their own.", "California needs high-speed rail"], "id": 268}
{"full_context": ["It's the best we could do with circumstances aren't likey to change soon.", "Obamacare is working"], "id": 269}
{"full_context": ["The lottery and gambling and harmful to individuals and families that waste their money on them.", "Internet gambling should not be legalized"], "id": 270}
{"full_context": ["Although the speech is hateful, off duty actions cannot be considered to fire someone.", "Speech cannot be limited for public workers"], "id": 271}
{"full_context": ["Vaccination does more harm than good.", "Vaccination should not be mandatory for all children"], "id": 272}
{"full_context": ["Growers could replant mechanically harvestable trees.", "Farms could survive without illegal labor"], "id": 273}
{"full_context": ["Internships permit students to work for free in order to prove that the student is worthy of future, paid work.", "Unpaid internship doesn't exploit college students"], "id": 274}
{"full_context": ["This would allow for worker to have higher wages.", "Not to tip"], "id": 275}
{"full_context": ["Many young women don't realize the difficulties of IVF.", "Women should not delay motherhood"], "id": 276}
{"full_context": ["Workers in legal brothels are safe and there by choice where violence and abuse are minimized.", "Prostitution is safer when it's legal"], "id": 277}
{"full_context": ["I have poor handwriting and  mainly use technology but cursive writing still feels important to me.", "Students should be taught cursive"], "id": 278}
{"full_context": ["Favoritism should not be granted to a few who school their children at home, jeopardizing the education of the public.", "Home schoolers do not deserve a tax break"], "id": 279}
{"full_context": ["Understanding other culture is more important now than ever before.", "Colleges need humanities programs"], "id": 280}
{"full_context": ["It is illegal to attack a country except in self-defense.", "US should not attack Syria"], "id": 281}
{"full_context": ["We can learn healthy habits to defend against the marketing of the food industrial complex.", "We need more advice about eating well"], "id": 282}
{"full_context": ["Libraries are a wise addition.", "We need libraries"], "id": 283}
{"full_context": ["New York's bike lanes are causing many accidents and injuries, the project was wasteful and not well planned.", "New York's bike lanes are not working"], "id": 284}
{"full_context": ["The internet provides this kind of information for free.", "Colleges do not need humanities programs"], "id": 285}
{"full_context": ["Israel is costing the US money and international reputation.", "Supporting Israel hurts"], "id": 286}
{"full_context": ["These preschools will benefit the lower middle class too who do not get free childcare programs, so their children won't be left out and fall behind.", "Public preschool is a smart investment"], "id": 287}
{"full_context": ["Libraries have always been about making information available to all people.", "We need libraries"], "id": 288}
{"full_context": ["A proper library should be a focal point for it's community.", "We need libraries"], "id": 289}
{"full_context": ["Students need to think critically and outside of conventional ideas.", "Colleges need humanities programs"], "id": 290}
{"full_context": ["Not vaccinating endangers the public and violates the establishment clause of the first amendment.", "Vaccination should be mandatory for all children"], "id": 291}
{"full_context": ["Humanities help students to appreciate early teachings of Greeks and Romans.", "Colleges need humanities programs"], "id": 292}
{"full_context": ["Some people like a social place to read.", "We need libraries"], "id": 293}
{"full_context": ["JPM didn't control it's traders or know what they were doing.", "Big banks are out of control"], "id": 294}
{"full_context": ["The security of tenure is necessary to compensate for the low salary of teachers.", "Tenure provides stability"], "id": 295}
{"full_context": ["Obese individuals should care for themselves both for their own health and the economic burden on society as a whole.", "Legislation should not protect obese"], "id": 296}
{"full_context": ["TFA has made teaching positions something that the best and brightest are in competition for.", "TFA has raised the status of public teachers"], "id": 297}
{"full_context": ["The internet provides this kind of information for free.", "Colleges do not need humanities programs"], "id": 298}
{"full_context": ["Wal-Mart is doing well for trying to help consumers eat better.", "Wal-Mart can make us healthier"], "id": 299}
{"full_context": ["The chef can't know how each person wants their food seasoned.", "Salt should have a place at the table"], "id": 300}
{"full_context": ["The spouses are a reflection of the strength of the candidate, by how they chose to marry the candidate.", "We need to hear from candidate's spouse"], "id": 301}
{"full_context": ["It will be sad when libraries become only access points for the Internet.", "We need libraries"], "id": 302}
{"full_context": ["I use the library often and it would negatively impact the community to lose these resources.", "We need libraries"], "id": 303}
{"full_context": ["People today lack common sense that cannot be taught.", "People are getting dumber"], "id": 304}
{"full_context": ["Disasters can strike at anytime in the USA so a government program is needed.", "We need FEMA"], "id": 305}
{"full_context": ["If they didn't have to spend money on competitive sports it could be spent on research and education.", "Drop sports program in undergraduate schools"], "id": 306}
{"full_context": ["Humanities programs are meant to enrich everyone.", "Colleges need humanities programs"], "id": 307}
{"full_context": ["Mandatory reports would make a psychotherapists job useless.", "No, the laws should not be toughened"], "id": 308}
{"full_context": ["If you do not respect your child's choices while providing parental support then they will not be successful.", "Tracking kids invades privacy"], "id": 309}
{"full_context": ["The only acceptable exemption should be a legitimate medical reason, such as a vaccine allergy.", "Vaccination should be mandatory for all children"], "id": 310}
{"full_context": ["Salt is useful for replacing electrolytes lost through exercise.", "Salt should have a place at the table"], "id": 311}
{"full_context": ["Socioecomonics should play a higher role in college admissions instead of race.", "Affirmative actions should be based on income"], "id": 312}
{"full_context": ["Many young women don't realize the difficulties of IVF.", "Women should not delay motherhood"], "id": 313}
{"full_context": ["It gives all children a head start on non-academic skills.", "Public preschool is a smart investment"], "id": 314}
{"full_context": ["Farms should use mechanization to reduce costs.", "Farms could survive without illegal labor"], "id": 315}
{"full_context": ["Writing cursive can stimulate thinking.", "Students should be taught cursive"], "id": 316}
{"full_context": ["3-D printing cannot use many of the raw materials presently used in manufacturing.", "3-D printing will not change the world"], "id": 317}
{"full_context": ["Big banks will only look out for themselves and then drain the government when they fail.", "Big banks are out of control"], "id": 318}
{"full_context": ["Even if there is no instruction preschool helps children mature.", "Public preschool is a smart investment"], "id": 319}
{"full_context": ["If performance enhancing drugs are allowed it will be unfair to those not interested in taking them.", "Doping should not be allowed"], "id": 320}
{"full_context": ["Doctors advocate for vaccines even though they know they carry risks.", "Vaccination should not be mandatory for all children"], "id": 321}
{"full_context": ["Genes belong to the people they are inside of.", "Companies shouldn't be allowed to patent genes"], "id": 322}
{"full_context": ["These games really only serve as a frivolous event that benefits construction companies with connections.", "Olympics are more trouble"], "id": 323}
{"full_context": ["In other parts of the world, including Japan, Europe, and New Zealand, restaurant employees earn a living wage and aren't dependent on patrons' tips.", "Not to tip"], "id": 324}
{"full_context": ["The humanities are important for developing a student's creative and critical thinking which are important skills for succeeding in a global economy.", "Colleges need humanities programs"], "id": 325}
{"full_context": ["American foreign policy needs to serve American interests, not AIPAC or the Jewish state's paranoid pursuit of apartheid empire in the Mideast.", "Supporting Israel hurts"], "id": 326}
{"full_context": ["Working in a legal brothel makes prostitutes happier.", "Prostitution is safer when it's legal"], "id": 327}
{"full_context": ["Without the CIA, there would be more terrorism on US soil.", "We need the C.I.A."], "id": 328}
{"full_context": ["Private moments are now publicized where anybody can comment.", "Social media ruin romance"], "id": 329}
{"full_context": ["Israel is acting inhumane.", "Supporting Israel hurts"], "id": 330}
{"full_context": ["Diet is particular to the individual, each person needs to decide what works best for them.", "Veganism is not good for everyone"], "id": 331}
{"full_context": ["Libraries are needed more than ever to feed the soul and minds of people.", "We need libraries"], "id": 332}
{"full_context": ["Assumption is that cyclists will ignore traffic lights at intersections and endanger pefestrians.", "New York's bike lanes are not working"], "id": 333}
{"full_context": ["I have broadened the scope of my knowledge to include issues relating to North African, West African, and Carribbean peoples.", "Colleges need humanities programs"], "id": 334}
{"full_context": ["Some are not willing to take the risk of vaccine injuries.", "Vaccination should not be mandatory for all children"], "id": 335}
{"full_context": ["Campuses should focus more on teaching stretching and personal conditioning than sports.", "Drop sports program in undergraduate schools"], "id": 336}
{"full_context": ["Due to a lack of oversight billions of taxpayer dollars were awarded to corporations linked to republicans.", "Privatization is a bad deal for cities and states"], "id": 337}
{"full_context": ["I don't think people should be voting if they are voting for superficial reasons.", "Voting should not be mandatory"], "id": 338}
{"full_context": ["The CIA has historically been involved in war crimes and torture.", "We don't need the C.I.A."], "id": 339}
{"full_context": ["Critics bring accountability and measurement to the arts.", "We need professional critics"], "id": 340}
{"full_context": ["These people have self induced problems that over rule any of their intellect.", "Legislation should not protect obese"], "id": 341}
{"full_context": ["Allowing these drugs would create a larger gap between wealthier players and those who are less so.", "Doping should not be allowed"], "id": 342}
{"full_context": ["Sports in college are extraneous and have inappropriate impact on academic issues.", "Drop sports program in undergraduate schools"], "id": 343}
{"full_context": ["If you do not vacation with children, it could lead them to believe that they are not loved by their parents.", "Parents should make vacation with kids"], "id": 344}
{"full_context": ["Banks are making more money with services than though offering basic services to the community.", "Fees should be more regulated"], "id": 345}
{"full_context": ["Ending the prohibition on marijuana would ensure that fewer citizens are unfairly jailed.", "Colorado didn't go too far with pot"], "id": 346}
{"full_context": ["Vaccinations can cause polio even in the weakened form.", "Vaccination should not be mandatory for all children"], "id": 347}
{"full_context": ["These agreements put this country behind Czarist Russia in regards to our work force.", "Businesses should not be allowed to have new employees sign noncompete deals"], "id": 348}
{"full_context": ["Interns work as hard as regular employees.", "Unpaid internship exploit college students"], "id": 349}
{"full_context": ["My family took a trip around New York State and Connecticut, and it was epic.", "Parents should make vacation with kids"], "id": 350}
{"full_context": ["State control and distribution of pot is something I can support.", "Colorado didn't go too far with pot"], "id": 351}
{"full_context": ["The right to vote should be easier to exercise than other rights.", "Voting should be a constitutional right"], "id": 352}
{"full_context": ["Casinos will cause more debt from people losing their life savings there.", "Casinos are too much of a gamble"], "id": 353}
{"full_context": ["Doping affects the persons long term health for a short term gain.", "Doping should not be allowed"], "id": 354}
{"full_context": ["Home schooled children should get the same state financial backing given to public school attendees, yes that would be a threat to public education. So be it. They need the threat.", "Home schoolers deserve a tax break"], "id": 355}
{"full_context": ["To expand internet gambling would be creating more stupidity.", "Internet gambling should not be legalized"], "id": 356}
{"full_context": ["It would cause an increase in price on farmed goods, but it will be minimal.", "Farms could survive without illegal labor"], "id": 357}
{"full_context": ["Everyone needs plenty of rest, school should not interfere with that.", "School day should not be longer"], "id": 358}
{"full_context": ["Technology and the economy have caused people to be less able to think for themselves.", "People are getting dumber"], "id": 359}
{"full_context": ["A person should be part of a country he/she shares a culture.", "Dual citizenship should be allowed"], "id": 360}
{"full_context": ["Enthusiasm by young teachers can actually be worth more than teachers who have a negative attitude.", "Teachers do not need to have experience"], "id": 361}
{"full_context": ["They keep good records.", "Court stenographers are necessary"], "id": 362}
{"full_context": ["Sports programs are too expensive.", "Drop sports program in undergraduate schools"], "id": 363}
{"full_context": ["Salt is one of the best ways to enhance flavor.", "Salt should have a place at the table"], "id": 364}
{"full_context": ["The only acceptable exemption should be a legitimate medical reason, such as a vaccine allergy.", "Vaccination should be mandatory for all children"], "id": 365}
{"full_context": ["People tend to watch pointless entertainment.", "People are getting dumber"], "id": 366}
{"full_context": ["A proper library should be a focal point for it's community.", "We need libraries"], "id": 367}
{"full_context": ["Workers should have right to speech if they do it on their own time with their own resources, representing themselves.", "Speech cannot be limited for public workers"], "id": 368}
{"full_context": ["People who choose not to vaccinate their children endanger their children as well as others.", "Vaccination should be mandatory for all children"], "id": 369}
{"full_context": ["There are thousands of people injured by vaccines, and years of studies that make me question their safety.", "Vaccination should not be mandatory for all children"], "id": 370}
{"full_context": ["It is morally and ethically wrong to patent genes.", "Companies shouldn't be allowed to patent genes"], "id": 371}
{"full_context": ["NATO has helped us keep peace since the Cold War.", "We should keep NATO"], "id": 372}
{"full_context": ["Human bodies are designed as omnivores.", "Veganism is not good for everyone"], "id": 373}
{"full_context": ["Somebody still needs to transcribe audio recordings.", "Court stenographers are necessary"], "id": 374}
{"full_context": ["Assumption is that cyclists will ignore traffic lights at intersections and endanger pefestrians.", "New York's bike lanes are not working"], "id": 375}
{"full_context": ["The internet is full of things which can fool impressionable students, some learn easily, while other will be fooled.", "School librarians are not expendable"], "id": 376}
{"full_context": ["I should be able to season my food as I wish.", "Salt should have a place at the table"], "id": 377}
{"full_context": ["The CIA is difficult to control.", "We don't need the C.I.A."], "id": 378}
{"full_context": ["Bike lanes ensure the safety of both bikers and pedestrians.", "New York's bike lanes are working"], "id": 379}
{"full_context": ["Without capital gains tax, the market would collapse.", "Do not stop taxing capital gains"], "id": 380}
{"full_context": ["Wait staff should be taken care of by the restauranteur.", "Not to tip"], "id": 381}
{"full_context": ["The market allows companies to raise prices at their leisure, there is no motivation for them to keep costs reasonable across the board.", "Obamacare is not working"], "id": 382}
{"full_context": ["The Olympics are a big commercial rather than a friendly competition.", "Olympics are more trouble"], "id": 383}
{"full_context": ["Public schools already tailor classes to children's needs without parent interference.", "Parents should not control what kids learn at school"], "id": 384}
{"full_context": ["School sports have a place as long as academics come first.", "Do not drop sports program in undergraduate schools"], "id": 385}
{"full_context": ["If everyone waited until they could afford to have a child to procreate, mankind would die out.Hea", "Young people are being irresponsible by delaying the rituals of adult life"], "id": 386}
{"full_context": ["Their speech isn't childish, it is their personal belief of what is important in this country.", "Speech cannot be limited for public workers"], "id": 387}
{"full_context": ["There are many advantages of ending it, including saving money.", "We should disband NATO"], "id": 388}
{"full_context": ["The future is an opportunity for electric car success if battery costs go down.", "Electric cars will succeed"], "id": 389}
{"full_context": ["Not taxing capital gains did not work previously and it still won't.", "Do not stop taxing capital gains"], "id": 390}
{"full_context": ["High tech devices only cause frustration.", "3-D printing will not change the world"], "id": 391}
{"full_context": ["Home schooling is a scam meant to defund public schools, punish teachers' unions for supporting Democratic candidates and policies, and to keep women out of the paid  labor force.", "Home schoolers do not deserve a tax break"], "id": 392}
{"full_context": ["Interns are replacing employees.", "Unpaid internship exploit college students"], "id": 393}
{"full_context": ["Obamacare has allowed people with pre-existing conditions to change employment.", "Obamacare is working"], "id": 394}
{"full_context": ["Sports teams represent a sense of togetherness and bring people together every Saturday on a football field.", "Do not drop sports program in undergraduate schools"], "id": 395}
{"full_context": ["In other parts of the world, including Japan, Europe, and New Zealand, restaurant employees earn a living wage and aren't dependent on patrons' tips.", "Not to tip"], "id": 396}
{"full_context": ["Most young mothers end up single mothers.", "Women should delay motherhood"], "id": 397}
{"full_context": ["Americans might be healthier if we understood nutrition better.", "We need more advice about eating well"], "id": 398}
{"full_context": ["There is a large rise of debt feeding big banks.", "Big banks are out of control"], "id": 399}
{"full_context": ["Without incentive, they don't want to learn anything other than what they have to.", "People are getting dumber"], "id": 400}
{"full_context": ["There is a difference between doing the homework for them, versus helping them understand the principles.", "Parents should help their children with homework"], "id": 401}
{"full_context": ["Having a place to gather to connect to people, culture, information, and works of art is enriching and vital to the sustenance of vitality and diversity.", "We need libraries"], "id": 402}
{"full_context": ["A ratings solution, while messy, would be better than nothing.", "Government should grade colleges"], "id": 403}
{"full_context": ["Doctors advocate for vaccines even though they know they carry risks.", "Vaccination should not be mandatory for all children"], "id": 404}
{"full_context": ["Casino's take advantage of people and create nothing of substance.", "Casinos are too much of a gamble"], "id": 405}
{"full_context": ["The dual citizen can have the best of both countries.", "Dual citizenship should be allowed"], "id": 406}
{"full_context": ["School teachers perform the duties that libraries are expected too perform, and thus libraries are redundant.", "School librarians are expendable"], "id": 407}
{"full_context": ["Salt shakers permit diners to control the amount of salt in their food.", "Salt should have a place at the table"], "id": 408}
{"full_context": ["Libraries will keep print media alive.", "We need libraries"], "id": 409}
{"full_context": ["The public school system was established primarily as a benefit to society, not just the individual child.", "Home schoolers do not deserve a tax break"], "id": 410}
{"full_context": ["A professional critic becomes like an old friend.", "We need professional critics"], "id": 411}
{"full_context": ["Drone attacks are impersonal and indiscriminate of targets.", "Drone attacks make more harm"], "id": 412}
{"full_context": ["Tenure is needed to keep teachers, it is a positive reward.", "Tenure provides stability"], "id": 413}
{"full_context": ["Americans need to learn about other cultures.", "Colleges need humanities programs"], "id": 414}
{"full_context": ["Living off campus will help with off ceding debt.", "Students should live off campus"], "id": 415}
{"full_context": ["Some of these practices are nothing short of child abuse, plain and simple.", "Extreme parenting is counterproductive"], "id": 416}
{"full_context": ["The eater might want more salt and the chef is arrogant to ignore this fact.", "Salt should have a place at the table"], "id": 417}
{"full_context": ["Disasters can strike at anytime in the USA so a government program is needed.", "We need FEMA"], "id": 418}
{"full_context": ["There is no proper method to evaluate colleges.", "Government should not grade colleges"], "id": 419}
{"full_context": ["Harvard billionaires have demonstrated that duel citizenship shows a lack of commitment to the United States.", "Dual citizenship should not be allowed"], "id": 420}
{"full_context": ["Stenographers' work can be put into an app.", "Court stenographers are not necessary"], "id": 421}
{"full_context": ["Family vacations create lifelong memories.", "Parents should make vacation with kids"], "id": 422}
{"full_context": ["Libraries allow students to meet and collaborate.", "We need libraries"], "id": 423}
{"full_context": ["Americans will be deprived of the broader and deeper intellect they need to compete in the global economy if these programs are cut.", "Colleges need humanities programs"], "id": 424}
{"full_context": ["Good research papers will require students to access real books and information.", "Research papers are a useful exercise for college students"], "id": 425}
{"full_context": ["Vegan options like juices and replacement items are enriched with vitamins.", "Veganism is good for everyone"], "id": 426}
{"full_context": ["Most consumers will have various sizes of 3-D printers.", "3-D printing will change the world"], "id": 427}
{"full_context": ["Those with the most money will always come out on top.", "The new apps is a way to sell what was once free"], "id": 428}
{"full_context": ["Research papers ensure that scholars, engineers and scientists can distinguish between fact and fiction.", "Research papers are a useful exercise for college students"], "id": 429}
{"full_context": ["Only people with money can afford to be unpaid interns since some people need to work to support them self or pay their loans.", "Unpaid internship exploit college students"], "id": 430}
{"full_context": ["Obesity is a choice, not something forced on someone.", "Legislation should not protect obese"], "id": 431}
{"full_context": ["Libraries will keep print media alive.", "We need libraries"], "id": 432}
{"full_context": ["Jorday, Egypt, Syria and Lebanon attacked Israel in 1948.", "Hamas-Fatah unity can't lead to mideast peace"], "id": 433}
{"full_context": ["The areas around the casinos do not benefit.", "Casinos are too much of a gamble"], "id": 434}
{"full_context": ["New York Bike lanes are unsafe for the riders.", "New York's bike lanes are not working"], "id": 435}
{"full_context": ["Student learning can't be measured.", "Government should not grade colleges"], "id": 436}
{"full_context": ["Not everyone can be a scientist or a doctor and I am tired of advising these below average and unrealistic students.", "College not free for everyone"], "id": 437}
{"full_context": ["A vegan diet goes against human evolution.", "Veganism is not good for everyone"], "id": 438}
{"full_context": ["Dual citizens do not have true allegiance to either country and get away without paying taxes.", "Dual citizenship should not be allowed"], "id": 439}
{"full_context": ["Younger moms have much more energy.", "Women should not delay motherhood"], "id": 440}
{"full_context": ["Economic growth needs innovation.", "3-D printing will change the world"], "id": 441}
{"full_context": ["The areas around the casinos do not benefit.", "Casinos are too much of a gamble"], "id": 442}
{"full_context": ["Obamacare lowered costs and children were able to utilize it until employment was found.", "Obamacare is working"], "id": 443}
{"full_context": ["Harvard is very wealthy and that money could provide education to thousands. Instead, it just serves to suggest that Harvard provides a superior education.", "Wealthy colleges do not deserve tax breaks"], "id": 444}
{"full_context": ["Online classes can require a lot of repetitive exercises and leave the student at the mercy of the computer with regards to grading.", "Online classes are not the best way to teach"], "id": 445}
{"full_context": ["Soy is not good for babies according to The Weston A Price Foundation website.", "Veganism is not good for everyone"], "id": 446}
{"full_context": ["It seems that veganism is more like a cult than a viable way of life.", "Veganism is not good for everyone"], "id": 447}
{"full_context": ["Humanities courses ensure students are exposed to other cultures.", "Colleges need humanities programs"], "id": 448}
{"full_context": ["Internships permit students to work for free in order to prove that the student is worthy of future, paid work.", "Unpaid internship doesn't exploit college students"], "id": 449}
{"full_context": ["Electric cars are practical for most people.", "Electric cars will succeed"], "id": 450}
{"full_context": ["NATO was useful when the world was at war and alliances had to be formed to defeat a common enemy, but today there is no threat and no need for this.", "We should disband NATO"], "id": 451}
{"full_context": ["Internships should be treated like all other work.", "Unpaid internship exploit college students"], "id": 452}
{"full_context": ["I should be able to decide how much salt I use.", "Salt should have a place at the table"], "id": 453}
{"full_context": ["There will still be unhealthy products available in Wal-Mart.", "Wal-Mart can't make us healthier"], "id": 454}
{"full_context": ["Libraries are essential for references and can provide a joy never experienced on the internet.", "We need libraries"], "id": 455}
{"full_context": ["Governments grading colleges will force colleges to be concerned with student outcome.", "Government should grade colleges"], "id": 456}
{"full_context": ["Allowing doping will turn athletics into a chemical competition instead of a human one.", "Doping should not be allowed"], "id": 457}
{"full_context": ["Vaccines manufacturers are not forthcoming with information and people can make their own decisions", "Vaccination should not be mandatory for all children"], "id": 458}
{"full_context": ["If they didn't have to spend money on competitive sports it could be spent on research and education.", "Drop sports program in undergraduate schools"], "id": 459}
{"full_context": ["Voters should be educated.", "Voting should not be a constitutional right"], "id": 460}
{"full_context": ["Pageantry and many other activities are ways for girls to build confidence and community through experiences.", "Miss America is good for women"], "id": 461}
{"full_context": ["Some people will not agree with the chefs level of saltiness.", "Salt should have a place at the table"], "id": 462}
{"full_context": ["Tipping is important, especially in small towns where there are few career options.", "To tip"], "id": 463}
{"full_context": ["Studying literature develops critical analysis and writing skills.", "Colleges need humanities programs"], "id": 464}
{"full_context": ["American foreign policy needs to serve American interests, not AIPAC or the Jewish state's paranoid pursuit of apartheid empire in the Mideast.", "Supporting Israel hurts"], "id": 465}
{"full_context": ["Internships that provide real experience in a field serve a big value to society.", "Unpaid internship doesn't exploit college students"], "id": 466}
{"full_context": ["Money from discontinued sports funds other activities.", "Drop sports program in undergraduate schools"], "id": 467}
{"full_context": ["Teachers should answer to school boards and parents associations rather than themselves.", "Tenure protects bad teachers"], "id": 468}
{"full_context": ["Most shoppers, commuters and soccer moms will find the electric sedan practical. Can  be fashionably stylish too.", "Electric cars will succeed"], "id": 469}
{"full_context": ["Parents muse be able to choose what is best for their children and family.", "Vaccination should not be mandatory for all children"], "id": 470}
{"full_context": ["It is right for home-schoolers to play for high school sports teams if they meet the same academic and other requirements for enrolled kids.", "Home-schoolers should play for high school teams"], "id": 471}
{"full_context": ["Mandatory voting in not democratic.", "Voting should not be mandatory"], "id": 472}
{"full_context": ["Pageants are nothing more than a cattle call for sponsors.", "Miss America is bad for women"], "id": 473}
{"full_context": ["The number of city-bound cyclists to Manhattan has almost doubled in the last seven years.", "New York's bike lanes are working"], "id": 474}
{"full_context": ["It is illegal to attack a country except in self-defense.", "US should not attack Syria"], "id": 475}
{"full_context": ["Today's world provides young people with the ability to delay the rituals of adult life by providing an environment that gives them time to understand actions and consequences. Young people are smart for taking advantage of these current circumstances.", "Young people are being smart by delaying the rituals of adult life"], "id": 476}
{"full_context": ["If vaccinations are not mandatory then those making selfish choices will cause others to be harmed.", "Vaccination should be mandatory for all children"], "id": 477}
{"full_context": ["Pot has been the number one cash crop in California for over 20 years - it benefits everyone via regulation, taxation, education, savings in enforcement and incarceration costs.", "Colorado didn't go too far with pot"], "id": 478}
{"full_context": ["Dual citizens do not have true allegiance to either country and get away without paying taxes.", "Dual citizenship should not be allowed"], "id": 479}
{"full_context": ["There aren't enough American citizens willing to work on farms.", "Farms couldn't survive without illegal labor"], "id": 480}
{"full_context": ["Disasters can strike at anytime in the USA so a government program is needed.", "We need FEMA"], "id": 481}
{"full_context": ["Diet is particular to the individual, each person needs to decide what works best for them.", "Veganism is not good for everyone"], "id": 482}
{"full_context": ["If you do not vacation with children, it could lead them to believe that they are not loved by their parents.", "Parents should make vacation with kids"], "id": 483}
{"full_context": ["Corporations and the rich should have to earn their lower tax rate.", "Do not stop taxing capital gains"], "id": 484}
{"full_context": ["If you don't judge by personal taste, New York has amazing architecture.", "'Starchitects' are not ruining cities"], "id": 485}
{"full_context": ["If they play for high school team maybe they can overcome the prejudice of being home schooled.", "Home-schoolers should play for high school teams"], "id": 486}
{"full_context": ["Libraries provide access to books to minority children.", "We need libraries"], "id": 487}
{"full_context": ["Farmer's should pay viable wages to American workers despite the higher prices that would result, America's history shows they will do the work.", "Farms could survive without illegal labor"], "id": 488}
{"full_context": ["College students deserve a wage, even if they are unskilled.", "Unpaid internship exploit college students"], "id": 489}
{"full_context": ["Language programs assist in communication between international companies.", "Colleges need humanities programs"], "id": 490}
{"full_context": ["Kate and William appear to have a normal, modern relationship that does not seem to be threatened by outsiders.", "Royal Couple could be a modern family"], "id": 491}
{"full_context": ["Farms depend on having a supply of unskilled workers who will work seasonal jobs with long hours and bad conditions without advancement opportunities.", "Farms couldn't survive without illegal labor"], "id": 492}
{"full_context": ["All evidence supports that humans are omnivores.", "Veganism is not good for everyone"], "id": 493}
{"full_context": ["Intramural and interscholastic have a place but not college sports which just train athletes for professional teams.", "Drop sports program in undergraduate schools"], "id": 494}
{"full_context": ["Some of these practices are nothing short of child abuse, plain and simple.", "Extreme parenting is counterproductive"], "id": 495}
{"full_context": ["Language programs assist in communication between international companies.", "Colleges need humanities programs"], "id": 496}
{"full_context": ["Colorado legalizing marijuana had little impact on society.", "Colorado didn't go too far with pot"], "id": 497}
{"full_context": ["The government is regulated by banks and corporations instead of governments actually regulating banks.", "Big banks are out of control"], "id": 498}
{"full_context": ["Vegan diets are rich in vitamins.", "Veganism is good for everyone"], "id": 499}
{"full_context": ["Not everyone can be a scientist or a doctor and I am tired of advising these below average and unrealistic students.", "College not free for everyone"], "id": 500}
{"full_context": ["Without the CIA, there would be more terrorism on US soil.", "We need the C.I.A."], "id": 501}
{"full_context": ["The number of city-bound cyclists to Manhattan has almost doubled in the last seven years.", "New York's bike lanes are working"], "id": 502}
{"full_context": ["Libraries are essential for references and can provide a joy never experienced on the internet.", "We need libraries"], "id": 503}
{"full_context": ["Overnight charging will be easy.", "Electric cars will succeed"], "id": 504}
{"full_context": ["Preschool can provide substantial early childhood education.", "Public preschool is a smart investment"], "id": 505}
{"full_context": ["The CIA has historically been involved in war crimes and torture.", "We don't need the C.I.A."], "id": 506}
{"full_context": ["Public schools earn their funding by the number of students who are actually enrolled, therefore, anyone who doesn't enroll should not get to use services paid for with that money.", "Home-schoolers should not play for high school teams"], "id": 507}
{"full_context": ["A healthy food initiative is a great way for Wal-Mart to show its loyalty to customers.", "Wal-Mart can make us healthier"], "id": 508}
{"full_context": ["Too much money is spent on a few gifted athletes while almost nothing is spent on gifted students.", "Drop sports program in undergraduate schools"], "id": 509}
{"full_context": ["A person should be part of a country he/she shares a culture.", "Dual citizenship should be allowed"], "id": 510}
{"full_context": ["The spouses are a reflection of the strength of the candidate, by how they chose to marry the candidate.", "We need to hear from candidate's spouse"], "id": 511}
{"full_context": ["Young adults need to pay their own bills.", "Young people are being irresponsible by delaying the rituals of adult life"], "id": 512}
{"full_context": ["By legalizing prostitution, it can provide safeguards and protections.", "Prostitution is safer when it's legal"], "id": 513}
{"full_context": ["Due to a lack of oversight billions of taxpayer dollars were awarded to corporations linked to republicans.", "Privatization is a bad deal for cities and states"], "id": 514}
{"full_context": ["Some kids are not taught by parents how to cook, and many schools have done away with home economics in favor of science and math.", "We need more advice about eating well"], "id": 515}
{"full_context": ["Public Libraries are good for those less fortunate, providing a nearly free source of different media's.", "We need libraries"], "id": 516}
{"full_context": ["Vaccinations can cause polio even in the weakened form.", "Vaccination should not be mandatory for all children"], "id": 517}
{"full_context": ["Regime change in Libya led to the murder of a US Ambassador, and attacking Syria could have similar results.", "US should not attack Syria"], "id": 518}
{"full_context": ["Disasters are locally handled by officials and neighbors.", "We don't need FEMA"], "id": 519}
{"full_context": ["Human bodies are designed as omnivores.", "Veganism is not good for everyone"], "id": 520}
{"full_context": ["Raising the rim would further increase the advantage of taller players, not decrease it.", "Rim should not be raised"], "id": 521}
{"full_context": ["Getting rid of tips would create another problem for the American worker.", "To tip"], "id": 522}
{"full_context": ["It would be an awkward shot for those who are average height and not in the NBA.", "Rim should not be raised"], "id": 523}
{"full_context": ["NATO should be disbanded and replaced with a more modern organization.", "We should disband NATO"], "id": 524}
{"full_context": ["Homeowner's without children pay school taxes too.", "Home schoolers do not deserve a tax break"], "id": 525}
{"full_context": ["The root of gambling's appeal is greed.", "Casinos are too much of a gamble"], "id": 526}
{"full_context": ["People from different parts of the world are starting to reflect the same clothing trends as in NYC.", "Globalization has ruined street style"], "id": 527}
{"full_context": ["You aren't interacting with people on phones, you are interacting with technology.", "Social media ruin romance"], "id": 528}
{"full_context": ["Companies have a right to align themselves with healthier individuals if they so choose, which doesn't penalize obese people but instead might motivate them.", "Legislation should not protect obese"], "id": 529}
{"full_context": ["Tenure allows for protecting the good and firing the bad teachers.", "Tenure provides stability"], "id": 530}
{"full_context": ["Somebody still needs to transcribe audio recordings.", "Court stenographers are necessary"], "id": 531}
{"full_context": ["Private moments are now publicized where anybody can comment.", "Social media ruin romance"], "id": 532}
{"full_context": ["Not using the public system does not exempt home schoolers from supporting it.", "Home schoolers do not deserve a tax break"], "id": 533}
{"full_context": ["A healthy food initiative is a great way for Wal-Mart to show its loyalty to customers.", "Wal-Mart can make us healthier"], "id": 534}
{"full_context": ["The lottery and gambling and harmful to individuals and families that waste their money on them.", "Internet gambling should not be legalized"], "id": 535}
{"full_context": ["Regime change in Libya led to the murder of a US Ambassador, and attacking Syria could have similar results.", "US should not attack Syria"], "id": 536}
{"full_context": ["Miss America gives honors and education scholarships.", "Miss America is good for women"], "id": 537}
{"full_context": ["I believe salt preference is personal taste and you should be able to decide for yourself.", "Salt should have a place at the table"], "id": 538}
{"full_context": ["It is important seasoning and can be used in moderation.", "Salt should have a place at the table"], "id": 539}
{"full_context": ["They operate in such a large economy that it makes it almost impossible for smaller banks to succeed.", "Big banks are out of control"], "id": 540}
{"full_context": ["Playing with high school teams allows home-schoolers to have more social interaction.", "Home-schoolers should play for high school teams"], "id": 541}
{"full_context": ["The areas around the casinos do not benefit.", "Casinos are too much of a gamble"], "id": 542}
{"full_context": ["Places in which you pick your order up or clean up after yourself have tip jars, and we do not owe them those tips.", "Not to tip"], "id": 543}
{"full_context": ["Many libraries provide numerous valuable services to their communities.", "We need libraries"], "id": 544}
{"full_context": ["Arab leaders have no interest in sitting beside a Jewish State that is responsible for decades of Arab refugees.", "Hamas-Fatah unity can't lead to mideast peace"], "id": 545}
{"full_context": ["Evident shows that polygamy comes with child abuse and exploitation.", "Courts should not recognize a right to plural marriage among consenting adults"], "id": 546}
{"full_context": ["Making it a state would force Israel to negotiate with them as an equal.", "Nations should recognize a Palestinian state"], "id": 547}
{"full_context": ["Libraries provide a meeting places for many positive activities.", "We need libraries"], "id": 548}
{"full_context": ["America has historically misled Muslims while allowing Israel to have weapons of mass destruction.", "Supporting Israel hurts"], "id": 549}
{"full_context": ["Delaying motherhood may cause in the inability to have children when you want them.", "Women should not delay motherhood"], "id": 550}
{"full_context": ["There is a large rise of debt feeding big banks.", "Big banks are out of control"], "id": 551}
{"full_context": ["The CIA causes more problems for US security than it solves.", "We don't need the C.I.A."], "id": 552}
{"full_context": ["The US attacking Syria would only create more problems no matter which faction wins, probably Al-Qa'eda.", "US should not attack Syria"], "id": 553}
{"full_context": ["Humanities programs improve understanding of current issues.", "Colleges need humanities programs"], "id": 554}
{"full_context": ["3D printing technology will evolve and grow, just like cell phones have.", "3-D printing will change the world"], "id": 555}
{"full_context": ["There are many more discreet ways to bribe politicians,", "Rich politicans are not less corruptible"], "id": 556}
{"full_context": ["The difficulty in firing a tenured teacher is not a justifiable reason that tenure is wrong.", "Tenure provides stability"], "id": 557}
{"full_context": ["Paying for restaurant reservations will force customers to compete against each other for a limited resource at an increased price.", "The new apps is a way to sell what was once free"], "id": 558}
{"full_context": ["Libraries provide satisfaction to people.", "We need libraries"], "id": 559}
{"full_context": ["The spouse of the candidate is not being elected and will have no official role in the administration.", "We don't need to hear from candidate's spouse"], "id": 560}
{"full_context": ["ID cards will be helpful in deportations.", "All immigrants should get ID cards"], "id": 561}
{"full_context": ["Government's cannot accurately measure learning.", "Government should not grade colleges"], "id": 562}
{"full_context": ["Internships should be treated like all other work.", "Unpaid internship exploit college students"], "id": 563}
{"full_context": ["Hybrids are common on the road today.", "Electric cars will succeed"], "id": 564}
{"full_context": ["Wal-Mart is only looking out for themselves and their bottom line, they are not looking to help others.", "Wal-Mart can't make us healthier"], "id": 565}
{"full_context": ["There are machines that can do the illegal labor.", "Farms could survive without illegal labor"], "id": 566}
{"full_context": ["Organic food is worth the expense since cows that produce regular milk are given steroids that can inhibit the natural nutrients that are available in organic milk.", "Organic food is worth the expense"], "id": 567}
{"full_context": ["A vegan diet is simple and can benefit anyone.", "Veganism is good for everyone"], "id": 568}
{"full_context": ["There is a community made in the dorms.", "Students should live on campus"], "id": 569}
{"full_context": ["Tipping servers provides an added incentive to create a pleasant environment for the customers.", "To tip"], "id": 570}
{"full_context": ["Casinos are a move backwards, not forwards.", "Casinos are too much of a gamble"], "id": 571}
{"full_context": ["Nuclear reactors let out dangerous gases.", "Nuclear power is not the answer to climate change"], "id": 572}
{"full_context": ["No one should be allowed to vote unless they can pass a test.", "Voting should not be a constitutional right"], "id": 573}
{"full_context": ["It costs the bank money to operate.", "Fees are necessary"], "id": 574}
{"full_context": ["School sports have a place as long as academics come first.", "Do not drop sports program in undergraduate schools"], "id": 575}
{"full_context": ["People are not using their intelligence to the best of his or her ability anymore.", "People are getting dumber"], "id": 576}
{"full_context": ["Humanities programs make people think differently and more creatively.", "Colleges need humanities programs"], "id": 577}
{"full_context": ["Gambling is more dangerous to families than marijuana.", "Casinos are too much of a gamble"], "id": 578}
{"full_context": ["Vegan diets are rich in vitamins.", "Veganism is good for everyone"], "id": 579}
{"full_context": ["Some kids are not taught by parents how to cook, and many schools have done away with home economics in favor of science and math.", "We need more advice about eating well"], "id": 580}
{"full_context": ["ISIS needs to be stopped before it becomes an Al Qaeda so the US should work with Assad if it can stop that.", "The U.S. should work with Assad to fight ISIS"], "id": 581}
{"full_context": ["Unpaid internships take advantage of students by requiring them to work long an hard for work experience and no paycheck.", "Unpaid internship exploit college students"], "id": 582}
{"full_context": ["Children can't thrive as vegans and require a diet containing animal products.", "Veganism is not good for everyone"], "id": 583}
{"full_context": ["Extreme parenting doesn't necessarily raise a compassionate child.", "Extreme parenting is counterproductive"], "id": 584}
{"full_context": ["Students need to think critically and outside of conventional ideas.", "Colleges need humanities programs"], "id": 585}
{"full_context": ["The costs to replace school librarians with technology is prohibitive.", "School librarians are not expendable"], "id": 586}
{"full_context": ["Anyone is more than welcome to add wanted salt to their food.", "Salt should have a place at the table"], "id": 587}
{"full_context": ["It works for Australia.", "Voting should be mandatory"], "id": 588}
{"full_context": ["I want to Increase the price of menu items to pay waitstaff higher wages.", "Not to tip"], "id": 589}
{"full_context": ["Public schools earn their funding by the number of students who are actually enrolled, therefore, anyone who doesn't enroll should not get to use services paid for with that money.", "Home-schoolers should not play for high school teams"], "id": 590}
{"full_context": ["Reality shows cause me to die a little whenever I see them advertised even though I have watched them at times.", "Reality shows are worse than other TV"], "id": 591}
{"full_context": ["Sports programs teach important things like leadership, discipline, and teamwork.", "Do not drop sports program in undergraduate schools"], "id": 592}
{"full_context": ["Banks are making big profits and forgetting to serve the public first.", "Fees should be more regulated"], "id": 593}
{"full_context": ["The bike lanes are low cost and fast.", "New York's bike lanes are working"], "id": 594}
{"full_context": ["Many people ride bikes to work.", "New York's bike lanes are working"], "id": 595}
{"full_context": ["It is unfair that employers must pay a penalty for hiring obese people.", "Legislation should not protect obese"], "id": 596}
{"full_context": ["Libraries are a wise addition.", "We need libraries"], "id": 597}
{"full_context": ["I should be able to decide how much salt I use.", "Salt should have a place at the table"], "id": 598}
{"full_context": ["Each person is unique and has their own specific tastes, it should be their personal decision.", "Salt should have a place at the table"], "id": 599}
{"full_context": ["Children can't thrive as vegans and require a diet containing animal products.", "Veganism is not good for everyone"], "id": 600}
{"full_context": ["People are not using their intelligence to the best of his or her ability anymore.", "People are getting dumber"], "id": 601}
{"full_context": ["Colleges need to ensure that opportunity to acquire language remains part of higher education.", "Colleges need humanities programs"], "id": 602}
{"full_context": ["Often there are technical problems in online education platforms.", "Online classes are not the best way to teach"], "id": 603}
{"full_context": ["People today lack common sense that cannot be taught.", "People are getting dumber"], "id": 604}
{"full_context": ["Public librarians can be important to people's lives.", "School librarians are not expendable"], "id": 605}
{"full_context": ["Private moments are now publicized where anybody can comment.", "Social media ruin romance"], "id": 606}
{"full_context": ["Humanities programs are a waste of taxpayer money with no result.", "Colleges do not need humanities programs"], "id": 607}
{"full_context": ["Allocating resources to education is more useful than funding casinos", "Casinos are too much of a gamble"], "id": 608}
{"full_context": ["High school players are often short, and would not want the rim raised.", "Rim should not be raised"], "id": 609}
{"full_context": ["Only people with money can afford to be unpaid interns since some people need to work to support them self or pay their loans.", "Unpaid internship exploit college students"], "id": 610}
{"full_context": ["If they don't abandon the Euro they will be creating violence and loss of life.", "Germany should abandon the Euro"], "id": 611}
{"full_context": ["Parents can choose what their kids learn at home.", "Parents should not control what kids learn at school"], "id": 612}
{"full_context": ["The type of information reviewed is not useful enough.", "Government should not grade colleges"], "id": 613}
{"full_context": ["A small city with architectural treasures can become an international destination for architecture aficionados.", "'Starchitects' are not ruining cities"], "id": 614}
{"full_context": ["Students need to think critically and outside of conventional ideas.", "Colleges need humanities programs"], "id": 615}
{"full_context": ["Sports programs teach competition and the will to succeed.", "Do not drop sports program in undergraduate schools"], "id": 616}
{"full_context": ["There is a community made in the dorms.", "Students should live on campus"], "id": 617}
{"full_context": ["Accounts should not be listed as free, when they include hidden fees.", "Fees should be more regulated"], "id": 618}
{"full_context": ["Libraries provides books and internet access to those who cannot afford it.", "We need libraries"], "id": 619}
{"full_context": ["Wait staff should be taken care of by the restauranteur.", "Not to tip"], "id": 620}
{"full_context": ["Vaccination should remain a personal choice.", "Vaccination should not be mandatory for all children"], "id": 621}
{"full_context": ["TFA has made teaching positions something that the best and brightest are in competition for.", "TFA has raised the status of public teachers"], "id": 622}
{"full_context": ["People would be willing to pay more money for produce picked by US citizens.", "Farms could survive without illegal labor"], "id": 623}
{"full_context": ["The people who want privatization do not have the cities and states best interests in mind.", "Privatization is a bad deal for cities and states"], "id": 624}
{"full_context": ["The internet is full of things which can fool impressionable students, some learn easily, while other will be fooled.", "School librarians are not expendable"], "id": 625}
{"full_context": ["When school is not in session, one can still gain knowledge and a peaceful environment in a library.", "We need libraries"], "id": 626}
{"full_context": ["Home schoolers are not part of the community.", "Home-schoolers should not play for high school teams"], "id": 627}
{"full_context": ["Most marijuana users aren't influenced by the ruling.", "Colorado didn't go too far with pot"], "id": 628}
{"full_context": ["High tech devices only cause frustration.", "3-D printing will not change the world"], "id": 629}
{"full_context": ["Americans should mind their own business.", "US should not attack Syria"], "id": 630}
{"full_context": ["Dual citizens do not have true allegiance to either country and get away without paying taxes.", "Dual citizenship should not be allowed"], "id": 631}
{"full_context": ["Students must thoroughly process information to apply it towards their paper.", "Research papers are a useful exercise for college students"], "id": 632}
{"full_context": ["The slam dunk has lessened the attraction of watching an NBA game.", "Rim should be raised"], "id": 633}
{"full_context": ["No one benefits from sports leagues.", "Sport leagues should not enjoy nonprofit status"], "id": 634}
{"full_context": ["Some people like a social place to read.", "We need libraries"], "id": 635}
{"full_context": ["America has more opportunity, but people are still loyal to their homes.", "Dual citizenship should be allowed"], "id": 636}
{"full_context": ["Privatization is not a cure for incompetent managers.", "Privatization is a bad deal for cities and states"], "id": 637}
{"full_context": ["3D printing allows for many innovations.", "3-D printing will change the world"], "id": 638}
{"full_context": ["As a nation, it is well known that Israel has a stockpile of nuclear weapons that they should be forced to give up.", "Supporting Israel hurts"], "id": 639}
{"full_context": ["Senoi Indians believe that our dream state is the other side of our wakeful state, and is of equal importance.", "We should not manipulate our dreams"], "id": 640}
{"full_context": ["A librarian can lead the school in information resource management and use.", "School librarians are not expendable"], "id": 641}
{"full_context": ["Casinos bring uncalculated social costs.", "Casinos are too much of a gamble"], "id": 642}
{"full_context": ["Drone attacks are impersonal and indiscriminate of targets.", "Drone attacks make more harm"], "id": 643}
{"full_context": ["My daughter was simply lazy and not doing work, by cracking down I was able to get her to improve her grades.", "Extreme parenting leads to greater success"], "id": 644}
{"full_context": ["Herd immunity protects against those that cannot be vaccinated.", "Vaccination should be mandatory for all children"], "id": 645}
{"full_context": ["A well written paper takes critical thinking skills.", "Research papers are a useful exercise for college students"], "id": 646}
{"full_context": ["Sports teach discipline and purpose.", "Do not drop sports program in undergraduate schools"], "id": 647}
{"full_context": ["Highly competitive sports helps you learn to compete in the business world. Far more than those who have never been part of competitive sports can understand.", "Do not drop sports program in undergraduate schools"], "id": 648}
{"full_context": ["The parents that want to control learning are narrow minded and ignorant and wish their children to be the same.", "Parents should not control what kids learn at school"], "id": 649}
{"full_context": ["We are less informed and aren't motivated to be informed.", "People are getting dumber"], "id": 650}
{"full_context": ["Without tenure, there are too many little things that teachers could lose their jobs over.", "Tenure provides stability"], "id": 651}
{"full_context": ["A person learns a lot through peer interactions and discussions.", "Online classes are not the best way to teach"], "id": 652}
{"full_context": ["Libraries give a chance for poorer families to get information and reading material.", "We need libraries"], "id": 653}
{"full_context": ["People experience food differently and an chef should not have the right to determine how much salt to put on something.", "Salt should have a place at the table"], "id": 654}
{"full_context": ["Libraries can be safe havens for children.", "We need libraries"], "id": 655}
{"full_context": ["Each person is unique and has their own specific tastes, it should be their personal decision.", "Salt should have a place at the table"], "id": 656}
{"full_context": ["A proper library should be a focal point for it's community.", "We need libraries"], "id": 657}
{"full_context": ["Our military interventions in the Middle East always have bad outcomes for us.", "US should not attack Syria"], "id": 658}
{"full_context": ["Nuclear energy can be safer and cleaner if carried out properly.", "Nuclear power is the answer to climate change"], "id": 659}
{"full_context": ["Many foods, like poultry or popcorn, require salt for optimal taste.", "Salt should have a place at the table"], "id": 660}
{"full_context": ["A lot of time is lost with computer technical troubles.", "Online classes are not the best way to teach"], "id": 661}
{"full_context": ["The costs to replace school librarians with technology is prohibitive.", "School librarians are not expendable"], "id": 662}
{"full_context": ["Adults should be able to make their own choices.", "Colorado didn't go too far with pot"], "id": 663}
{"full_context": ["Workers in legal brothels are safe and there by choice where violence and abuse are minimized.", "Prostitution is safer when it's legal"], "id": 664}
{"full_context": ["Economic growth needs innovation.", "3-D printing will change the world"], "id": 665}
{"full_context": ["A ratings solution, while messy, would be better than nothing.", "Government should grade colleges"], "id": 666}
{"full_context": ["School sports have a place as long as academics come first.", "Do not drop sports program in undergraduate schools"], "id": 667}
{"full_context": ["Nuclear energy can be safer and cleaner if carried out properly.", "Nuclear power is the answer to climate change"], "id": 668}
{"full_context": ["Rates should not be increased on a sliding scale based on weight, as even a small weight gain could cost you.", "Legislation should protect obese"], "id": 669}
{"full_context": ["Professional critics shed light to things that would otherwise be missed, make people question things, and think harder about things.", "We need professional critics"], "id": 670}
{"full_context": ["Educators should be held accountable in exchange for the federal dollars they receive.", "Government should grade colleges"], "id": 671}
{"full_context": ["Sanctions against Cuba are examples of imperialist policies by country with a bad human rights record.", "The U.S. should lift sanctions with Cuba"], "id": 672}
{"full_context": ["It can alert them to early signs of learning problems or personal issues they may  have.", "Parents should help their children with homework"], "id": 673}
{"full_context": ["High speed rail would be helpful to the environment and citizens as long as it is built above ground.", "California needs high-speed rail"], "id": 674}
{"full_context": ["Professionals critics are specifically trained their fields.", "We need professional critics"], "id": 675}
{"full_context": ["An attack on Syria would worsen things.", "US should not attack Syria"], "id": 676}
{"full_context": ["People tend to watch pointless entertainment.", "People are getting dumber"], "id": 677}
{"full_context": ["Government usage of drone's will inevitably lead to using drone's on citizens.", "Drone attacks make more harm"], "id": 678}
{"full_context": ["There are machines that can do the illegal labor.", "Farms could survive without illegal labor"], "id": 679}
{"full_context": ["Politicians are criticized for pandering to unintelligent voters, so it makes no sense to demand that a larger number of such people be forced to vote.", "Voting should not be mandatory"], "id": 680}
{"full_context": ["Farm subsidies hurt the traditionally run farms.", "Farm subsidies do not protect national security"], "id": 681}
{"full_context": ["Stopping taxing capital gains won't cause growth.", "Do not stop taxing capital gains"], "id": 682}
{"full_context": ["Government grading colleges is an overreach of powers.", "Government should not grade colleges"], "id": 683}
{"full_context": ["These preschools will benefit the lower middle class too who do not get free childcare programs, so their children won't be left out and fall behind.", "Public preschool is a smart investment"], "id": 684}
{"full_context": ["Jorday, Egypt, Syria and Lebanon attacked Israel in 1948.", "Hamas-Fatah unity can't lead to mideast peace"], "id": 685}
{"full_context": ["All income should be taxed the same, regardless of how it was obtained.", "Do not stop taxing capital gains"], "id": 686}
{"full_context": ["There will always be a recording if the process is done correctly.", "Police officers should be required to wear cameras"], "id": 687}
{"full_context": ["Student learning can't be measured.", "Government should not grade colleges"], "id": 688}
{"full_context": ["It would be an awkward shot for those who are average height and not in the NBA.", "Rim should not be raised"], "id": 689}
{"full_context": ["Libraries have lots to offer in addition to books they provide music, dvd's, magazines and more.", "We need libraries"], "id": 690}
{"full_context": ["Librarians are usually the only professionals able to teach students to recognize credible sources of information.", "School librarians are not expendable"], "id": 691}
{"full_context": ["Because of tenure, only a very small number of teachers are fired for cause.", "Tenure protects bad teachers"], "id": 692}
{"full_context": ["Not taxing capital gains did not work previously and it still won't.", "Do not stop taxing capital gains"], "id": 693}
{"full_context": ["It is unfair for families affected by vaccine injuries to say that their suffering is for the greater good.", "Vaccination should not be mandatory for all children"], "id": 694}
{"full_context": ["Unvaccinated children places others at risk.", "Vaccination should be mandatory for all children"], "id": 695}
{"full_context": ["Making it a state would force Israel to negotiate with them as an equal.", "Nations should recognize a Palestinian state"], "id": 696}
{"full_context": ["The internet provides this kind of information for free.", "Colleges do not need humanities programs"], "id": 697}
{"full_context": ["Government grading colleges would serve taxpayers, who expect high results from colleges.", "Government should grade colleges"], "id": 698}
{"full_context": ["It usually leads to rebellion.", "Extreme parenting is counterproductive"], "id": 699}
{"full_context": ["A person should be part of a country he/she shares a culture.", "Dual citizenship should be allowed"], "id": 700}
{"full_context": ["Organic food is worth the expense since cows that produce regular milk are given steroids that can inhibit the natural nutrients that are available in organic milk.", "Organic food is worth the expense"], "id": 701}
{"full_context": ["It will be sad when libraries become only access points for the Internet.", "We need libraries"], "id": 702}
{"full_context": ["Criticism needs to be strongly raised when a reality show is sexist, racist, or misogynistic.", "Reality shows are worse than other TV"], "id": 703}
{"full_context": ["Playing with high school teams allows home-schoolers to have more social interaction.", "Home-schoolers should play for high school teams"], "id": 704}
{"full_context": ["The cost efficiency of electric cars will make gasoline powered vehicles go away", "Electric cars will succeed"], "id": 705}
{"full_context": ["People tend to watch pointless entertainment.", "People are getting dumber"], "id": 706}
{"full_context": ["Drone attacks are impersonal and indiscriminate of targets.", "Drone attacks make more harm"], "id": 707}
{"full_context": ["My wise grandfather believed correctly that subsidies undermine farming.", "Farm subsidies do not protect national security"], "id": 708}
{"full_context": ["If they don't abandon the Euro they will be creating violence and loss of life.", "Germany should abandon the Euro"], "id": 709}
{"full_context": ["People still like reading printed pages.", "We need libraries"], "id": 710}
{"full_context": ["Sanctions against Cuba are examples of imperialist policies by country with a bad human rights record.", "The U.S. should lift sanctions with Cuba"], "id": 711}
{"full_context": ["The only interest of the private sector is the bottom line profits.", "Privatization is a bad deal for cities and states"], "id": 712}
{"full_context": ["Ending tipping would benefit working people.", "Not to tip"], "id": 713}
{"full_context": ["People who don't understand the odds are exploited with false hope of riches while communities are stripped of economic resources.", "Casinos are too much of a gamble"], "id": 714}
{"full_context": ["Drones kill innocent people.", "Drone attacks make more harm"], "id": 715}
{"full_context": ["There is a difference between doing the homework for them, versus helping them understand the principles.", "Parents should help their children with homework"], "id": 716}
{"full_context": ["Biking is good for one's health and the environment. It is more expensive to maintain roads than bike lanes.", "New York's bike lanes are working"], "id": 717}
{"full_context": ["There should be more prerequisites to voting than being alive.", "Voting should not be a constitutional right"], "id": 718}
{"full_context": ["I get annoyed hearing people say that their weight is natural.", "Legislation should not protect obese"], "id": 719}
{"full_context": ["Things that limit bad behavior in sports should be supported.", "Tennis strung is not too tight"], "id": 720}
{"full_context": ["Preschool can provide substantial early childhood education.", "Public preschool is a smart investment"], "id": 721}
{"full_context": ["Tipping is corrupt, you can't tip teachers, journalists, healthcare professionals.", "Not to tip"], "id": 722}
{"full_context": ["Libraries provides books and internet access to those who cannot afford it.", "We need libraries"], "id": 723}
{"full_context": ["Israel doesn't appreciate what we give them.", "Supporting Israel hurts"], "id": 724}
{"full_context": ["In order to avoid becoming fully involved in their war, we should stay completely out of everything going on in Syria.", "US should not attack Syria"], "id": 725}
{"full_context": ["Raising the rim would further increase the advantage of taller players, not decrease it.", "Rim should not be raised"], "id": 726}
{"full_context": ["Obamacare has removed insurance companies' ability to refuse coverage to consumers.", "Obamacare is working"], "id": 727}
{"full_context": ["Teaching students in the use of digital tools would be helpful.", "Research papers are a useful exercise for college students"], "id": 728}
{"full_context": ["Vegetable intake will lead to a healthier person.", "Veganism is good for everyone"], "id": 729}
{"full_context": ["The body does not function well without protein or carbs.", "Veganism is not good for everyone"], "id": 730}
{"full_context": ["Government grading colleges will cause additional administrative costs which would be better spent on faculty.", "Government should not grade colleges"], "id": 731}
{"full_context": ["I should be able to season my food as I wish.", "Salt should have a place at the table"], "id": 732}
{"full_context": ["Criticism needs to be strongly raised when a reality show is sexist, racist, or misogynistic.", "Reality shows are worse than other TV"], "id": 733}
{"full_context": ["The US should work with all of the countries that are fighting ISIS.", "The U.S. should work with Assad to fight ISIS"], "id": 734}
{"full_context": ["Family vacations teach children to handle uncertainties and unexpected happenings in an unfamiliar environment.", "Parents should make vacation with kids"], "id": 735}
{"full_context": ["The spouse of the candidate is not being elected and will have no official role in the administration.", "We don't need to hear from candidate's spouse"], "id": 736}
{"full_context": ["There was a low number of arrests for marijuana.", "Colorado didn't go too far with pot"], "id": 737}
{"full_context": ["French is a language that is used all throughout Europe.", "Colleges need humanities programs"], "id": 738}
{"full_context": ["Supporting Israel is as irresponsible as China supporting North Korea.", "Supporting Israel hurts"], "id": 739}
{"full_context": ["Companies have a right to align themselves with healthier individuals if they so choose, which doesn't penalize obese people but instead might motivate them.", "Legislation should not protect obese"], "id": 740}
{"full_context": ["In highly respected publications there are numerous errors.", "People are getting dumber"], "id": 741}
{"full_context": ["Before the embargo Cuba was one of our best trading partners and now we are losing lots of trade.", "The U.S. should lift sanctions with Cuba"], "id": 742}
{"full_context": ["People from different parts of the world are starting to reflect the same clothing trends as in NYC.", "Globalization has ruined street style"], "id": 743}
{"full_context": ["The long reach of an employer's arm is legally unsupportable.", "Speech cannot be limited for public workers"], "id": 744}
{"full_context": ["It is likely that Jewish people would be slaughtered, proof of that is what is happening between Egyptians and Muslims.", "Hamas-Fatah unity can't lead to mideast peace"], "id": 745}
{"full_context": ["People from different parts of the world are starting to reflect the same clothing trends as in NYC.", "Globalization has ruined street style"], "id": 746}
{"full_context": ["Our history proves we cannot responsibly handle nuclear weapons.", "Nuclear power is not the answer to climate change"], "id": 747}
{"full_context": ["Everyone has different dietary requirements and compelling others to try to live by vegan standards may not work well for them.", "Veganism is not good for everyone"], "id": 748}
{"full_context": ["With the way that retirement is heading in the US it is comforting to know that I have the option to retire in a country that will provide for me.", "Dual citizenship should be allowed"], "id": 749}
{"full_context": ["Diners may not be able to select the server, but they can compensate them according to their service.", "To tip"], "id": 750}
{"full_context": ["Gambling exploits greed and human weakness.", "Casinos are too much of a gamble"], "id": 751}
{"full_context": ["College sports make tuition higher.", "Drop sports program in undergraduate schools"], "id": 752}
{"full_context": ["Not all science and technology workers speak English.", "Colleges need humanities programs"], "id": 753}
{"full_context": ["Somebody still needs to transcribe audio recordings.", "Court stenographers are necessary"], "id": 754}
{"full_context": ["Only those who are well off can afford to work without pay.", "Unpaid internship exploit college students"], "id": 755}
{"full_context": ["3D printing has the power to change all industries.", "3-D printing will change the world"], "id": 756}
{"full_context": ["Selling arms to Taiwan could trigger an unwanted response from China.", "Stop selling arms to Taiwan"], "id": 757}
{"full_context": ["movies become all about the special effects making pacing, story and character development irrelevant.", "Computer-generated imagery is ruining cinema"], "id": 758}
{"full_context": ["Information regarding healthy eating is readily accessible to any who care to educate themselves.", "We do not need more advice about eating well"], "id": 759}
{"full_context": ["There is a community made in the dorms.", "Students should live on campus"], "id": 760}
{"full_context": ["Overweight people can lose weight.", "Legislation should not protect obese"], "id": 761}
{"full_context": ["Constitutional monarchies can be as stable and prosperous as democracies.", "Democracies should have monarchs"], "id": 762}
{"full_context": ["All children should be able to participate in sports.", "Home-schoolers should play for high school teams"], "id": 763}
{"full_context": ["Like private school, boarding school, and religious school students, home schooled students might pay taxes, but the school colors are not meaningful to them.", "Home-schoolers should not play for high school teams"], "id": 764}
{"full_context": ["Dual citizenship allows one to enjoy the pros and cons of the home country and the country that is welcoming them.", "Dual citizenship should be allowed"], "id": 765}
{"full_context": ["When school is not in session, one can still gain knowledge and a peaceful environment in a library.", "We need libraries"], "id": 766}
{"full_context": ["If people can get away with breaking small laws, they will be more likely to break big ones.", "Strictly enforcing minor violations deter more serious crime"], "id": 767}
{"full_context": ["The Cuban Embargo has been a joke for decades.", "The U.S. should lift sanctions with Cuba"], "id": 768}
{"full_context": ["Children need to learn self control and parents need to respect their child's autonomy.", "Tracking kids invades privacy"], "id": 769}
{"full_context": ["A well written paper takes critical thinking skills.", "Research papers are a useful exercise for college students"], "id": 770}
{"full_context": ["Faux Lotteries are just a form of cherry picking.", "Charter schools are cherry-picking students"], "id": 771}
{"full_context": ["Hybrids are common on the road today.", "Electric cars will succeed"], "id": 772}
{"full_context": ["Rich people use society to get rich and they should be taxed on their riches.", "Do not stop taxing capital gains"], "id": 773}
{"full_context": ["Parental control will lead to children being unchallenged at school.", "Parents should not control what kids learn at school"], "id": 774}
{"full_context": ["Police officers are occasionally untruthful or falsify evidence.", "Police officers should be required to wear cameras"], "id": 775}
{"full_context": ["Local communities do a better job than huge agencies like FEMA.", "We don't need FEMA"], "id": 776}
{"full_context": ["Everyone has different dietary requirements and compelling others to try to live by vegan standards may not work well for them.", "Veganism is not good for everyone"], "id": 777}
{"full_context": ["Public schools already tailor classes to children's needs without parent interference.", "Parents should not control what kids learn at school"], "id": 778}
{"full_context": ["China is basically a dictatorship and the US does business with them.", "The U.S. should lift sanctions with Cuba"], "id": 779}
{"full_context": ["Streaming services do not pay artists as much as radio does.", "Streaming is not good for musicians"], "id": 780}
{"full_context": ["Bikers show no regard for red lights, one way streets, or for even using the lanes. Exiting a car is hazardous. Bikers use the other side of the street, then complain when doors open etc. and endanger them.", "New York's bike lanes are not working"], "id": 781}
{"full_context": ["Some are not willing to take the risk of vaccine injuries.", "Vaccination should not be mandatory for all children"], "id": 782}
{"full_context": ["There are thousands of people injured by vaccines, and years of studies that make me question their safety.", "Vaccination should not be mandatory for all children"], "id": 783}
{"full_context": ["Enthusiasm by young teachers can actually be worth more than teachers who have a negative attitude.", "Teachers do not need to have experience"], "id": 784}
{"full_context": ["Family vacations teach children to handle uncertainties and unexpected happenings in an unfamiliar environment.", "Parents should make vacation with kids"], "id": 785}
{"full_context": ["The kids playing sports for fun aren't benefiting from doping.", "Doping should not be allowed"], "id": 786}
{"full_context": ["A small city with architectural treasures can become an international destination for architecture aficionados.", "'Starchitects' are not ruining cities"], "id": 787}
{"full_context": ["Eating meat is animistic and not right for humans.", "Veganism is good for everyone"], "id": 788}
{"full_context": ["The vast trains in Europe, Japan and China are comfortable.", "California needs high-speed rail"], "id": 789}
{"full_context": ["Humanities help students to appreciate early teachings of Greeks and Romans.", "Colleges need humanities programs"], "id": 790}
{"full_context": ["Corporations should cover the losses of identity theft of their customer if they are hacked and should be required to inform customer right away.", "Disclosure makes consumers safer"], "id": 791}
{"full_context": ["Obamacare was a return of healthcare to the free market.", "Obamacare is working"], "id": 792}
{"full_context": ["Libraries function as community centers, as well as lending out books.", "We need libraries"], "id": 793}
{"full_context": ["A lot of time is lost with computer technical troubles.", "Online classes are not the best way to teach"], "id": 794}
{"full_context": ["Students benefit in life-enhancing ways from the connection with other human beings and teachers.", "Online classes are not the best way to teach"], "id": 795}
{"full_context": ["Germany exiting the Euro would cause depression and nationalism in other states, resulting in chaos.", "Germany should not abandon the Euro"], "id": 796}
{"full_context": ["Research papers encourage students to properly support their arguments.", "Research papers are a useful exercise for college students"], "id": 797}
{"full_context": ["Like private school, boarding school, and religious school students, home schooled students might pay taxes, but the school colors are not meaningful to them.", "Home-schoolers should not play for high school teams"], "id": 798}
{"full_context": ["Parents who do not vaccinate their children should consider what it is like to raise a child in a more disease prevalent country.", "Vaccination should be mandatory for all children"], "id": 799}
{"full_context": ["A man should be inspirational and courageous and loving in a world full of hate.", "Modern men are manly enough"], "id": 800}
{"full_context": ["The internet provides this kind of information for free.", "Colleges do not need humanities programs"], "id": 801}
{"full_context": ["This would be a major loss to society as a whole, and people would miss out on an amazing experience.", "Colleges need humanities programs"], "id": 802}
{"full_context": ["Sports programs teach important things like leadership, discipline, and teamwork.", "Do not drop sports program in undergraduate schools"], "id": 803}
{"full_context": ["Without the CIA, there would be more terrorism on US soil.", "We need the C.I.A."], "id": 804}
{"full_context": ["Doping gives an unfair advantage to certain players which bothers me,", "Doping should not be allowed"], "id": 805}
{"full_context": ["Public schools before college should be the main focus of the government.", "Government should not grade colleges"], "id": 806}
{"full_context": ["If doping were allowed, the Olympics would become about which countries can afford the best technology rather than the spirit of the sport itself.", "Doping should not be allowed"], "id": 807}
{"full_context": ["The government getting rid of usury laws allowed banks to charge high fees.", "Fees should be more regulated"], "id": 808}
{"full_context": ["We can learn healthy habits to defend against the marketing of the food industrial complex.", "We need more advice about eating well"], "id": 809}
{"full_context": ["Salt makes food taste better.", "Salt should have a place at the table"], "id": 810}
{"full_context": ["Assad has helped ISIS rise.", "The U.S. should not work with Assad to fight ISIS"], "id": 811}
{"full_context": ["The US should work with all of the countries that are fighting ISIS.", "The U.S. should work with Assad to fight ISIS"], "id": 812}
{"full_context": ["Large group housing is available elsewhere where students can find a unique experience.", "Students should live off campus"], "id": 813}
{"full_context": ["There is a community made in the dorms.", "Students should live on campus"], "id": 814}
{"full_context": ["Without incentive, they don't want to learn anything other than what they have to.", "People are getting dumber"], "id": 815}
{"full_context": ["Legal prostitution will lead to a reduction in STD's and make sex slavery more difficult it has been shown that legality does not stop the sex industry from existing.", "Prostitution is safer when it's legal"], "id": 816}
{"full_context": ["It would cause an increase in price on farmed goods, but it will be minimal.", "Farms could survive without illegal labor"], "id": 817}
{"full_context": ["Legal identification would help police identify people.", "All immigrants should get ID cards"], "id": 818}
{"full_context": ["The hard-working great classroom teacher is not rewarded under TFA system.", "TFA has not raised the status of teachers"], "id": 819}
{"full_context": ["Vegan diets do not supply enough nutrients.", "Veganism is not good for everyone"], "id": 820}
{"full_context": ["A regulated market has replaced an unregulated and dangerous black market.", "Colorado didn't go too far with pot"], "id": 821}
{"full_context": ["All foods come from the same farms.", "Organic food is not worth the expense"], "id": 822}
{"full_context": ["The embargo belongs in the history books.", "The U.S. should lift sanctions with Cuba"], "id": 823}
{"full_context": ["When school is not in session, one can still gain knowledge and a peaceful environment in a library.", "We need libraries"], "id": 824}
{"full_context": ["Young people delaying adulthood are a drain on their parents.", "Young people are being irresponsible by delaying the rituals of adult life"], "id": 825}
{"full_context": ["Continuing to eat chemically manipulated foods is bad for the human body, which struggles to eliminate these foreign substances.", "Organic food is worth the expense"], "id": 826}
{"full_context": ["Many people ride bikes to work.", "New York's bike lanes are working"], "id": 827}
{"full_context": ["Many of them lost interest in teaching long ago and only continue for the retirement.", "Tenure protects bad teachers"], "id": 828}
{"full_context": ["The CIA is only good for destabilizing governments and fighting proxy wars.", "We don't need the C.I.A."], "id": 829}
{"full_context": ["Soy is not good for babies according to The Weston A Price Foundation website.", "Veganism is not good for everyone"], "id": 830}
{"full_context": ["Avoiding intellectual conflict creates stupid people who will not compromise for society.", "Parents should not control what kids learn at school"], "id": 831}
{"full_context": ["While the children might be well trained, they are effectively robots who lack humanity when contributing to society.", "Extreme parenting is counterproductive"], "id": 832}
{"full_context": ["Humans are naturally omnivorous, as dictated by our physiological needs, and veganism is a health risk.", "Veganism is not good for everyone"], "id": 833}
{"full_context": ["Libraries are essential for books and reading.", "We need libraries"], "id": 834}
{"full_context": ["In-person human interaction and the development of social skills are essential to the education process.", "Online classes are not the best way to teach"], "id": 835}
{"full_context": ["Salt is useful for replacing electrolytes lost through exercise.", "Salt should have a place at the table"], "id": 836}
{"full_context": ["A rail provides connections and efficiency.", "California needs high-speed rail"], "id": 837}
{"full_context": ["Regardless of the costume, men are still responsible and courageous.", "Modern men are manly enough"], "id": 838}
{"full_context": ["Lakes are public and should be accessible.", "Beachfront homes should have to open their land to the public"], "id": 839}
{"full_context": ["Farmers could pay a reasonable wage and there would be very little difference in the price or fruits and vegetables.", "Farms could survive without illegal labor"], "id": 840}
{"full_context": ["3-d printing is slow and inflexible with materials used.", "3-D printing will not change the world"], "id": 841}
{"full_context": ["Sports programs are too expensive.", "Drop sports program in undergraduate schools"], "id": 842}
{"full_context": ["Capital gains should be taxed at the same rate as other income.", "Do not stop taxing capital gains"], "id": 843}
{"full_context": ["Patenting genes inhibits innovations and blocks medical care.", "Companies shouldn't be allowed to patent genes"], "id": 844}
{"full_context": ["Undocumented people would no longer remain anonymous to the government.", "All immigrants should get ID cards"], "id": 845}
{"full_context": ["Machines do not provide the same services as human educators.", "Online classes are not the best way to teach"], "id": 846}
{"full_context": ["Common experience bonds humans, and the effect is powerful when the attachment originates with our school.", "Do not drop sports program in undergraduate schools"], "id": 847}
{"full_context": ["Many foods, like poultry or popcorn, require salt for optimal taste.", "Salt should have a place at the table"], "id": 848}
{"full_context": ["Greece cannot support its own economy and is bringing the Euro down.", "Greece will destroy the Euro Zone"], "id": 849}
{"full_context": ["Solar panels can absorb and transfer energy into a battery which will give the car enough energy to run.", "Electric cars will succeed"], "id": 850}
{"full_context": ["The future is an opportunity for electric car success if battery costs go down.", "Electric cars will succeed"], "id": 851}
{"full_context": ["Raising the rim would further increase the advantage of taller players, not decrease it.", "Rim should not be raised"], "id": 852}
{"full_context": ["Addiction is almost impossible when the subjects are happy and healthy.", "Colorado didn't go too far with pot"], "id": 853}
{"full_context": ["Because prostitution has been illegal, it tends to be dominated by often violent pimps.", "Prostitution is safer when it's legal"], "id": 854}
{"full_context": ["Mandatory voting in not democratic.", "Voting should not be mandatory"], "id": 855}
{"full_context": ["There are many advantages of ending it, including saving money.", "We should disband NATO"], "id": 856}
{"full_context": ["Anyone refusing to vaccinate children should be liable for any disease or death they cause.", "Vaccination should be mandatory for all children"], "id": 857}
{"full_context": ["Cameras could help when there are complaints about officers.", "Police officers should be required to wear cameras"], "id": 858}
{"full_context": ["Precedent should not be broken.", "Queen Elizabeth II should not step down"], "id": 859}
{"full_context": ["The United States' supporting Israel prevents resolutions to condemn dehumanizing activities and atrocities against Palestinians.", "Supporting Israel hurts"], "id": 860}
{"full_context": ["Charles should become King at a younger age than his mother's.", "Queen Elizabeth II should step down"], "id": 861}
{"full_context": ["Casinos bring uncalculated social costs.", "Casinos are too much of a gamble"], "id": 862}
{"full_context": ["Interns work as hard as regular employees.", "Unpaid internship exploit college students"], "id": 863}
{"full_context": ["There are much more dangerous things than smoking pot that are not illegal.", "Colorado didn't go too far with pot"], "id": 864}
{"full_context": ["Wal-mart's changes do more for its image than public health; it is the government's job to look out for public health.", "Wal-Mart can't make us healthier"], "id": 865}
{"full_context": ["Has worked  quite well in West Chester Ohio.", "Home-schoolers should play for high school teams"], "id": 866}
{"full_context": ["Highly competitive sports helps you learn to compete in the business world. Far more than those who have never been part of competitive sports can understand.", "Do not drop sports program in undergraduate schools"], "id": 867}
{"full_context": ["Vegan diets are not enjoyable or easy to process.", "Veganism is not good for everyone"], "id": 868}
{"full_context": ["This simply is a loophole around the free market for labor.", "Businesses should not be allowed to have new employees sign noncompete deals"], "id": 869}
{"full_context": ["Has worked  quite well in West Chester Ohio.", "Home-schoolers should play for high school teams"], "id": 870}
{"full_context": ["Cases of measles, mumps and other diseases are increasing.", "Vaccination should be mandatory for all children"], "id": 871}
{"full_context": ["A government rating system could help alleviate the student debt problem.", "Government should grade colleges"], "id": 872}
{"full_context": ["Eating organic foods is healthier and expensive but i live longer.", "Organic food is worth the expense"], "id": 873}
{"full_context": ["A parent at home can give more individual attention than can a  teacher of a large class.", "Parents should help their children with homework"], "id": 874}
{"full_context": ["Family vacations create lifelong memories.", "Parents should make vacation with kids"], "id": 875}
{"full_context": ["One can avoid and improve heavy traffic by using public transportation or biking.", "New York's bike lanes are working"], "id": 876}
{"full_context": ["Drone attacks are impersonal and indiscriminate of targets.", "Drone attacks make more harm"], "id": 877}
{"full_context": ["Home schooling is a scam meant to defund public schools, punish teachers' unions for supporting Democratic candidates and policies, and to keep women out of the paid  labor force.", "Home schoolers do not deserve a tax break"], "id": 878}
{"full_context": ["Teachers should teach what there assigned. Teachers have gone to school for this, it's what they do for a living.", "Parents should not control what kids learn at school"], "id": 879}
{"full_context": ["People who choose not to vaccinate their children endanger their children as well as others.", "Vaccination should be mandatory for all children"], "id": 880}
{"full_context": ["Allocating resources to education is more useful than funding casinos", "Casinos are too much of a gamble"], "id": 881}
{"full_context": ["Pesticides are just naturally bad for you.", "Organic food is worth the expense"], "id": 882}
{"full_context": ["American executives are greedy and do not care about the American people.", "Fees should be more regulated"], "id": 883}
{"full_context": ["If you wait until you are older to begin parenting you will not be bothered by others critiquing your parenting style.", "Women should delay motherhood"], "id": 884}
{"full_context": ["A person learns a lot through peer interactions and discussions.", "Online classes are not the best way to teach"], "id": 885}
{"full_context": ["Veganism is not a sound way for everyone to eat as some vegans are less healthy than their non-vegan counterparts.", "Veganism is not good for everyone"], "id": 886}
{"full_context": ["Middle class savers would be protected if they could get past interest.", "Stop taxing capital gains"], "id": 887}
{"full_context": ["If a hurricane destroys their beach house, they are compensated with aid, so allowing people to walk on the beach is a fair trade off.", "Beachfront homes should have to open their land to the public"], "id": 888}
{"full_context": ["Studying literature develops critical analysis and writing skills.", "Colleges need humanities programs"], "id": 889}
{"full_context": ["Children need an adult to help them learn good working habits and help with their frustration.", "Parents should help their children with homework"], "id": 890}
{"full_context": ["Doctors advocate for vaccines even though they know they carry risks.", "Vaccination should not be mandatory for all children"], "id": 891}
{"full_context": ["Tips are how a service job becomes more than a service job.", "To tip"], "id": 892}
{"full_context": ["These people have self induced problems that over rule any of their intellect.", "Legislation should not protect obese"], "id": 893}
{"full_context": ["The use of performance enhancing drugs by athletes has turned off many competitors and fans.", "Doping should not be allowed"], "id": 894}
{"full_context": ["In other parts of the world, including Japan, Europe, and New Zealand, restaurant employees earn a living wage and aren't dependent on patrons' tips.", "Not to tip"], "id": 895}
{"full_context": ["Government is already struggling to pay for basic needs.", "Sport leagues should not enjoy nonprofit status"], "id": 896}
{"full_context": ["Public schools already tailor classes to children's needs without parent interference.", "Parents should not control what kids learn at school"], "id": 897}
{"full_context": ["TFA teachers never gain enough experience to be helpful.", "TFA is not working"], "id": 898}
{"full_context": ["We are less informed and aren't motivated to be informed.", "People are getting dumber"], "id": 899}
{"full_context": ["Miss America gives honors and education scholarships.", "Miss America is good for women"], "id": 900}
{"full_context": ["The future is an opportunity for electric car success if battery costs go down.", "Electric cars will succeed"], "id": 901}
{"full_context": ["People are crossing the street and not looking for traffic in the bike lane.", "New York's bike lanes are not working"], "id": 902}
{"full_context": ["If it is a time restricted noncompete with provisions for compensation for employment restrictions.", "Businesses should be allowed to have new employees sign noncompete deals"], "id": 903}
{"full_context": ["A vegan diet goes against human evolution.", "Veganism is not good for everyone"], "id": 904}
{"full_context": ["The students will need to learn how to perform college work and write a serious paper.", "Research papers are a useful exercise for college students"], "id": 905}
{"full_context": ["People have basic human weaknesses like greed regardless of how much money they have.", "Rich politicans are not less corruptible"], "id": 906}
{"full_context": ["The health issues that accompany gambling would necessitate the government to spend money to counteract them.", "Internet gambling should not be legalized"], "id": 907}
{"full_context": ["NATO has helped us keep peace since the Cold War.", "We should keep NATO"], "id": 908}
{"full_context": ["Teachers are safe from review.", "Tenure protects bad teachers"], "id": 909}
{"full_context": ["The humanities are vital to a broad and professional education.", "Colleges need humanities programs"], "id": 910}
{"full_context": ["The ability to get food outside the home with ease over the last 40 year, requires us to need more advice about eating well.", "We need more advice about eating well"], "id": 911}
{"full_context": ["The Israelis are now harming and oppressing the Palestinians which shouldn't be tolerated.", "Supporting Israel hurts"], "id": 912}
{"full_context": ["The Rock Hall of Fame is a house of treasures.", "Rock Hall of Fame matters"], "id": 913}
{"full_context": ["Charter schools getting rid of problem students creates more problems.", "Charter schools are cherry-picking students"], "id": 914}
{"full_context": ["Humanities programs make people think differently and more creatively.", "Colleges need humanities programs"], "id": 915}
{"full_context": ["There can be allergies, and homeopathy is a better alternative.", "Vaccination should not be mandatory for all children"], "id": 916}
{"full_context": ["They keep good records.", "Court stenographers are necessary"], "id": 917}
{"full_context": ["The spouse of the candidate is not being elected and will have no official role in the administration.", "We don't need to hear from candidate's spouse"], "id": 918}
{"full_context": ["These programs bring lots of revenue, which all of the other activities of a University simply don't. No taxpayers in this country are willing to support the education of other peoples children.", "Do not drop sports program in undergraduate schools"], "id": 919}
{"full_context": ["Restaurant owners benefit at the detriment of workers.", "Not to tip"], "id": 920}
{"full_context": ["Humanities and the sciences are complementary disciplines.", "Colleges need humanities programs"], "id": 921}
{"full_context": ["The only interest of the private sector is the bottom line profits.", "Privatization is a bad deal for cities and states"], "id": 922}
{"full_context": ["Gambling can be regulated through the use of a universal ID.", "Internet gambling should be legalized"], "id": 923}
{"full_context": ["Legal identification would help police identify people.", "All immigrants should get ID cards"], "id": 924}
{"full_context": ["The humanities are vital to a broad and professional education.", "Colleges need humanities programs"], "id": 925}
{"full_context": ["Public Libraries are good for those less fortunate, providing a nearly free source of different media's.", "We need libraries"], "id": 926}
{"full_context": ["The CIA is too large and corrupt to be reformed.", "We don't need the C.I.A."], "id": 927}
{"full_context": ["Libraries provide help for the homeless, including temporary shelter and career resources.", "We need libraries"], "id": 928}
{"full_context": ["The internet contains sufficient nutrition information.", "We do not need more advice about eating well"], "id": 929}
{"full_context": ["Dunks are still difficult to achieve given the defenses most teams now use.", "Rim should not be raised"], "id": 930}
{"full_context": ["It took me 5 years to become a good teacher.", "Teachers need to have experience"], "id": 931}
{"full_context": ["TFA does not help public school teachers as a whole, there are some passing benefits for a class or two but it makes me wonder about the students not in those classes or the school itself benefiting.", "TFA has not raised the status of teachers"], "id": 932}
{"full_context": ["It is just a way for companies to save money.", "Unpaid internship exploit college students"], "id": 933}
{"full_context": ["As a nation, it is well known that Israel has a stockpile of nuclear weapons that they should be forced to give up.", "Supporting Israel hurts"], "id": 934}
{"full_context": ["Internships should be treated like all other work.", "Unpaid internship exploit college students"], "id": 935}
{"full_context": ["Tipping servers provides an added incentive to create a pleasant environment for the customers.", "To tip"], "id": 936}
{"full_context": ["The sanctions are leftover from the Cold War, a different era of thinking.", "The U.S. should lift sanctions with Cuba"], "id": 937}
{"full_context": ["Human bodies are designed as omnivores.", "Veganism is not good for everyone"], "id": 938}
{"full_context": ["Giving all immigrants ID cards would allow police to get information about people from their home country.", "All immigrants should get ID cards"], "id": 939}
{"full_context": ["Humanities programs teach non-essential information.", "Colleges do not need humanities programs"], "id": 940}
{"full_context": ["The rail is much safer.", "California needs high-speed rail"], "id": 941}
{"full_context": ["Parents are welcome to home school or find a school that teaches as they approve instead of dictating public school teaching.", "Parents should not control what kids learn at school"], "id": 942}
{"full_context": ["Highly competitive sports helps you learn to compete in the business world. Far more than those who have never been part of competitive sports can understand.", "Do not drop sports program in undergraduate schools"], "id": 943}
{"full_context": ["The chef can't know how each person wants their food seasoned.", "Salt should have a place at the table"], "id": 944}
{"full_context": ["They have paid for the right through taxes and deserve the chance to further their athletic abilities.", "Home-schoolers should play for high school teams"], "id": 945}
{"full_context": ["Older teacher taught new one discipline and techniques.", "Tenure provides stability"], "id": 946}
{"full_context": ["These agreements put this country behind Czarist Russia in regards to our work force.", "Businesses should not be allowed to have new employees sign noncompete deals"], "id": 947}
{"full_context": ["Libraries have many events and activities as well as expert staff which play a vital role in the community.", "We need libraries"], "id": 948}
{"full_context": ["Professional critics shed light to things that would otherwise be missed, make people question things, and think harder about things.", "We need professional critics"], "id": 949}
{"full_context": ["Having lived through some of the more catastrophic changes on this planet, political as well as economic. Having made some very tough decisions, which impact millions of people...Her Royal Highness, has probably, more wisdom than all journalists combined.", "Queen Elizabeth II should not step down"], "id": 950}
{"full_context": ["Salt makes food taste better.", "Salt should have a place at the table"], "id": 951}
{"full_context": ["All people must be responsible for funding public schools with tax money in my opinion.", "Home schoolers do not deserve a tax break"], "id": 952}
{"full_context": ["Arabs main goal is to destroy Israel.", "Hamas-Fatah unity can't lead to mideast peace"], "id": 953}
{"full_context": ["Forcing a poet to practice science does not produce a top notch scientist but fine tuning literary skills can make a great poet or literary artist.", "Extreme parenting is counterproductive"], "id": 954}
{"full_context": ["Hosting the Olympics is a waste of money.", "Olympics are more trouble"], "id": 955}
{"full_context": ["Salt shakers permit diners to control the amount of salt in their food.", "Salt should have a place at the table"], "id": 956}
{"full_context": ["The slam dunk has lessened the attraction of watching an NBA game.", "Rim should be raised"], "id": 957}
{"full_context": ["Experienced teachers lose their zest by the 6th or 7th year.", "Teachers do not need to have experience"], "id": 958}
{"full_context": ["Most Americans live within commuting distance of universities.", "Students should live off campus"], "id": 959}
{"full_context": ["Those choosing to home school should not be allowed to just take what they want from public education.", "Home-schoolers should not play for high school teams"], "id": 960}
{"full_context": ["Libraries have always been about making information available to all people.", "We need libraries"], "id": 961}
{"full_context": ["Removing the essay portion of the SAT sends a message that writing is not a valuable skill.", "Writing can be assessed"], "id": 962}
{"full_context": ["Good research papers will require students to access real books and information.", "Research papers are a useful exercise for college students"], "id": 963}
{"full_context": ["My daughter was simply lazy and not doing work, by cracking down I was able to get her to improve her grades.", "Extreme parenting leads to greater success"], "id": 964}
{"full_context": ["Gambling can be regulated through the use of a universal ID.", "Internet gambling should be legalized"], "id": 965}
{"full_context": ["To avoid giving money to schools with high dropout rates.", "Government should grade colleges"], "id": 966}
{"full_context": ["People don't know any wiser and don't have standards to judge quality.", "People are getting dumber"], "id": 967}
{"full_context": ["If we force people to vote political commercials would influence elections a lot more.", "Voting should not be mandatory"], "id": 968}
{"full_context": ["Queen Elizabeth II lead through difficult time periods and is a continued source of pride for the United Kingdom.", "Queen Elizabeth II should not step down"], "id": 969}
{"full_context": ["The vast trains in Europe, Japan and China are comfortable.", "California needs high-speed rail"], "id": 970}
{"full_context": ["Libraries have lots to offer in addition to books they provide music, dvd's, magazines and more.", "We need libraries"], "id": 971}
{"full_context": ["Iodine in salt is necessary.", "Salt should have a place at the table"], "id": 972}
{"full_context": ["It is their own discretion if they want to take drugs that will affect only themselves in the long run.", "Doping should be allowed"], "id": 973}
{"full_context": ["Disasters are locally handled by officials and neighbors.", "We don't need FEMA"], "id": 974}
{"full_context": ["Public libraries provide equal access to information for all citizens for both recreation and education.", "We need libraries"], "id": 975}
{"full_context": ["Criticism needs to be strongly raised when a reality show is sexist, racist, or misogynistic.", "Reality shows are worse than other TV"], "id": 976}
{"full_context": ["Libraries function as community centers, as well as lending out books.", "We need libraries"], "id": 977}
{"full_context": ["Enforcing minor violations sets the level of civility that is to be expected in neighborhoods.", "Strictly enforcing minor violations deter more serious crime"], "id": 978}
{"full_context": ["The parents that want to control learning are narrow minded and ignorant and wish their children to be the same.", "Parents should not control what kids learn at school"], "id": 979}
{"full_context": ["Salt is one of the best ways to enhance flavor.", "Salt should have a place at the table"], "id": 980}
{"full_context": ["Big banks will only look out for themselves and then drain the government when they fail.", "Big banks are out of control"], "id": 981}
{"full_context": ["Public libraries provide equal access to information for all citizens for both recreation and education.", "We need libraries"], "id": 982}
{"full_context": ["All evidence supports that humans are omnivores.", "Veganism is not good for everyone"], "id": 983}
{"full_context": ["The embargo hurts our own economy.", "The U.S. should lift sanctions with Cuba"], "id": 984}
{"full_context": ["A librarian can lead the school in information resource management and use.", "School librarians are not expendable"], "id": 985}
{"full_context": ["It is not a top notch plan.", "Obamacare is not working"], "id": 986}
{"full_context": ["Controlling nightmares leads to being better rested.", "We should manipulate our dreams"], "id": 987}
{"full_context": ["It would be better to impose tariffs on foreign imports than to use tax dollars to support farmers, since many farms are large scale industrial enterprises and many farmers are millionaires.", "Farm subsidies do not protect national security"], "id": 988}
{"full_context": ["Doping affects the persons long term health for a short term gain.", "Doping should not be allowed"], "id": 989}
{"full_context": ["Often there are technical problems in online education platforms.", "Online classes are not the best way to teach"], "id": 990}
{"full_context": ["Millions of people will get authorized to work or will return home to improve their lives with work.", "All immigrants should get ID cards"], "id": 991}
{"full_context": ["Research on marijuana was conducted for 20 years before being made legal in Colorado.", "Colorado didn't go too far with pot"], "id": 992}
{"full_context": ["The vast trains in Europe, Japan and China are comfortable.", "California needs high-speed rail"], "id": 993}
{"full_context": ["Living near campus in co-op housing offers the benefits of living in groups and lower costs.", "Students should live off campus"], "id": 994}
{"full_context": ["Homeschooling is a choice.", "Home schoolers do not deserve a tax break"], "id": 995}
{"full_context": ["The U.S. should support the Kurds only.", "The U.S. should not work with Assad to fight ISIS"], "id": 996}
{"full_context": ["It works for Australia.", "Voting should be mandatory"], "id": 997}
{"full_context": ["The idea of allowing states to grant citizenship may have historical roots, but it has serious drawbacks.", "State citizenship is not the answer to immigration reform"], "id": 998}
{"full_context": ["Germany exiting the Euro would cause depression and nationalism in other states, resulting in chaos.", "Germany should not abandon the Euro"], "id": 999}
{"full_context": ["Preschools teach important skills such a taking turns, movement, and mediatation.", "Public preschool is a smart investment"], "id": 1000}
{"full_context": ["Critiques are  needed to call them out on the things they might have not seen for themselves, even if the critique isn't the most positive thing.", "We need professional critics"], "id": 1001}
{"full_context": ["Those with the most money will always come out on top.", "The new apps is a way to sell what was once free"], "id": 1002}
{"full_context": ["Has worked  quite well in West Chester Ohio.", "Home-schoolers should play for high school teams"], "id": 1003}
{"full_context": ["Humanities courses ensure students are exposed to other cultures.", "Colleges need humanities programs"], "id": 1004}
{"full_context": ["We all have a right to be protected against communicable diseases which cause serious issues or death.", "Vaccination should be mandatory for all children"], "id": 1005}
{"full_context": ["Others enjoy the fast and clean benefits.", "California needs high-speed rail"], "id": 1006}
{"full_context": ["to tell the story and preserve the sounds.", "Rock Hall of Fame matters"], "id": 1007}
{"full_context": ["Longer wait times increase the probability of needing fertility procedures.", "Women should not delay motherhood"], "id": 1008}
{"full_context": ["Those choosing to home school should not be allowed to just take what they want from public education.", "Home-schoolers should not play for high school teams"], "id": 1009}
{"full_context": ["The US sides blindly with Isreal despite what could be proof that it is not the best route.", "Supporting Israel hurts"], "id": 1010}
{"full_context": ["My salt intake is medicinal and catered to my individual needs.", "Salt should have a place at the table"], "id": 1011}
{"full_context": ["Those who find successful careers after college often spend their time touring Europe after they are done with their education.", "Colleges need humanities programs"], "id": 1012}
{"full_context": ["Harvard is very wealthy and that money could provide education to thousands. Instead, it just serves to suggest that Harvard provides a superior education.", "Wealthy colleges do not deserve tax breaks"], "id": 1013}
{"full_context": ["Reality shows fake misery, drama, and embarrassment and pretend as though it is real.", "Reality shows are worse than other TV"], "id": 1014}
{"full_context": ["Government grading colleges would serve taxpayers, who expect high results from colleges.", "Government should grade colleges"], "id": 1015}
{"full_context": ["Homeschooling is a choice.", "Home schoolers do not deserve a tax break"], "id": 1016}
{"full_context": ["We are made to be omnivores.", "Veganism is not good for everyone"], "id": 1017}
{"full_context": ["The CIA has historically been involved in war crimes and torture.", "We don't need the C.I.A."], "id": 1018}
{"full_context": ["My French studies were the most relevant part of my academics background; being fluent in French is highly valuable.", "Colleges need humanities programs"], "id": 1019}
{"full_context": ["If doping were allowed, the Olympics would become about which countries can afford the best technology rather than the spirit of the sport itself.", "Doping should not be allowed"], "id": 1020}
{"full_context": ["Public schools before college should be the main focus of the government.", "Government should not grade colleges"], "id": 1021}
{"full_context": ["Kids wish to know their grandparents.", "Women should not delay motherhood"], "id": 1022}
{"full_context": ["Parents muse be able to choose what is best for their children and family.", "Vaccination should not be mandatory for all children"], "id": 1023}
{"full_context": ["Continuing to eat chemically manipulated foods is bad for the human body, which struggles to eliminate these foreign substances.", "Organic food is worth the expense"], "id": 1024}
{"full_context": ["Extra suspensions in charter schools are a failure of their business model and should be liable for results and restitution.", "Charter schools are cherry-picking students"], "id": 1025}
{"full_context": ["3D printing allows for low cost rapid prototypes and does not require high volumes as traditional manufacturing does.", "3-D printing will change the world"], "id": 1026}
{"full_context": ["Supporting Israel creates sympathy for your favorite nation and can cause you to enter quarrels without proper justification or inducement.", "Supporting Israel hurts"], "id": 1027}
{"full_context": ["Without capital gains tax, the market would collapse.", "Do not stop taxing capital gains"], "id": 1028}
{"full_context": ["A person learns a lot through peer interactions and discussions.", "Online classes are not the best way to teach"], "id": 1029}
{"full_context": ["Libraries provide help for the homeless, including temporary shelter and career resources.", "We need libraries"], "id": 1030}
{"full_context": ["I am insulted that  good teachers being replaced by teachers waiting for a year or two to get into law school or a better paying job.", "TFA has not raised the status of teachers"], "id": 1031}
{"full_context": ["It helps the environment and extends the life span.", "Veganism is good for everyone"], "id": 1032}
{"full_context": ["Casinos will cause more debt from people losing their life savings there.", "Casinos are too much of a gamble"], "id": 1033}
{"full_context": ["Libraries provide internet for those that need it to do homework, find employment, and file taxes.", "We need libraries"], "id": 1034}
{"full_context": ["The Rock Hall of fame gives people distraction from everyday life.", "Rock Hall of Fame matters"], "id": 1035}
{"full_context": ["Work from the Architects Collaborative and sculptors, which includes many well-known names, have enhanced large cities.", "'Starchitects' are not ruining cities"], "id": 1036}
{"full_context": ["Prospect Park West looks better without a bike lane.", "New York's bike lanes are not working"], "id": 1037}
{"full_context": ["Student learning can't be measured.", "Government should not grade colleges"], "id": 1038}
{"full_context": ["Raise prices to actually provide something like a living wage to servers so they don't have to rely on unreliable tips.", "Not to tip"], "id": 1039}
{"full_context": ["Vegan diets do not supply enough nutrients.", "Veganism is not good for everyone"], "id": 1040}
{"full_context": ["Libraries provide access to books to minority children.", "We need libraries"], "id": 1041}
{"full_context": ["Without capital gains taxes, the working class will be shouldering the weight of the rich.", "Do not stop taxing capital gains"], "id": 1042}
{"full_context": ["3D printing technology will evolve and grow, just like cell phones have.", "3-D printing will change the world"], "id": 1043}
{"full_context": ["Most Americans do not want to go to war with Iran in support of a corrupt right wing Israeli government.", "Supporting Israel hurts"], "id": 1044}
{"full_context": ["If it is a time restricted noncompete with provisions for compensation for employment restrictions.", "Businesses should be allowed to have new employees sign noncompete deals"], "id": 1045}
{"full_context": ["Drones are needed to battle a repressive culture that results in oppressed women and dead soldiers.", "Drone attacts make more good"], "id": 1046}
{"full_context": ["They provide internet access for the poor, as well as other things.", "We need libraries"], "id": 1047}
{"full_context": ["Corporations should cover the losses of identity theft of their customer if they are hacked and should be required to inform customer right away.", "Disclosure makes consumers safer"], "id": 1048}
{"full_context": ["Libraries have lots to offer in addition to books they provide music, dvd's, magazines and more.", "We need libraries"], "id": 1049}
{"full_context": ["The CIA is only good for destabilizing governments and fighting proxy wars.", "We don't need the C.I.A."], "id": 1050}
{"full_context": ["Looking into my dreams gives me a look into my subconscious life and it is always an adventure.", "We should not manipulate our dreams"], "id": 1051}
{"full_context": ["Sports in college are extraneous and have inappropriate impact on academic issues.", "Drop sports program in undergraduate schools"], "id": 1052}
{"full_context": ["The uber conservative republicans are the ones pushing privatization the most.", "Privatization is a bad deal for cities and states"], "id": 1053}
{"full_context": ["The Rock Hall of fame gives people distraction from everyday life.", "Rock Hall of Fame matters"], "id": 1054}
{"full_context": ["Writing can be assessed with style guidelines and should be an included section for evaluating students on the SAT exam.", "Writing can be assessed"], "id": 1055}
{"full_context": ["Bike lanes ensure the safety of both bikers and pedestrians.", "New York's bike lanes are working"], "id": 1056}
{"full_context": ["Banks can get bailed out, but young people with student loans are locked into debt.", "College free for everyone"], "id": 1057}
{"full_context": ["Internships that provide real experience in a field serve a big value to society.", "Unpaid internship doesn't exploit college students"], "id": 1058}
{"full_context": ["Banks are constantly looking for innovative ways to pass fees on to consumers.", "Fees should be more regulated"], "id": 1059}
{"full_context": ["Capital gains should be taxed at the same rate as other income.", "Do not stop taxing capital gains"], "id": 1060}
{"full_context": ["Libraries are giving the public access to information in new and exciting ways.", "We need libraries"], "id": 1061}
{"full_context": ["Tenure allows for teachers who drink on the job or fall asleep at their desks to bargain for bonuses and increased retirement in order to get rid of them.", "Tenure protects bad teachers"], "id": 1062}
{"full_context": ["Some people like a social place to read.", "We need libraries"], "id": 1063}
{"full_context": ["Eating organic foods is healthier and expensive but i live longer.", "Organic food is worth the expense"], "id": 1064}
{"full_context": ["Prince William is not familiar with normal people and has had very little experience mixing with the non-rich.", "Royal Couple could not be a modern family"], "id": 1065}
{"full_context": ["The sports industry should stop testing for doping.", "Doping should be allowed"], "id": 1066}
{"full_context": ["Drones may prove to be more dangerous to their present users in the future.", "Drone attacks make more harm"], "id": 1067}
{"full_context": ["Television and texting are disturbing brains at a young age.", "People are getting dumber"], "id": 1068}
{"full_context": ["The number of city-bound cyclists to Manhattan has almost doubled in the last seven years.", "New York's bike lanes are working"], "id": 1069}
{"full_context": ["Tracking kids keeps them safe.", "Tracking kids does not invade privacy"], "id": 1070}
{"full_context": ["Public Libraries are good for those less fortunate, providing a nearly free source of different media's.", "We need libraries"], "id": 1071}
{"full_context": ["Students either take out loans, or pay out of pocket to work as an intern.", "Unpaid internship exploit college students"], "id": 1072}
{"full_context": ["Enforcing minor violations sets the level of civility that is to be expected in neighborhoods.", "Strictly enforcing minor violations deter more serious crime"], "id": 1073}
{"full_context": ["I prefer a flat rate system.", "Not to tip"], "id": 1074}
{"full_context": ["Machines do not provide the same services as human educators.", "Online classes are not the best way to teach"], "id": 1075}
{"full_context": ["Not taxing capital gains did not work previously and it still won't.", "Do not stop taxing capital gains"], "id": 1076}
{"full_context": ["Pageants are nothing more than a cattle call for sponsors.", "Miss America is bad for women"], "id": 1077}
{"full_context": ["High school players are often short, and would not want the rim raised.", "Rim should not be raised"], "id": 1078}
{"full_context": ["Daycare has cost me a lot of money for my three children.", "Public preschool is a smart investment"], "id": 1079}
{"full_context": ["Tourists are scammed into using the bike lanes.", "New York's bike lanes are not working"], "id": 1080}
{"full_context": ["When children discuss what they are learning with their parents, it helps to reinforce what they have learned.", "Parents should help their children with homework"], "id": 1081}
{"full_context": ["Companies that keep sensitive information about their customers, should disclose hacks to those customers.", "Disclosure makes consumers safer"], "id": 1082}
{"full_context": ["People are not using their intelligence to the best of his or her ability anymore.", "People are getting dumber"], "id": 1083}
{"full_context": ["Without the dictators of the Middle east keeping extremist in check there would be more ISIS like extremest threatening the world.", "The U.S. should work with Assad to fight ISIS"], "id": 1084}
{"full_context": ["Parents don't have a six-year degree, or teaching license to qualify for text/curriculum/lesson plan design -  just as they have no geology degree for road projects, or med degree for surgical procedures, or chemical engineering degree for civic operations.", "Parents should not control what kids learn at school"], "id": 1085}
{"full_context": ["Online classes can require a lot of repetitive exercises and leave the student at the mercy of the computer with regards to grading.", "Online classes are not the best way to teach"], "id": 1086}
{"full_context": ["Having lived through some of the more catastrophic changes on this planet, political as well as economic. Having made some very tough decisions, which impact millions of people...Her Royal Highness, has probably, more wisdom than all journalists combined.", "Queen Elizabeth II should not step down"], "id": 1087}
{"full_context": ["Sports in college are extraneous and have inappropriate impact on academic issues.", "Drop sports program in undergraduate schools"], "id": 1088}
{"full_context": ["Everyone has their own tastes when it comes to salt.", "Salt should have a place at the table"], "id": 1089}
{"full_context": ["It is not the job of a public school teacher to raise children - that is the parents' job.", "School day should not be longer"], "id": 1090}
{"full_context": ["There are other ways to get your foot in the door besides unpaid internships.", "Unpaid internship exploit college students"], "id": 1091}
{"full_context": ["Dual citizens pay their U.S. taxes and are therefore dedicated and valuable to the United States.", "Dual citizenship should be allowed"], "id": 1092}
{"full_context": ["If they don't abandon the Euro they will be creating violence and loss of life.", "Germany should abandon the Euro"], "id": 1093}
{"full_context": ["The current system causes prostitutes to be unable to control their work and safety.", "Prostitution is safer when it's legal"], "id": 1094}
{"full_context": ["Humanities programs teach non-essential information.", "Colleges do not need humanities programs"], "id": 1095}
{"full_context": ["Living off campus will help with off ceding debt.", "Students should live off campus"], "id": 1096}
{"full_context": ["We can learn healthy habits to defend against the marketing of the food industrial complex.", "We need more advice about eating well"], "id": 1097}
{"full_context": ["These programs bring lots of revenue, which all of the other activities of a University simply don't. No taxpayers in this country are willing to support the education of other peoples children.", "Do not drop sports program in undergraduate schools"], "id": 1098}
{"full_context": ["There are machines that can do the illegal labor.", "Farms could survive without illegal labor"], "id": 1099}
{"full_context": ["Paying for restaurant reservations will force customers to compete against each other for a limited resource at an increased price.", "The new apps is a way to sell what was once free"], "id": 1100}
{"full_context": ["TFA cannot live up to its promise to solve all of education's problems, notwithstanding the good intentions of its young teachers.", "TFA has not raised the status of teachers"], "id": 1101}
{"full_context": ["Students must thoroughly process information to apply it towards their paper.", "Research papers are a useful exercise for college students"], "id": 1102}
{"full_context": ["FEMA just hands out money.", "We don't need FEMA"], "id": 1103}
{"full_context": ["The human body can only handle so many pesticides before the immune system is overtaxed.", "Organic food is worth the expense"], "id": 1104}
{"full_context": ["Professionals critics are specifically trained their fields.", "We need professional critics"], "id": 1105}
{"full_context": ["Vacations are a good way for parents and children to connect, but it also gives children knowledge and appreciation of the world.", "Parents should make vacation with kids"], "id": 1106}
{"full_context": ["It can have benefits for both the civilians and the officers.", "Police officers should be required to wear cameras"], "id": 1107}
{"full_context": ["Teachers only have the assurance that they can't be fired on a whim.", "Tenure provides stability"], "id": 1108}
{"full_context": ["Doping affects the persons long term health for a short term gain.", "Doping should not be allowed"], "id": 1109}
{"full_context": ["Nonmember countries such as Ukraine must be protected from untrustworthy and potentially harmful countries like Russia.", "NATO should defend nonmembers"], "id": 1110}
{"full_context": ["I couldn't think straight without dairy products.", "Veganism is not good for everyone"], "id": 1111}
{"full_context": ["Without tenure, there are too many little things that teachers could lose their jobs over.", "Tenure provides stability"], "id": 1112}
{"full_context": ["Nonmember countries such as Ukraine must be protected from untrustworthy and potentially harmful countries like Russia.", "NATO should defend nonmembers"], "id": 1113}
{"full_context": ["Many libraries provide numerous valuable services to their communities.", "We need libraries"], "id": 1114}
{"full_context": ["Dual citizenship allows one to enjoy the pros and cons of the home country and the country that is welcoming them.", "Dual citizenship should be allowed"], "id": 1115}
{"full_context": ["In-person human interaction and the development of social skills are essential to the education process.", "Online classes are not the best way to teach"], "id": 1116}
{"full_context": ["Supporting Israel undermines US national interests and policies in such an absurd way it is not understandable.", "Supporting Israel hurts"], "id": 1117}
{"full_context": ["Addiction is almost impossible when the subjects are happy and healthy.", "Colorado didn't go too far with pot"], "id": 1118}
{"full_context": ["For athletes who choose to not use drugs, the competition wouldn't be fair.", "Doping should not be allowed"], "id": 1119}
{"full_context": ["Teachers in Finland are unionized and students perform well.", "Tenure provides stability"], "id": 1120}
{"full_context": ["The consequences of continued generations delaying having children is that children will be unlikely to have grandparents and vice versa.", "Women should not delay motherhood"], "id": 1121}
{"full_context": ["Arab leaders have no interest in sitting beside a Jewish State that is responsible for decades of Arab refugees.", "Hamas-Fatah unity can't lead to mideast peace"], "id": 1122}
{"full_context": ["Today's world provides young people with the ability to delay the rituals of adult life by providing an environment that gives them time to understand actions and consequences. Young people are smart for taking advantage of these current circumstances.", "Young people are being smart by delaying the rituals of adult life"], "id": 1123}
{"full_context": ["Farms depend on having a supply of unskilled workers who will work seasonal jobs with long hours and bad conditions without advancement opportunities.", "Farms couldn't survive without illegal labor"], "id": 1124}
{"full_context": ["Obesity is a choice, not something forced on someone.", "Legislation should not protect obese"], "id": 1125}
{"full_context": ["Cameras would benefit everyone.", "Police officers should be required to wear cameras"], "id": 1126}
{"full_context": ["Regime change in Libya led to the murder of a US Ambassador, and attacking Syria could have similar results.", "US should not attack Syria"], "id": 1127}
{"full_context": ["Libraries allow a sanctuary for those looking to escape technology.", "We need libraries"], "id": 1128}
{"full_context": ["A system that removed the tired teachers would improve their morale.", "Tenure protects bad teachers"], "id": 1129}
{"full_context": ["While not perfect, Obamacare provides healthcare for some people that would otherwise not be able to afford health insurance.", "Obamacare is working"], "id": 1130}
{"full_context": ["The root of gambling's appeal is greed.", "Casinos are too much of a gamble"], "id": 1131}
{"full_context": ["We want the US to regulate so people will not be exploited.", "Internet gambling should be legalized"], "id": 1132}
{"full_context": ["Dual citizens pay their U.S. taxes and are therefore dedicated and valuable to the United States.", "Dual citizenship should be allowed"], "id": 1133}
{"full_context": ["The US should work with all of the countries that are fighting ISIS.", "The U.S. should work with Assad to fight ISIS"], "id": 1134}
{"full_context": ["There shouldn't be more violence in the region.", "US should not attack Syria"], "id": 1135}
{"full_context": ["Home schoolers are discriminated against when they can't play sports.", "Home-schoolers should play for high school teams"], "id": 1136}
{"full_context": ["The design and implementation of these bike lanes is flawed.", "New York's bike lanes are not working"], "id": 1137}
{"full_context": ["Public librarians can be important to people's lives.", "School librarians are not expendable"], "id": 1138}
{"full_context": ["Illegal immigration is bad for the United States.", "Farms could survive without illegal labor"], "id": 1139}
{"full_context": ["Most Americans do not want to go to war with Iran in support of a corrupt right wing Israeli government.", "Supporting Israel hurts"], "id": 1140}
{"full_context": ["Electric cars are practical for most people.", "Electric cars will succeed"], "id": 1141}
{"full_context": ["Legal prostitution will lead to a reduction in STD's and make sex slavery more difficult it has been shown that legality does not stop the sex industry from existing.", "Prostitution is safer when it's legal"], "id": 1142}
{"full_context": ["Home schooled kids could enjoy sports and company of others around them.", "Home-schoolers should play for high school teams"], "id": 1143}
{"full_context": ["This is a trick to defund public schools.", "Home schoolers do not deserve a tax break"], "id": 1144}
{"full_context": ["Laws that are already in place should prevent violence.", "No, the laws should not be toughened"], "id": 1145}
{"full_context": ["A lot of time is lost with computer technical troubles.", "Online classes are not the best way to teach"], "id": 1146}
{"full_context": ["Online courses should only be used as a low quality cost savings measure.", "Online classes are not the best way to teach"], "id": 1147}
{"full_context": ["Parents might give them to their children.", "Doping should not be allowed"], "id": 1148}
{"full_context": ["movies become all about the special effects making pacing, story and character development irrelevant.", "Computer-generated imagery is ruining cinema"], "id": 1149}
{"full_context": ["If casinos are not a destination resort then they are have a negative impact on locals who cannot afford to be gambling.", "Casinos are too much of a gamble"], "id": 1150}
{"full_context": ["Sometimes a chef doesn't put enough salt on the food.", "Salt should have a place at the table"], "id": 1151}
{"full_context": ["Banks have free use of our money for weeks, months, and years.", "Fees should be more regulated"], "id": 1152}
{"full_context": ["Longer wait times increase the probability of needing fertility procedures.", "Women should not delay motherhood"], "id": 1153}
{"full_context": ["The parents that want to control learning are narrow minded and ignorant and wish their children to be the same.", "Parents should not control what kids learn at school"], "id": 1154}
{"full_context": ["Extreme parenting leads to undeveloped people without a sense of self.", "Extreme parenting is counterproductive"], "id": 1155}
{"full_context": ["Increasing the number of vaccinations for children causes more people to refuse to be vaccinated at all.", "Vaccination should not be mandatory for all children"], "id": 1156}
{"full_context": ["The laws are tough enough and the patient's family and support system are more effective in helping the patient to not become violent.", "No, the laws should not be toughened"], "id": 1157}
{"full_context": ["Vegan options like juices and replacement items are enriched with vitamins.", "Veganism is good for everyone"], "id": 1158}
{"full_context": ["Obese individuals should care for themselves both for their own health and the economic burden on society as a whole.", "Legislation should not protect obese"], "id": 1159}
{"full_context": ["Online courses should only be used as a low quality cost savings measure.", "Online classes are not the best way to teach"], "id": 1160}
{"full_context": ["They provide supplemental materials for curriculum to both teachers and students.", "We need libraries"], "id": 1161}
{"full_context": ["Colorado's legal pot deters crime and reduces jailing of minorities.", "Colorado didn't go too far with pot"], "id": 1162}
{"full_context": ["A bank user has to pay many times more for a service that costs the bank much less.", "Fees should be more regulated"], "id": 1163}
{"full_context": ["The current system causes prostitutes to be unable to control their work and safety.", "Prostitution is safer when it's legal"], "id": 1164}
{"full_context": ["Enlightened libraries could provide us with a sensible approach to information, it COULD be a great way to help us educate our children", "We need libraries"], "id": 1165}
{"full_context": ["Gamblers and TV benefit from college sports more than the players.", "Drop sports program in undergraduate schools"], "id": 1166}
{"full_context": ["Extreme parenting doesn't necessarily raise a compassionate child.", "Extreme parenting is counterproductive"], "id": 1167}
{"full_context": ["Tenure prevents bad teachers from being weeded out early in their career.", "Tenure protects bad teachers"], "id": 1168}
{"full_context": ["Bike lanes ensure the safety of both bikers and pedestrians.", "New York's bike lanes are working"], "id": 1169}
{"full_context": ["Prostitution is harmful, dehumanizing, and encourages modern day slavery.", "Prostitution is not safer when it's legal"], "id": 1170}
{"full_context": ["No one benefits from sports leagues.", "Sport leagues should not enjoy nonprofit status"], "id": 1171}
{"full_context": ["I never met anyone addicted to pot.", "Colorado didn't go too far with pot"], "id": 1172}
{"full_context": ["Obamacare has allowed people with pre-existing conditions to change employment.", "Obamacare is working"], "id": 1173}
{"full_context": ["It is right for home-schoolers to play for high school sports teams if they meet the same academic and other requirements for enrolled kids.", "Home-schoolers should play for high school teams"], "id": 1174}
{"full_context": ["Children need to experience other people and cultures.", "Parents should make vacation with kids"], "id": 1175}
{"full_context": ["Some are not willing to take the risk of vaccine injuries.", "Vaccination should not be mandatory for all children"], "id": 1176}
{"full_context": ["Our history proves we cannot responsibly handle nuclear weapons.", "Nuclear power is not the answer to climate change"], "id": 1177}
{"full_context": ["The embargo has not benefited Cuba or the US.", "The U.S. should lift sanctions with Cuba"], "id": 1178}
{"full_context": ["Writing research papers helps students to learn how to make valid arguments and find reliable sources which is important in today's information society.", "Research papers are a useful exercise for college students"], "id": 1179}
{"full_context": ["Unpaid internships can cost a person more than they provide.", "Unpaid internship exploit college students"], "id": 1180}
{"full_context": ["You cannot decide what is and is not acceptable religious belief.", "Speech cannot be limited for public workers"], "id": 1181}
{"full_context": ["Research on marijuana was conducted for 20 years before being made legal in Colorado.", "Colorado didn't go too far with pot"], "id": 1182}
{"full_context": ["By giving a tax break to home-schoolers we increase the tax burden on everyone else for providing for public schools.", "Home schoolers do not deserve a tax break"], "id": 1183}
{"full_context": ["Workers should have right to speech if they do it on their own time with their own resources, representing themselves.", "Speech cannot be limited for public workers"], "id": 1184}
{"full_context": ["There should be more prerequisites to voting than being alive.", "Voting should not be a constitutional right"], "id": 1185}
{"full_context": ["Greece lacks the central economic authority to leave the Euro Zone.", "Greece will not destroy the Euro Zone"], "id": 1186}
{"full_context": ["Preschool will help children transition into regular schooling.", "Public preschool is a smart investment"], "id": 1187}
{"full_context": ["Tenure allows for teachers who drink on the job or fall asleep at their desks to bargain for bonuses and increased retirement in order to get rid of them.", "Tenure protects bad teachers"], "id": 1188}
{"full_context": ["Players in the rest of the world don't want a higher basket.", "Rim should not be raised"], "id": 1189}
{"full_context": ["Restaurants should not impose their will on customers and allow customers to salt food to their own tastes.", "Salt should have a place at the table"], "id": 1190}
{"full_context": ["In my opinion if money is lacking then it needs to be spent more wisely in the humanities to ensure that every field has a grounding in them.", "Colleges need humanities programs"], "id": 1191}
{"full_context": ["It is important to respect autonomy between the years of 13 and 18.", "Tracking kids invades privacy"], "id": 1192}
{"full_context": ["A person can love America while having more than one passport.", "Dual citizenship should be allowed"], "id": 1193}
{"full_context": ["FEMA just hands out money.", "We don't need FEMA"], "id": 1194}
{"full_context": ["While not perfect, Obamacare provides healthcare for some people that would otherwise not be able to afford health insurance.", "Obamacare is working"], "id": 1195}
{"full_context": ["Amazon allows more leeway and money to the writers.", "Amazon will kill off publishers"], "id": 1196}
{"full_context": ["The security of tenure is necessary to compensate for the low salary of teachers.", "Tenure provides stability"], "id": 1197}
{"full_context": ["Helping children is a positive thing and parents can even use this as an opportunity to listen to their children,", "Parents should help their children with homework"], "id": 1198}
{"full_context": ["There are much more dangerous things than smoking pot that are not illegal.", "Colorado didn't go too far with pot"], "id": 1199}
{"full_context": ["The high cost of premiums will drive younger healthy people to avoid purchasing the insurance and instead pay the tax penalty.", "Obamacare is not working"], "id": 1200}
{"full_context": ["Teachers and daycare workers can help break through problems caused by parents ignorance.", "Public preschool is a smart investment"], "id": 1201}
{"full_context": ["Dividends are earnings and should be treated the same as wages, interest, or CDs.", "Do not stop taxing capital gains"], "id": 1202}
{"full_context": ["Public Libraries are good for those less fortunate, providing a nearly free source of different media's.", "We need libraries"], "id": 1203}
{"full_context": ["Vegans do not live much longer or display much better health.", "Veganism is not good for everyone"], "id": 1204}
{"full_context": ["I would not be a good father if I allowed my child to use the internet without monitoring them.", "Tracking kids does not invade privacy"], "id": 1205}
{"full_context": ["They provide supplemental materials for curriculum to both teachers and students.", "We need libraries"], "id": 1206}
{"full_context": ["Faux Lotteries are just a form of cherry picking.", "Charter schools are cherry-picking students"], "id": 1207}
{"full_context": ["Vegetable intake will lead to a healthier person.", "Veganism is good for everyone"], "id": 1208}
{"full_context": ["With books, an individual can travel all around the world without leaving the room.", "We need libraries"], "id": 1209}
{"full_context": ["TFA has high turnover by design and is expensive.", "TFA has not raised the status of teachers"], "id": 1210}
{"full_context": ["They add a lot to the piece and I look forward to reading comments.", "Comment sections have not failed"], "id": 1211}
{"full_context": ["Many comments are thoughful and insightful.", "Comment sections have not failed"], "id": 1212}
{"full_context": ["People can choose not to use Google.", "Google is not a harmful monopoly"], "id": 1213}
{"full_context": ["Ginsberg is brave for speaking out.", "Supreme court justice can denounce a candidate"], "id": 1214}
{"full_context": ["Attending the Olympics will risk the health of participants and fans as well as their families and entire countries.", "Brazil should postpone Olympics"], "id": 1215}
{"full_context": ["The justice is using her role as a citizen not a judge to speak and Trump is an enemy of law.", "Supreme court justice can denounce a candidate"], "id": 1216}
{"full_context": ["The reading public can use comments sections to voice their opinion on media.", "Comment sections have not failed"], "id": 1217}
{"full_context": ["I find the idea that it is a sin to be born or live a life at all to be preposterous.", "Christians have created a harmful atmosphere for gays"], "id": 1218}
{"full_context": ["Comments sections permit a reader to analyze many different perspectives in one place.", "Comment sections have not failed"], "id": 1219}
{"full_context": ["Comment sections provide insight.", "Comment sections have not failed"], "id": 1220}
{"full_context": ["There should be seating standards, and baggage fees should be waived for those in TSA line over 45 minutes.", "Government should regulate airline industry again"], "id": 1221}
{"full_context": ["Pot hasn't led me to lose control.", "Marijuana is not a gateway drug"], "id": 1222}
{"full_context": ["It is good to be informed about your health.", "Medical websites are healthful"], "id": 1223}
{"full_context": ["Comments are informative.", "Comment sections have not failed"], "id": 1224}
{"full_context": ["Comments sections permit a reader to analyze many different perspectives in one place.", "Comment sections have not failed"], "id": 1225}
{"full_context": ["Concealed carry permit holders have already been background checked and vetted for both character and competence.", "Guns should be permitted on college campuses"], "id": 1226}
{"full_context": ["Those that have committed crimes against society should have that seen when competing fairly for jobs with those who did not commit crimes.", "Jail record should be an employer's first impression"], "id": 1227}
{"full_context": ["In America differing opinions are not only allowed but they have value teaching us to compromise for the best results.", "Comment sections have not failed"], "id": 1228}
{"full_context": ["Justices are not prohibited from speaking about topics of interest to them.", "Supreme court justice can denounce a candidate"], "id": 1229}
{"full_context": ["The Olympics are a dream for many athletes since they train extremely hard.", "Brazil should not postpone Olympics"], "id": 1230}
{"full_context": ["We should be able to speak other languages rather than expect everyone else to speak english.", "Foreign language classes should be mandatory in college"], "id": 1231}
{"full_context": ["Comment sections provide a place for people to have their opinion heard.", "Comment sections have not failed"], "id": 1232}
{"full_context": ["Felons should not be denied their right to vote after paying their debt to society and reentering the community.", "Felons should be allowed to vote"], "id": 1233}
{"full_context": ["She didn't even give the dying aspirin, meanwhile converting them to Catholicism without their knowledge.", "Mother Teresa should not be canonized"], "id": 1234}
{"full_context": ["Comment sections provide a voice to thoughts and ideas outside the scope of regular editorial content.", "Comment sections have not failed"], "id": 1235}
{"full_context": ["Comment sections allow customers to have direct engagement.", "Comment sections have not failed"], "id": 1236}
{"full_context": ["The Orlando gun shooting where 38 gay people were killed are an example of how Christian hate of LGBT people can be comparable to the holocaust.", "Christians have created a harmful atmosphere for gays"], "id": 1237}
{"full_context": ["If the embassy is moved to Jerusalem the Palestinians will know they need to compromise.", "The U.S. Embassy should be moved from Tel Aviv to Jerusalem"], "id": 1238}
{"full_context": ["Comments, with good moderation, are a part of democracy.", "Comment sections have not failed"], "id": 1239}
{"full_context": ["Many professors would refuse to work, they would not condone guns in their classrooms.", "Guns should not be permitted on college campuses"], "id": 1240}
{"full_context": ["They are entitled to the protections of the first amendment.", "Supreme court justice can denounce a candidate"], "id": 1241}
{"full_context": ["The dignity of the Court is lessened.", "Supreme court justice cannot denounce a candidate"], "id": 1242}
{"full_context": ["Comment sections allow customers to have direct engagement.", "Comment sections have not failed"], "id": 1243}
{"full_context": ["I find the idea that it is a sin to be born or live a life at all to be preposterous.", "Christians have created a harmful atmosphere for gays"], "id": 1244}
{"full_context": ["A hijab should not be treated as a fashion statement.", "Non-Muslims hurt women by wearing hijabs"], "id": 1245}
{"full_context": ["Arguments within the comment section are more important than the name of the authors.", "Comment sections have not failed"], "id": 1246}
{"full_context": ["By using information on the medical website, while conferring with my doctor I was able to get a more accurate diagnoses and alleviate personal fears.", "Medical websites are healthful"], "id": 1247}
{"full_context": ["People want to discuss issues rather than be told what to think.", "Comment sections have not failed"], "id": 1248}
{"full_context": ["Nazi Germany is an example of political ideology infecting the judicial system.", "Supreme court justice cannot denounce a candidate"], "id": 1249}
{"full_context": ["It unites the countries of Earth by allowing us to compete against each other.", "Brazil should not postpone Olympics"], "id": 1250}
{"full_context": ["Comment sections allow customers to have direct engagement.", "Comment sections have not failed"], "id": 1251}
{"full_context": ["Obviously they are human and have opinions, but they should not allow those opinions to enter the public forum.", "Supreme court justice cannot denounce a candidate"], "id": 1252}
{"full_context": ["Comment sections have varied and valuable opinions.", "Comment sections have not failed"], "id": 1253}
{"full_context": ["Brazil's problems won't go away if they postpone the Olympics.", "Brazil should not postpone Olympics"], "id": 1254}
{"full_context": ["Words matter and people who think differently should be able to respond.", "Comment sections have not failed"], "id": 1255}
{"full_context": ["Kurdish fighters are also being targeted by ISIS.", "Kurds are allies in Syria"], "id": 1256}
{"full_context": ["Guns are already on college campuses.", "Guns should be permitted on college campuses"], "id": 1257}
{"full_context": ["When there are no moderators and commentators are anonymous, they tend to abuse the privileged of commenting.", "Comment sections have failed"], "id": 1258}
{"full_context": ["While not every person who has served a jail sentence has reformed I believe many realize the wrong they have done and strive to be better.", "Felons should be allowed to vote"], "id": 1259}
{"full_context": ["When comments are moderated, it is appreciated by people like me.", "Comment sections have not failed"], "id": 1260}
{"full_context": ["Hijabs are a disrespectful thing for women.", "Non-Muslims hurt women by wearing hijabs"], "id": 1261}
{"full_context": ["Many editorials are wrong or distorted and their claims are corrected in the comments.", "Comment sections have not failed"], "id": 1262}
{"full_context": ["Erdogan has a history or repressing civil rights and violence.", "Turkey doesn't belong to NATO"], "id": 1263}
{"full_context": ["It is very nice to have the information easily available.", "Medical websites are healthful"], "id": 1264}
{"full_context": ["If we are going to make our own history, sometimes decorum, protocol, and tradition have to be set aside.", "Supreme court justice can denounce a candidate"], "id": 1265}
{"full_context": ["Google is simply a wildly successful American company.", "Google is not a harmful monopoly"], "id": 1266}
{"full_context": ["Felons should be able to have their full citizenship rights restored if they can demonstrate they are a solid citizen.", "Felons should be allowed to vote"], "id": 1267}
{"full_context": ["Public displays of religion make others uncomfortable.", "Non-Muslims hurt women by wearing hijabs"], "id": 1268}
{"full_context": ["There are many treatments that doctors need to learn to help people in pain.", "Opioid training should be mandatory"], "id": 1269}
{"full_context": ["Comment sections are an important place for discussion even if some posters abuse them.", "Comment sections have not failed"], "id": 1270}
{"full_context": ["Well moderated comments can be more interesting and useful than the article.", "Comment sections have not failed"], "id": 1271}
{"full_context": ["If ADHD children were undiagnosed and unmedicated, I do not believe they would succeed in school.", "The A.D.H.D. diagnosis is helping kids"], "id": 1272}
{"full_context": ["Justice Ginsberg knows it is dangerous to remain silent.", "Supreme court justice can denounce a candidate"], "id": 1273}
{"full_context": ["The patients and their family know when there is something wrong even though doctors know a lot.", "Medical websites are healthful"], "id": 1274}
{"full_context": ["There were so many people it was as crowded as being in a shopping mall.", "Overcrowded national parks should have restricted access"], "id": 1275}
{"full_context": ["Comments sections, when unfiltered, will always be vulgar, nasty, and hate-filled.", "Comment sections have failed"], "id": 1276}
{"full_context": ["The creators of google apple and facebook deserve money for their creations, but they are raising the bar too high for competition.", "Google is a harmful monopoly"], "id": 1277}
{"full_context": ["You can't preach freedom while limiting the freedom of others.", "Christians have created a harmful atmosphere for gays"], "id": 1278}
{"full_context": ["Comments sections are full of partisan individuals looking for a fight, not a conversation.", "Comment sections have failed"], "id": 1279}
{"full_context": ["Her charities didn't raise people out of poverty, they remained impoverished.", "Mother Teresa should not be canonized"], "id": 1280}
{"full_context": ["Comments sections are necessary to give a wide variety of opinions.", "Comment sections have not failed"], "id": 1281}
{"full_context": ["Biased reporting is called out in the comment section.", "Comment sections have not failed"], "id": 1282}
{"full_context": ["Prescriptions drugs are more likely to be a gateway drug.", "Marijuana is not a gateway drug"], "id": 1283}
{"full_context": ["Comment sections allow for understanding of other views and reaching a consensus and compromise just like in any democracy.", "Comment sections have not failed"], "id": 1284}
{"full_context": ["There is an epidemic in Brazil.", "Brazil should postpone Olympics"], "id": 1285}
{"full_context": ["People can choose not to use Google.", "Google is not a harmful monopoly"], "id": 1286}
{"full_context": ["Comment sections allow other views to be heard.", "Comment sections have not failed"], "id": 1287}
{"full_context": ["Comment sections have devolved into anonymous school yard bullying, offering no debate or discussion.", "Comment sections have failed"], "id": 1288}
{"full_context": ["The comments are in being manufactured in favor of HC to control the election.", "Comment sections have failed"], "id": 1289}
{"full_context": ["Hijabs are a sexist garment and should not be used as a symbol for anything.", "Non-Muslims hurt women by wearing hijabs"], "id": 1290}
{"full_context": ["Muslim countries arrest or execute gays.", "Christians have not created a harmful atmosphere for gays"], "id": 1291}
{"full_context": ["This move will not solve anything and will lead to Palestinian violence.", "The U.S. Embassy should not be moved from Tel Aviv to Jerusalem"], "id": 1292}
{"full_context": ["College students have the best chance of knowing history.", "College students' votes do matter in an election"], "id": 1293}
{"full_context": ["Turkey's poor record on human rights should not be a NATO member as it does not follow the principle's of NATO.", "Turkey doesn't belong to NATO"], "id": 1294}
{"full_context": ["Sometimes the threat to American values justifies speaking out.", "Supreme court justice can denounce a candidate"], "id": 1295}
{"full_context": ["Too many people would prefer to push individuals with a criminal record of over the proverbial edge instead of giving them a helping hand", "Jail record should not be an employer's first impression"], "id": 1296}
{"full_context": ["People can learn a lot from reading the comments.", "Comment sections have not failed"], "id": 1297}
{"full_context": ["I recently stopped contributing to the comment section of my local newspaper.", "Comment sections have failed"], "id": 1298}
{"full_context": ["Although they are human, justices must make every effort to remain unbiased.", "Supreme court justice cannot denounce a candidate"], "id": 1299}
{"full_context": ["Comments from individuals and their viewpoints has brought new insight to topics.", "Comment sections have not failed"], "id": 1300}
{"full_context": ["There are many treatments that doctors need to learn to help people in pain.", "Opioid training should be mandatory"], "id": 1301}
{"full_context": ["Moving the embassy will tough things off in the world.", "The U.S. Embassy should not be moved from Tel Aviv to Jerusalem"], "id": 1302}
{"full_context": ["It is important for Americans to hear the opinions of Supreme Court Justices on political events.", "Supreme court justice can denounce a candidate"], "id": 1303}
{"full_context": ["Education and employment would become more important for felons if they could vote.", "Felons should be allowed to vote"], "id": 1304}
{"full_context": ["Learning a language allows you to assimilate a culture in a way not possible by other methods.", "Foreign language classes should be mandatory in college"], "id": 1305}
{"full_context": ["She didn't even give the dying aspirin, meanwhile converting them to Catholicism without their knowledge.", "Mother Teresa should not be canonized"], "id": 1306}
{"full_context": ["There are cases where internet research on medical websites improved condition or saved lives.", "Medical websites are healthful"], "id": 1307}
{"full_context": ["They provide other peoples perspectives on topics.", "Comment sections have not failed"], "id": 1308}
{"full_context": ["Comment sections allow other views to be heard.", "Comment sections have not failed"], "id": 1309}
{"full_context": ["I enjoy the NYT comments.", "Comment sections have not failed"], "id": 1310}
{"full_context": ["The media is biased, and comment sections can help one understand what is really going on.", "Comment sections have not failed"], "id": 1311}
{"full_context": ["Comment sections provide an avenue for unwanted hassle and even interaction with so-called \"nuts.\"", "Comment sections have failed"], "id": 1312}
{"full_context": ["Many people can smoke marijuana heavily, and quit without a problem.", "Marijuana is not a gateway drug"], "id": 1313}
{"full_context": ["Taking a cue from the success of the Swiss and Dutch healthcare models proves Obamacare can work, too.", "Obamacare is sustainable"], "id": 1314}
{"full_context": ["It is good to be informed about your health.", "Medical websites are healthful"], "id": 1315}
{"full_context": ["Obviously they are human and have opinions, but they should not allow those opinions to enter the public forum.", "Supreme court justice cannot denounce a candidate"], "id": 1316}
{"full_context": ["Comments give new perspectives and context to stories.", "Comment sections have not failed"], "id": 1317}
{"full_context": ["Publicly funded education would cost society too much.", "College should not be free"], "id": 1318}
{"full_context": ["Comment sections provide a voice to thoughts and ideas outside the scope of regular editorial content.", "Comment sections have not failed"], "id": 1319}
{"full_context": ["Turkey does not have much in common with the rest of the countries in NATO.", "Turkey doesn't belong to NATO"], "id": 1320}
{"full_context": ["It is often educational to read commentors' opinions.", "Comment sections have not failed"], "id": 1321}
{"full_context": ["A search on a medical site could get early treatment.", "Medical websites are healthful"], "id": 1322}
{"full_context": ["We are able to take into consideration all views and come to a compromise.", "Comment sections have not failed"], "id": 1323}
{"full_context": ["Attending the Olympics will risk the health of participants and fans as well as their families and entire countries.", "Brazil should postpone Olympics"], "id": 1324}
{"full_context": ["Turkey practices a different leaning ideology than other nearby countries in NATO.", "Turkey doesn't belong to NATO"], "id": 1325}
{"full_context": ["Denying LGBT rights based on religious beliefs is not acceptable from a civil rights perspective.", "Christians have created a harmful atmosphere for gays"], "id": 1326}
{"full_context": ["Although they are human, justices must make every effort to remain unbiased.", "Supreme court justice cannot denounce a candidate"], "id": 1327}
{"full_context": ["Justice Ginsberg's comments shows an important intelligent person sees Trump as dangerous.", "Supreme court justice can denounce a candidate"], "id": 1328}
{"full_context": ["We need to empower all US citizens to participate in our democracy, to create the more equal and fair society.", "Felons should be allowed to vote"], "id": 1329}
{"full_context": ["Comment sections permit opposing sides to see and understand the other side of a debate.", "Comment sections have not failed"], "id": 1330}
{"full_context": ["We should close churches that are spewing hate on a tax free basis, just as we close mosques that preach love of ISIS.", "Christians have created a harmful atmosphere for gays"], "id": 1331}
{"full_context": ["Comment sections allow other views to be heard.", "Comment sections have not failed"], "id": 1332}
{"full_context": ["Patients know their body, but have limited doctor access.", "Medical websites are healthful"], "id": 1333}
{"full_context": ["Comment sections add value to an editorial or commentary; the lack of comments earns the item less respect from the reader.", "Comment sections have not failed"], "id": 1334}
{"full_context": ["They expose important points often left out by the author.", "Comment sections have not failed"], "id": 1335}
{"full_context": ["Internet can help with diagnosis.", "Medical websites are healthful"], "id": 1336}
{"full_context": ["If the embassy is moved to Jerusalem the Palestinians will know they need to compromise.", "The U.S. Embassy should be moved from Tel Aviv to Jerusalem"], "id": 1337}
{"full_context": ["Anti-gayness is an antiquated view that is taught by various religions and only serves to keep people divided by ignorance.", "Christians have created a harmful atmosphere for gays"], "id": 1338}
{"full_context": ["It unites the countries of Earth by allowing us to compete against each other.", "Brazil should not postpone Olympics"], "id": 1339}
{"full_context": ["Iran intends to kill every non-shia believer.", "Iran remains a threat"], "id": 1340}
{"full_context": ["Air travel is a service that should be available and accountable to all citizens.", "Government should regulate airline industry again"], "id": 1341}
{"full_context": ["Comments section enable the democratic discussion of ideas.", "Comment sections have not failed"], "id": 1342}
{"full_context": ["You can't go to the doctor for every little thing so websites help figure out when you need to call the doctor.", "Medical websites are healthful"], "id": 1343}
{"full_context": ["Too many people in powerful positions are turning a blind eye to Donald Trump and his actions.", "Supreme court justice can denounce a candidate"], "id": 1344}
{"full_context": ["The swimmers shouldn't have to swim in toxic water.", "Brazil should postpone Olympics"], "id": 1345}
{"full_context": ["Many editorials are wrong or distorted and their claims are corrected in the comments.", "Comment sections have not failed"], "id": 1346}
{"full_context": ["Even thinking about allowing guns on campus is deranged and shows that our society is not as civilized as we think.", "Guns should not be permitted on college campuses"], "id": 1347}
{"full_context": ["Diagnoses allowed teachers to provide enrichment lessons for the child instead of being disrupted by the child's inattention.", "The A.D.H.D. diagnosis is helping kids"], "id": 1348}
{"full_context": ["Other countries invest in their youth's education, why can't we?", "College should be free"], "id": 1349}
{"full_context": ["Comment sections devolve into insults and demagoguery.", "Comment sections have failed"], "id": 1350}
{"full_context": ["Comment sections are just a propaganda device.", "Comment sections have failed"], "id": 1351}
{"full_context": ["The comment sections help me get an idea of how others feel about the articles.", "Comment sections have not failed"], "id": 1352}
{"full_context": ["Reforming medicare would cause senior citizens to have to make decision, which they find increasingly difficult to do as they age.", "Medicare doesn't need to be reformed"], "id": 1353}
{"full_context": ["Comments sections are useful, they provide a way for people to speak their minds.", "Comment sections have not failed"], "id": 1354}
{"full_context": ["A person who stole a car at 17 should not be barred from being a full citizen for life.", "Felons should be allowed to vote"], "id": 1355}
{"full_context": ["If marijuana led to other drug use many more people would have serious drug addictions.", "Marijuana is not a gateway drug"], "id": 1356}
{"full_context": ["Often times, I gain important insight and knowledge from the comment section.", "Comment sections have not failed"], "id": 1357}
{"full_context": ["Addiction is a result of a personality trait and the symptoms of that trait are drug abuse.", "Marijuana is not a gateway drug"], "id": 1358}
{"full_context": ["The way Iran conducts itself shows they are weak.", "Iran doesn't remain a threat"], "id": 1359}
{"full_context": ["Attending the Olympics will risk the health of participants and fans as well as their families and entire countries.", "Brazil should postpone Olympics"], "id": 1360}
{"full_context": ["Airlines have become just as greedy as health care insurers and providers.", "Government should regulate airline industry again"], "id": 1361}
{"full_context": ["Comment sections devolve into insults and demagoguery.", "Comment sections have failed"], "id": 1362}
{"full_context": ["Iran's nuclear capabilities is a cause for worry.", "Iran remains a threat"], "id": 1363}
{"full_context": ["Comment sections reveal important insights into people's thoughts and abuse can be countered by other comments.", "Comment sections have not failed"], "id": 1364}
{"full_context": ["I was able to do considerable research on the cancer I was diagnosed with on my own, and my oncologist respected my knowledge and worked with me.", "Medical websites are healthful"], "id": 1365}
{"full_context": ["We need to empower all US citizens to participate in our democracy, to create the more equal and fair society.", "Felons should be allowed to vote"], "id": 1366}
{"full_context": ["College students constant questioning of everything lead them to not be swayed by lies and promises.", "College students' votes do matter in an election"], "id": 1367}
{"full_context": ["Iran has a religious dictatorship.", "Iran remains a threat"], "id": 1368}
{"full_context": ["If marijuana led to other drug use many more people would have serious drug addictions.", "Marijuana is not a gateway drug"], "id": 1369}
{"full_context": ["There is nothing to prohibit their speech.", "Supreme court justice can denounce a candidate"], "id": 1370}
{"full_context": ["Offensive and low quality comments make high quality commentators leave if the website doesn't work to protect their comments section.", "Comment sections have failed"], "id": 1371}
{"full_context": ["Addiction is a result of a personality trait and the symptoms of that trait are drug abuse.", "Marijuana is not a gateway drug"], "id": 1372}
{"full_context": ["Some comments sections, like the NY Times, are well moderated and full of intellectual, thoughtful comments.", "Comment sections have not failed"], "id": 1373}
{"full_context": ["People learn a lot from comment sections.", "Comment sections have not failed"], "id": 1374}
{"full_context": ["A small group choose to interpret the Old Testament in its literal word that drive a harmful message.", "Christians have created a harmful atmosphere for gays"], "id": 1375}
{"full_context": ["Moderated comments are a great way for unlikely sources to have their opinions heard.", "Comment sections have not failed"], "id": 1376}
{"full_context": ["I wouldn't know about my illness without medical websites.", "Medical websites are healthful"], "id": 1377}
{"full_context": ["They want to take advantage of higher tuitions paid by foreign and out of state students.", "Public universities are neglecting in-state students"], "id": 1378}
{"full_context": ["We need to empower all US citizens to participate in our democracy, to create the more equal and fair society.", "Felons should be allowed to vote"], "id": 1379}
{"full_context": ["This move will not solve anything and will lead to Palestinian violence.", "The U.S. Embassy should not be moved from Tel Aviv to Jerusalem"], "id": 1380}
{"full_context": ["Most users of prescription opioids for non-medical reasons don't end up using heroin, even though many heroin users have used opioids.", "Marijuana is not a gateway drug"], "id": 1381}
{"full_context": ["Some church's have gay employees and members.", "Christians have not created a harmful atmosphere for gays"], "id": 1382}
{"full_context": ["Comment sections complete incomplete articles even if the authors don't agree, it makes them better journalists.", "Comment sections have not failed"], "id": 1383}
{"full_context": ["Some comments sections, like the NY Times, are well moderated and full of intellectual, thoughtful comments.", "Comment sections have not failed"], "id": 1384}
{"full_context": ["Prescriptions drugs are more likely to be a gateway drug.", "Marijuana is not a gateway drug"], "id": 1385}
{"full_context": ["If Ryan cant prove Medicare expenses are too much for the country then it needs to be expanded to all ages and paid for by health insurance companies which would close their bushiness instead.", "Medicare needs to be reformed"], "id": 1386}
{"full_context": ["Comment sections can bring in more readers if the author addressed different reactions to columns.", "Comment sections have not failed"], "id": 1387}
{"full_context": ["Healthcare costs will rise until it gets reconstructed.", "Medicare needs to be reformed"], "id": 1388}
{"full_context": ["If college were free it would take help from the poor and help the rich.", "College should not be free"], "id": 1389}
{"full_context": ["It is hard for an adult to learn a second language.", "Foreign language classes should not be mandatory in college"], "id": 1390}
{"full_context": ["Since doctors are responsible for the issue, they should help address it.", "Opioid training should be mandatory"], "id": 1391}
{"full_context": ["People want to discuss issues rather than be told what to think.", "Comment sections have not failed"], "id": 1392}
{"full_context": ["Comments are often better than the article itself.", "Comment sections have not failed"], "id": 1393}
{"full_context": ["Education is very important and should be funded with tax money.", "College should be free"], "id": 1394}
{"full_context": ["Google is simply a wildly successful American company.", "Google is not a harmful monopoly"], "id": 1395}
{"full_context": ["Allowing felons to vote would help wrongful convictions get proper attention from government.", "Felons should be allowed to vote"], "id": 1396}
{"full_context": ["The Supreme Court Justice recognized Trump's harmful energies and felt it was a time when there was a moral imperative to resist evil.", "Supreme court justice can denounce a candidate"], "id": 1397}
{"full_context": ["Comment sections provide different views on opinion pieces.", "Comment sections have not failed"], "id": 1398}
{"full_context": ["There are many treatments that doctors need to learn to help people in pain.", "Opioid training should be mandatory"], "id": 1399}
{"full_context": ["There is no scientific evidence that marijuana is the most dangerous drug.", "Marijuana is not a gateway drug"], "id": 1400}
{"full_context": ["With good moderation, useful and interesting discussions can be had.", "Comment sections have not failed"], "id": 1401}
{"full_context": ["Radical Islam not Christianity lead to the night club massacre.", "Christians have not created a harmful atmosphere for gays"], "id": 1402}
{"full_context": ["Well moderated comments can be more interesting and useful than the article.", "Comment sections have not failed"], "id": 1403}
{"full_context": ["The commentators are often more knowledgeable than the journalists.", "Comment sections have not failed"], "id": 1404}
{"full_context": ["Ginsburg is a US citizen with the right to speak her mind.", "Supreme court justice can denounce a candidate"], "id": 1405}
{"full_context": ["Public University accept out of state students so they can get more money.", "Public universities are neglecting in-state students"], "id": 1406}
{"full_context": ["They are an expensive bit of extra work with no true purpose.", "Foreign language classes should not be mandatory in college"], "id": 1407}
{"full_context": ["Comment sections provide a voice to thoughts and ideas outside the scope of regular editorial content.", "Comment sections have not failed"], "id": 1408}
{"full_context": ["When religious people say gay people don't deserve equality they aren't valuing gay people as humans or citizens.", "Christians have created a harmful atmosphere for gays"], "id": 1409}
{"full_context": ["Iran is not in the game just for today, but has long- term goals and plans. A major weakness of the nuclear agreement signed with Iran, which guarantees Iran a free nuclear hand in a decade or so.", "Iran remains a threat"], "id": 1410}
{"full_context": ["People do not show respect in comments sections, which takes away from their value.", "Comment sections have failed"], "id": 1411}
{"full_context": ["Christians create problems and people make the excuse they don't represent the majority.", "Christians have created a harmful atmosphere for gays"], "id": 1412}
{"full_context": ["Ginsburg's comments on Trump's fitness to hold office are well within etiquette.", "Supreme court justice can denounce a candidate"], "id": 1413}
{"full_context": ["Guns kill people.", "Guns should not be permitted on college campuses"], "id": 1414}
{"full_context": ["I don't think I absorb horrible ideas by reading them.", "Comment sections have not failed"], "id": 1415}
{"full_context": ["Justice Ginsberg's comments shows an important intelligent person sees Trump as dangerous.", "Supreme court justice can denounce a candidate"], "id": 1416}
{"full_context": ["Air travel, like other travel, should be copiously regulated.", "Government should regulate airline industry again"], "id": 1417}
{"full_context": ["Opioid training will help stop lazy doctors from over prescribing for pain.", "Opioid training should be mandatory"], "id": 1418}
{"full_context": ["Some comments sections, like the NY Times, are well moderated and full of intellectual, thoughtful comments.", "Comment sections have not failed"], "id": 1419}
{"full_context": ["Free speech is easily abused in non productive ways.", "Comment sections have failed"], "id": 1420}
{"full_context": ["Most people who try drugs do not become regular users.", "Marijuana is not a gateway drug"], "id": 1421}
{"full_context": ["If Ryan cant prove Medicare expenses are too much for the country then it needs to be expanded to all ages and paid for by health insurance companies which would close their bushiness instead.", "Medicare needs to be reformed"], "id": 1422}
{"full_context": ["Doctors gave me Hydrocodone that I didn't need after a back operation.", "Opioid training should be mandatory"], "id": 1423}
{"full_context": ["Dreher's antics prove Christians don't want peace with the LGBT community which wants to live under laws of democracy not religious dogma.", "Christians have created a harmful atmosphere for gays"], "id": 1424}
{"full_context": ["The use of a neutral appointment to denounce a political candidate is the real threat to the system.", "Supreme court justice cannot denounce a candidate"], "id": 1425}
{"full_context": ["Comments allow those with other knowledge to act as a balance and fact check the article.", "Comment sections have not failed"], "id": 1426}
{"full_context": ["Doctors need to be held to nationwide educational standards to get and keep their licenses.", "Opioid training should be mandatory"], "id": 1427}
{"full_context": ["Many felons are not actually guilty and many guilty are not caught.", "Felons should be allowed to vote"], "id": 1428}
{"full_context": ["Doctors need to be held to nationwide educational standards to get and keep their licenses.", "Opioid training should be mandatory"], "id": 1429}
{"full_context": ["With good moderation, useful and interesting discussions can be had.", "Comment sections have not failed"], "id": 1430}
{"full_context": ["Comment sections provide different views on opinion pieces.", "Comment sections have not failed"], "id": 1431}
{"full_context": ["Felons should not lose their rights, for even a day.", "Felons should be allowed to vote"], "id": 1432}
{"full_context": ["Health care is a market failure, even if Health Insurance is still barely functioning.", "Obamacare is not sustainable"], "id": 1433}
{"full_context": ["If the ADHD children were undiagnosed and unmedicated, I do not believe they would succeed in school.", "The A.D.H.D. diagnosis is helping kids"], "id": 1434}
{"full_context": ["She had a Munchausen complex that made her use their deaths to aid in her spirituality.", "Mother Teresa should not be canonized"], "id": 1435}
{"full_context": ["If marijuana led to other drug use many more people would have serious drug addictions.", "Marijuana is not a gateway drug"], "id": 1436}
{"full_context": ["Comments, when moderated, provide value to readers.", "Comment sections have not failed"], "id": 1437}
{"full_context": ["Christianity has helped make legislation that protects gays.", "Christians have not created a harmful atmosphere for gays"], "id": 1438}
{"full_context": ["Comments sections become illegitimized by inappropriate commenters.", "Comment sections have failed"], "id": 1439}
{"full_context": ["Israel knows Iran doesn't have the money or desire to take on a large army.", "Iran doesn't remain a threat"], "id": 1440}
{"full_context": ["Comment sections are an important place for discussion even if some posters abuse them.", "Comment sections have not failed"], "id": 1441}
{"full_context": ["Comment sections have devolved into anonymous school yard bullying, offering no debate or discussion.", "Comment sections have failed"], "id": 1442}
{"full_context": ["More guns will not provide more safety.", "Guns should not be permitted on college campuses"], "id": 1443}
{"full_context": ["I turned to the internet when my husband was diagnosed with late stage aggressive prostate cancer 13 years ago.", "Medical websites are healthful"], "id": 1444}
{"full_context": ["It is not a justice's job to state their political views, it is simply to enforce the law.", "Supreme court justice cannot denounce a candidate"], "id": 1445}
{"full_context": ["The Bible is not consistent in it's treatment of sex and marriage.", "Christians have created a harmful atmosphere for gays"], "id": 1446}
{"full_context": ["Free public education undermines private alternatives.", "College should not be free"], "id": 1447}
{"full_context": ["Teenagers may not have the best capacity for well thought out decisions and should not have free access to guns.", "Guns should not be permitted on college campuses"], "id": 1448}
{"full_context": ["Insurance companies should not be governed by government policies.", "Obamacare is not sustainable"], "id": 1449}
{"full_context": ["Moderated comment sections, such as those in the New York Times, are free of the typical abuse and invective often found elsewhere.", "Comment sections have not failed"], "id": 1450}
{"full_context": ["Education is very important and should be funded with tax money.", "College should be free"], "id": 1451}
{"full_context": ["From a health standpoint, it is too risky to go to the Olympics.", "Brazil should postpone Olympics"], "id": 1452}
{"full_context": ["A search on a medical site could get early treatment.", "Medical websites are healthful"], "id": 1453}
{"full_context": ["It is not a justice's job to state their political views, it is simply to enforce the law.", "Supreme court justice cannot denounce a candidate"], "id": 1454}
{"full_context": ["Comments allow those with other knowledge to act as a balance and fact check the article.", "Comment sections have not failed"], "id": 1455}
{"full_context": ["The Supreme Court justice position is set apart from politics, and thus justices should not participate in politics.", "Supreme court justice cannot denounce a candidate"], "id": 1456}
{"full_context": ["By using information on the medical website, while conferring with my doctor I was able to get a more accurate diagnoses and alleviate personal fears.", "Medical websites are healthful"], "id": 1457}
{"full_context": ["Comments often show mindless vitriol and verbal violence.", "Comment sections have failed"], "id": 1458}
{"full_context": ["Comments add interest and spark discussion.", "Comment sections have not failed"], "id": 1459}
{"full_context": ["Milk isn't a gateway drug even though most people drink it as children.", "Marijuana is not a gateway drug"], "id": 1460}
{"full_context": ["Education is very important and should be funded with tax money.", "College should be free"], "id": 1461}
{"full_context": ["Prescription drugs are the real gateway drugs, as they are dangerous and lead to increased heroin addiction and death by overdose.", "Marijuana is not a gateway drug"], "id": 1462}
{"full_context": ["Christians feel homosexuality is immoral.", "Christians have created a harmful atmosphere for gays"], "id": 1463}
{"full_context": ["College students constant questioning of everything lead them to not be swayed by lies and promises.", "College students' votes do matter in an election"], "id": 1464}
{"full_context": ["Learning a language allows you to assimilate a culture in a way not possible by other methods.", "Foreign language classes should be mandatory in college"], "id": 1465}
{"full_context": ["Mother Teresa's work was more about indulging the pain and suffering of the poor for \"their own good.\"", "Mother Teresa should not be canonized"], "id": 1466}
{"full_context": ["I was able to do considerable research on the cancer I was diagnosed with on my own, and my oncologist respected my knowledge and worked with me.", "Medical websites are healthful"], "id": 1467}
{"full_context": ["Comment sections with good comments help me see different views.", "Comment sections have not failed"], "id": 1468}
{"full_context": ["The Supreme Court Justice recognized Trump's harmful energies and felt it was a time when there was a moral imperative to resist evil.", "Supreme court justice can denounce a candidate"], "id": 1469}
{"full_context": ["They provide other peoples perspectives on topics.", "Comment sections have not failed"], "id": 1470}
{"full_context": ["The safety and health of the participants are at risk.", "Brazil should postpone Olympics"], "id": 1471}
{"full_context": ["Well known leaders of the Christian community have been very outspoke and vile about members of the LGBT community.", "Christians have created a harmful atmosphere for gays"], "id": 1472}
{"full_context": ["A small group choose to interpret the Old Testament in its literal word that drive a harmful message.", "Christians have created a harmful atmosphere for gays"], "id": 1473}
{"full_context": ["If the Trump presidency begins to turn into a fascist dictatorship, then the justices of the Court will need to speak out.", "Supreme court justice can denounce a candidate"], "id": 1474}
{"full_context": ["Comment sections provide divergent opinions and different world views.", "Comment sections have not failed"], "id": 1475}
{"full_context": ["Young people influenced the Massachusetts Democrat Primary, for example.", "College students' votes do matter in an election"], "id": 1476}
{"full_context": ["There are anonymous people posing as real journalists with no oversight or peer review.", "Facebook is ruining journalism"], "id": 1477}
{"full_context": ["Comment sections are just a propaganda device.", "Comment sections have failed"], "id": 1478}
{"full_context": ["The reading public can use comments sections to voice their opinion on media.", "Comment sections have not failed"], "id": 1479}
{"full_context": ["Monopolies are not good for the market.", "Google is a harmful monopoly"], "id": 1480}
{"full_context": ["There are cases where internet research on medical websites improved condition or saved lives.", "Medical websites are healthful"], "id": 1481}
{"full_context": ["The risk of Zika outbreak is not worth holding the Olympics.", "Brazil should postpone Olympics"], "id": 1482}
{"full_context": ["Defining marriage as between a man and woman is mean and cruel to those who may be of the same sex and love each other.", "Christians have created a harmful atmosphere for gays"], "id": 1483}
{"full_context": ["Comments sections become illegitimized by inappropriate commenters.", "Comment sections have failed"], "id": 1484}
{"full_context": ["Mother Teresa's work was more about indulging the pain and suffering of the poor for \"their own good.\"", "Mother Teresa should not be canonized"], "id": 1485}
{"full_context": ["Denying LGBT rights based on religious beliefs is not acceptable from a civil rights perspective.", "Christians have created a harmful atmosphere for gays"], "id": 1486}
{"full_context": ["Justice Ginsburg has a good grasp on US history, and should be allowed to voice her opinion in a presidential election.", "Supreme court justice can denounce a candidate"], "id": 1487}
{"full_context": ["I don't think I absorb horrible ideas by reading them.", "Comment sections have not failed"], "id": 1488}
{"full_context": ["The NY Times comments remind of the good and decent people in the world who speak out where there is a lot of bleak news elsewhere.", "Comment sections have not failed"], "id": 1489}
{"full_context": ["Addiction is a result of a personality trait and the symptoms of that trait are drug abuse.", "Marijuana is not a gateway drug"], "id": 1490}
{"full_context": ["I need the comments to trust the reporting in the article.", "Comment sections have not failed"], "id": 1491}
{"full_context": ["Engagement in the comment section is valuable to the organization.", "Comment sections have not failed"], "id": 1492}
{"full_context": ["Finding one gem in the comments section is worth all of the other problems.", "Comment sections have not failed"], "id": 1493}
{"full_context": ["The justices are allowed their opinions.", "Supreme court justice can denounce a candidate"], "id": 1494}
{"full_context": ["An imaginary line around a college campus will not suddenly change people who are not a public danger outside the line.", "Guns should be permitted on college campuses"], "id": 1495}
{"full_context": ["Anti-gayness is an antiquated view that is taught by various religions and only serves to keep people divided by ignorance.", "Christians have created a harmful atmosphere for gays"], "id": 1496}
{"full_context": ["This control of women is horrendous.", "Non-Muslims hurt women by wearing hijabs"], "id": 1497}
{"full_context": ["The swimmers shouldn't have to swim in toxic water.", "Brazil should postpone Olympics"], "id": 1498}
{"full_context": ["College students constant questioning of everything lead them to not be swayed by lies and promises.", "College students' votes do matter in an election"], "id": 1499}
{"full_context": ["Ginsburg is a US citizen with the right to speak her mind.", "Supreme court justice can denounce a candidate"], "id": 1500}
{"full_context": ["Airlines are not a free market industry", "Government should regulate airline industry again"], "id": 1501}
{"full_context": ["She accepted contributions to her cause from dictators and torturers and in exchange enhanced their images.", "Mother Teresa should not be canonized"], "id": 1502}
{"full_context": ["Christian congressman Rick Allen advocating for death is harmful to gays.", "Christians have created a harmful atmosphere for gays"], "id": 1503}
{"full_context": ["People who care about spending time in these places should be willing to make early reservations for the crowded ones.", "Overcrowded national parks should have restricted access"], "id": 1504}
{"full_context": ["At some point in everyone's lives they are faced with making the choice to speak up or live with what happens from their silence.", "Supreme court justice can denounce a candidate"], "id": 1505}
{"full_context": ["The reading public can use comments sections to voice their opinion on media.", "Comment sections have not failed"], "id": 1506}
{"full_context": ["Comments give new perspectives and context to stories.", "Comment sections have not failed"], "id": 1507}
{"full_context": ["Rather than reforming Medicare, it would make more sense to lower healthcare costs by holding providers accountable for treatment.", "Medicare doesn't need to be reformed"], "id": 1508}
{"full_context": ["Often times, I gain important insight and knowledge from the comment section.", "Comment sections have not failed"], "id": 1509}
{"full_context": ["If felons are not allowed to vote, it causes society to ignore issues that pertain to prison populations.", "Felons should be allowed to vote"], "id": 1510}
{"full_context": ["The justices are allowed their opinions.", "Supreme court justice can denounce a candidate"], "id": 1511}
{"full_context": ["If you look to a \"holy\" book written long, long ago and betraying its human origins on every page. Inevitably be in constant conflict with social progress, and reality.", "Christians have created a harmful atmosphere for gays"], "id": 1512}
{"full_context": ["Comment sections give value by showing the feelings of the community.", "Comment sections have not failed"], "id": 1513}
{"full_context": ["Ginsburg's comments on Trump's fitness to hold office are well within etiquette.", "Supreme court justice can denounce a candidate"], "id": 1514}
{"full_context": ["Moderated comment sections, such as those in the New York Times, are free of the typical abuse and invective often found elsewhere.", "Comment sections have not failed"], "id": 1515}
{"full_context": ["Comment sections can bring in more readers if the author addressed different reactions to columns.", "Comment sections have not failed"], "id": 1516}
{"full_context": ["Muslim countries arrest or execute gays.", "Christians have not created a harmful atmosphere for gays"], "id": 1517}
{"full_context": ["Not doing your own research can be hazardous to your health.", "Medical websites are healthful"], "id": 1518}
{"full_context": ["Public University accept out of state students so they can get more money.", "Public universities are neglecting in-state students"], "id": 1519}
{"full_context": ["People cannot have educated debates, rather they name call and insult in comment sections.", "Comment sections have failed"], "id": 1520}
{"full_context": ["Google is simply a wildly successful American company.", "Google is not a harmful monopoly"], "id": 1521}
{"full_context": ["The NY Times comments remind of the good and decent people in the world who speak out where there is a lot of bleak news elsewhere.", "Comment sections have not failed"], "id": 1522}
{"full_context": ["Dreher's antics prove Christians don't want peace with the LGBT community which wants to live under laws of democracy not religious dogma.", "Christians have created a harmful atmosphere for gays"], "id": 1523}
{"full_context": ["The costs of it are relatively low.", "Medicare doesn't need to be reformed"], "id": 1524}
{"full_context": ["Allowing felons to vote would help wrongful convictions get proper attention from government.", "Felons should be allowed to vote"], "id": 1525}
{"full_context": ["Christians feel homosexuality is immoral.", "Christians have created a harmful atmosphere for gays"], "id": 1526}
{"full_context": ["The internet can be supplementary to meeting with a physician.", "Medical websites are healthful"], "id": 1527}
{"full_context": ["Erdogan has a history or repressing civil rights and violence.", "Turkey doesn't belong to NATO"], "id": 1528}
{"full_context": ["When activists try to be politicians it is clear they are only pursuing their own narrow objectives and visions, just to stroke their own ego.", "Activists cannot be politicians"], "id": 1529}
{"full_context": ["There are a lot of Chinese students in US universities.", "Public universities are neglecting in-state students"], "id": 1530}
{"full_context": ["Moving the U.S. embassy will tell Muslims that Israel will never accept a two-state fix and more war will ensue.", "The U.S. Embassy should not be moved from Tel Aviv to Jerusalem"], "id": 1531}
{"full_context": ["Taking a cue from the success of the Swiss and Dutch healthcare models proves Obamacare can work, too.", "Obamacare is sustainable"], "id": 1532}
{"full_context": ["The justices are allowed their opinions.", "Supreme court justice can denounce a candidate"], "id": 1533}
{"full_context": ["They can not be cheated through like most other classes.", "Foreign language classes should be mandatory in college"], "id": 1534}
{"full_context": ["A small group choose to interpret the Old Testament in its literal word that drive a harmful message.", "Christians have created a harmful atmosphere for gays"], "id": 1535}
{"full_context": ["Comment sections provide different views on opinion pieces.", "Comment sections have not failed"], "id": 1536}
{"full_context": ["Iran is not in the game just for today, but has long- term goals and plans. A major weakness of the nuclear agreement signed with Iran, which guarantees Iran a free nuclear hand in a decade or so.", "Iran remains a threat"], "id": 1537}
{"full_context": ["Comments sections are full of partisan individuals looking for a fight, not a conversation.", "Comment sections have failed"], "id": 1538}
{"full_context": ["There are many treatments that doctors need to learn to help people in pain.", "Opioid training should be mandatory"], "id": 1539}
{"full_context": ["Public University accept out of state students so they can get more money.", "Public universities are neglecting in-state students"], "id": 1540}
{"full_context": ["Christian congressman Rick Allen advocating for death is harmful to gays.", "Christians have created a harmful atmosphere for gays"], "id": 1541}
{"full_context": ["We are able to take into consideration all views and come to a compromise.", "Comment sections have not failed"], "id": 1542}
{"full_context": ["Supreme Court Justices should be allowed to voice their opinion in extreme cases.", "Supreme court justice can denounce a candidate"], "id": 1543}
{"full_context": ["They want to take advantage of higher tuitions paid by foreign and out of state students.", "Public universities are neglecting in-state students"], "id": 1544}
{"full_context": ["Too many people in powerful positions are turning a blind eye to Donald Trump and his actions.", "Supreme court justice can denounce a candidate"], "id": 1545}
{"full_context": ["With good moderation, useful and interesting discussions can be had.", "Comment sections have not failed"], "id": 1546}
{"full_context": ["People can learn a lot from reading the comments.", "Comment sections have not failed"], "id": 1547}
{"full_context": ["Cannabis is safer than alcohol and does not lead to addiction.", "Marijuana is not a gateway drug"], "id": 1548}
{"full_context": ["Comment sections with good comments help me see different views.", "Comment sections have not failed"], "id": 1549}
{"full_context": ["Patients know their body, but have limited doctor access.", "Medical websites are healthful"], "id": 1550}
{"full_context": ["When comments are moderated, it is appreciated by people like me.", "Comment sections have not failed"], "id": 1551}
{"full_context": ["Public displays of religion make others uncomfortable.", "Non-Muslims hurt women by wearing hijabs"], "id": 1552}
{"full_context": ["Turkey does not have much in common with the rest of the countries in NATO.", "Turkey doesn't belong to NATO"], "id": 1553}
{"full_context": ["The costs of it are relatively low.", "Medicare doesn't need to be reformed"], "id": 1554}
{"full_context": ["There is nothing to prohibit their speech.", "Supreme court justice can denounce a candidate"], "id": 1555}
{"full_context": ["When religious people say gay people don't deserve equality they aren't valuing gay people as humans or citizens.", "Christians have created a harmful atmosphere for gays"], "id": 1556}
{"full_context": ["I would be happy to support free community college so those who can't afford it can get educated.", "College should be free"], "id": 1557}
{"full_context": ["Church's are still the most segregated aspect of our society", "Christians have created a harmful atmosphere for gays"], "id": 1558}
{"full_context": ["The UC system admits far fewer CA high school students than it was designed to.", "Public universities are neglecting in-state students"], "id": 1559}
{"full_context": ["Justice Ginsberg's should make her opinion know to American people.", "Supreme court justice can denounce a candidate"], "id": 1560}
{"full_context": ["There needs to be some sort of vetting process for advertisers, some of them attempt to scam the elderly.", "Medicare needs to be reformed"], "id": 1561}
{"full_context": ["Despite small scale conflict, children no longer have to hide under their desks or wonder whether a siren means bombers are on the way.", "The world is becoming safer"], "id": 1562}
{"full_context": ["Iran is not in the game just for today, but has long- term goals and plans. A major weakness of the nuclear agreement signed with Iran, which guarantees Iran a free nuclear hand in a decade or so.", "Iran remains a threat"], "id": 1563}
{"full_context": ["It is better that justices speak openly about their opinions rather than hiding them in their legal statements.", "Supreme court justice can denounce a candidate"], "id": 1564}
{"full_context": ["I turned to the internet when my husband was diagnosed with late stage aggressive prostate cancer 13 years ago.", "Medical websites are healthful"], "id": 1565}
{"full_context": ["Being a judge doesn't take away their right to vote and their freedom of speech.", "Supreme court justice can denounce a candidate"], "id": 1566}
{"full_context": ["Justice Ginsberg should be allowed to voice her opinion on Trump's ability to perform the duties of the presidency.", "Supreme court justice can denounce a candidate"], "id": 1567}
{"full_context": ["Free public education undermines private alternatives.", "College should not be free"], "id": 1568}
{"full_context": ["Comments allow those with other knowledge to act as a balance and fact check the article.", "Comment sections have not failed"], "id": 1569}
{"full_context": ["People can learn a lot from reading the comments.", "Comment sections have not failed"], "id": 1570}
{"full_context": ["The comment sections help me get an idea of how others feel about the articles.", "Comment sections have not failed"], "id": 1571}
{"full_context": ["The cost of college is high and should be paid by the individual students and not passed on to the taxpayers.", "College should not be free"], "id": 1572}
{"full_context": ["They have a duty to denounce it since the rule of law is under attack.", "Supreme court justice can denounce a candidate"], "id": 1573}
{"full_context": ["Comment sections create a connection to the world and others' observations.", "Comment sections have not failed"], "id": 1574}
{"full_context": ["There are too many deranged people out there to use your real name especially if you are a woman.", "Comment sections have failed"], "id": 1575}
{"full_context": ["Comments sections, when unfiltered, will always be vulgar, nasty, and hate-filled.", "Comment sections have failed"], "id": 1576}
{"full_context": ["Although they are human, justices must make every effort to remain unbiased.", "Supreme court justice cannot denounce a candidate"], "id": 1577}
{"full_context": ["Artificial Intelligence can play a game and not otherwise interact.", "Machines are not gaining the upper hand on humans"], "id": 1578}
{"full_context": ["It is better that justices speak openly about their opinions rather than hiding them in their legal statements.", "Supreme court justice can denounce a candidate"], "id": 1579}
{"full_context": ["Comments, with good moderation, are a part of democracy.", "Comment sections have not failed"], "id": 1580}
{"full_context": ["When activists try to be politicians it is clear they are only pursuing their own narrow objectives and visions, just to stroke their own ego.", "Activists cannot be politicians"], "id": 1581}
{"full_context": ["Airlines have become a monopoly.", "Government should regulate airline industry again"], "id": 1582}
{"full_context": ["Obviously they are human and have opinions, but they should not allow those opinions to enter the public forum.", "Supreme court justice cannot denounce a candidate"], "id": 1583}
{"full_context": ["People cannot have educated debates, rather they name call and insult in comment sections.", "Comment sections have failed"], "id": 1584}
{"full_context": ["Taking a cue from the success of the Swiss and Dutch healthcare models proves Obamacare can work, too.", "Obamacare is sustainable"], "id": 1585}
{"full_context": ["The use of a neutral appointment to denounce a political candidate is the real threat to the system.", "Supreme court justice cannot denounce a candidate"], "id": 1586}
{"full_context": ["At some point in everyone's lives they are faced with making the choice to speak up or live with what happens from their silence.", "Supreme court justice can denounce a candidate"], "id": 1587}
{"full_context": ["Doctors are arrogant if they think it's wrong to look up information.", "Medical websites are healthful"], "id": 1588}
{"full_context": ["Comment sections are important to understand why people disagree.", "Comment sections have not failed"], "id": 1589}
{"full_context": ["An imaginary line around a college campus will not suddenly change people who are not a public danger outside the line.", "Guns should be permitted on college campuses"], "id": 1590}
{"full_context": ["When activists try to be politicians it is clear they are only pursuing their own narrow objectives and visions, just to stroke their own ego.", "Activists cannot be politicians"], "id": 1591}
{"full_context": ["Medical sites are useful in the middle of the night when offices are closed.", "Medical websites are healthful"], "id": 1592}
{"full_context": ["The Supreme Court justice position is set apart from politics, and thus justices should not participate in politics.", "Supreme court justice cannot denounce a candidate"], "id": 1593}
{"full_context": ["The only 'gateway effect' of marijuana is dealers access to other criminal enterprises.", "Marijuana is not a gateway drug"], "id": 1594}
{"full_context": ["Moderated comments are a great way for unlikely sources to have their opinions heard.", "Comment sections have not failed"], "id": 1595}
{"full_context": ["If the embassy is moved to Jerusalem the Palestinians will know they need to compromise.", "The U.S. Embassy should be moved from Tel Aviv to Jerusalem"], "id": 1596}
{"full_context": ["It fills me with regret that Muslim men are continuing to use hijabs to subjugate women as they have for hundreds of years.", "Non-Muslims hurt women by wearing hijabs"], "id": 1597}
{"full_context": ["Everyone can have a committed opinion yet have the ability to decide in the best interests of others.", "Supreme court justice can denounce a candidate"], "id": 1598}
{"full_context": ["The creators of google apple and facebook deserve money for their creations, but they are raising the bar too high for competition.", "Google is a harmful monopoly"], "id": 1599}
{"full_context": ["They want to take advantage of higher tuitions paid by foreign and out of state students.", "Public universities are neglecting in-state students"], "id": 1600}
{"full_context": ["Turkey practices a different leaning ideology than other nearby countries in NATO.", "Turkey doesn't belong to NATO"], "id": 1601}
{"full_context": ["Artificial Intelligence can play a game and not otherwise interact.", "Machines are not gaining the upper hand on humans"], "id": 1602}
{"full_context": ["Everybody should be able to go.", "Overcrowded national parks should not have restricted access"], "id": 1603}
{"full_context": ["A Justice can voice an opinion on politics without breaching legal ethics.", "Supreme court justice can denounce a candidate"], "id": 1604}
{"full_context": ["Air travel is a service that should be available and accountable to all citizens.", "Government should regulate airline industry again"], "id": 1605}
{"full_context": ["The NYT seems to have good and clean comments unlike some other sites.", "Comment sections have not failed"], "id": 1606}
{"full_context": ["Every qualified student should be able to complete 2 years of community college.", "College should be free"], "id": 1607}
{"full_context": ["Medical websites help to keep doctors honest.", "Medical websites are healthful"], "id": 1608}
{"full_context": ["Comment sections permit opposing sides to see and understand the other side of a debate.", "Comment sections have not failed"], "id": 1609}
{"full_context": ["Finding one gem in the comments section is worth all of the other problems.", "Comment sections have not failed"], "id": 1610}
{"full_context": ["Turkey practices a different leaning ideology than other nearby countries in NATO.", "Turkey doesn't belong to NATO"], "id": 1611}
{"full_context": ["Comments, when moderated, provide value to readers.", "Comment sections have not failed"], "id": 1612}
{"full_context": ["The Bible is not consistent in it's treatment of sex and marriage.", "Christians have created a harmful atmosphere for gays"], "id": 1613}
{"full_context": ["People who care about spending time in these places should be willing to make early reservations for the crowded ones.", "Overcrowded national parks should have restricted access"], "id": 1614}
{"full_context": ["Christians, along with Muslims, are by far the most outspoken against gays.", "Christians have created a harmful atmosphere for gays"], "id": 1615}
{"full_context": ["It is very nice to have the information easily available.", "Medical websites are healthful"], "id": 1616}
{"full_context": ["American students would benefit from learning foreign languages, by being exposed to other cultures.", "Foreign language classes should be mandatory in college"], "id": 1617}
{"full_context": ["Comment sections provide a place for people to have their opinion heard.", "Comment sections have not failed"], "id": 1618}
{"full_context": ["Political issues have been going on throughout time and are not, and do not only happen in Brazil.", "Brazil should not postpone Olympics"], "id": 1619}
{"full_context": ["Opioid training will help stop lazy doctors from over prescribing for pain.", "Opioid training should be mandatory"], "id": 1620}
{"full_context": ["Comments are plentiful and generally well written.", "Comment sections have not failed"], "id": 1621}
{"full_context": ["Christians, along with Muslims, are by far the most outspoken against gays.", "Christians have created a harmful atmosphere for gays"], "id": 1622}
{"full_context": ["Mother Theresa was active and made a difference in the city.", "Mother Teresa should be canonized"], "id": 1623}
{"full_context": ["Free college will result in reduced funding for students that have needs that are not tuition based.", "College should not be free"], "id": 1624}
{"full_context": ["Commenters on the Washington POst are often degraded and receive personal attacks.", "Comment sections have failed"], "id": 1625}
{"full_context": ["Air travel, like other travel, should be copiously regulated.", "Government should regulate airline industry again"], "id": 1626}
{"full_context": ["Comment sections are an important place for discussion even if some posters abuse them.", "Comment sections have not failed"], "id": 1627}
{"full_context": ["We are able to take into consideration all views and come to a compromise.", "Comment sections have not failed"], "id": 1628}
{"full_context": ["Health care is a market failure, even if Health Insurance is still barely functioning.", "Obamacare is not sustainable"], "id": 1629}
{"full_context": ["Being a judge doesn't take away their right to vote and their freedom of speech.", "Supreme court justice can denounce a candidate"], "id": 1630}
{"full_context": ["Comments are plentiful and generally well written.", "Comment sections have not failed"], "id": 1631}
{"full_context": ["It is good to be informed about your health.", "Medical websites are healthful"], "id": 1632}
{"full_context": ["Addiction is a mental disorder, it is not dependent on the substance.", "Marijuana is not a gateway drug"], "id": 1633}
{"full_context": ["Onsite medical articles are helpful and can allow patients to ask their doctors better questions.", "Medical websites are healthful"], "id": 1634}
{"full_context": ["The safety and health of the participants are at risk.", "Brazil should postpone Olympics"], "id": 1635}
{"full_context": ["I recently stopped contributing to the comment section of my local newspaper.", "Comment sections have failed"], "id": 1636}
{"full_context": ["Opioids and their over-prescription and under-monitoring, not marijuana, are gateway drugs.", "Marijuana is not a gateway drug"], "id": 1637}
{"full_context": ["Justice Ginsberg can say what she likes.", "Supreme court justice can denounce a candidate"], "id": 1638}
{"full_context": ["Christianity teaches intolerance of those different.", "Christians have created a harmful atmosphere for gays"], "id": 1639}
{"full_context": ["Comment sections provide a place for people to have their opinion heard.", "Comment sections have not failed"], "id": 1640}
{"full_context": ["Nazi Germany is an example of political ideology infecting the judicial system.", "Supreme court justice cannot denounce a candidate"], "id": 1641}
{"full_context": ["People learn a lot from comment sections.", "Comment sections have not failed"], "id": 1642}
{"full_context": ["College should be free for those that are capable of performing at that level.", "College should be free"], "id": 1643}
{"full_context": ["It is also degrading to males.", "Non-Muslims hurt women by wearing hijabs"], "id": 1644}
{"full_context": ["All votes matter.", "College students' votes do matter in an election"], "id": 1645}
{"full_context": ["Prescription drugs are the real gateway drugs, as they are dangerous and lead to increased heroin addiction and death by overdose.", "Marijuana is not a gateway drug"], "id": 1646}
{"full_context": ["Comments section enable the democratic discussion of ideas.", "Comment sections have not failed"], "id": 1647}
{"full_context": ["Foreign language skills are rewarded in the job market.", "Foreign language classes should be mandatory in college"], "id": 1648}
{"full_context": ["Guns are already on college campuses.", "Guns should be permitted on college campuses"], "id": 1649}
{"full_context": ["Comments allow all views to be heard.", "Comment sections have not failed"], "id": 1650}
{"full_context": ["Legitimate medical websites help distinguish between minor and serious conditions and tell when to seek a doctor.", "Medical websites are healthful"], "id": 1651}
{"full_context": ["Addiction is a mental disorder, it is not dependent on the substance.", "Marijuana is not a gateway drug"], "id": 1652}
{"full_context": ["Hijabs are a sexist garment and should not be used as a symbol for anything.", "Non-Muslims hurt women by wearing hijabs"], "id": 1653}
{"full_context": ["Taking a cue from the success of the Swiss and Dutch healthcare models proves Obamacare can work, too.", "Obamacare is sustainable"], "id": 1654}
